{
    "next_cursor": "My4wLDE3NjE1MDUyMDAwMDAsMjU0MzMyOTc4",
    "total_results": 25489393,
    "per_page": 50,
    "data": [
        {
            "id": "ddbc1a0d-ea0d-4855-99de-fef672e34723",
            "title": "‘It: Welcome to Derry’ premieres tonight—Here’s how to watch HBO’s ‘It’ prequel",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/entertainment/how-to-watch-pennywise-prequel-it-welcome-to-derry-premiere/",
            "keywords": [
                "halloween",
                "derry",
                "shape-shifting",
                "eight-episode",
                "subscription",
                "hank madeleine stowe rudy mancuso",
                "leroy hanlon blake cameron james",
                "captain pauly russo clara stack"
            ],
            "topics": [
                "entertainment",
                "media",
                "television",
                "halloween"
            ],
            "description": "‘It: Welcome to Derry’ premieres tonight—Here’s how to watch HBO’s ‘It’ prequel",
            "pub_date": "2025-10-26T21:00:00",
            "creator": "Angela Tricarico",
            "content": "Just in time for Halloween, HBO is expanding the universe of “It.” A new prequel series, “It: Welcome to Derry,” premieres tonight, Oct. 22, on HBO and the HBO Max streaming service. “It: Welcome to Derry” comes from three of the people behind the 2017 “It” film and its 2019 sequel “It: Chapter Two” director Andy Muschietti (who directs the first four episodes of the new series), producer Barbara Muschietti, and co-producer Jason Fuchs. In the new series, a couple moves to Derry, Maine with their son, just as a local boy disappears. Set in 1962, the show will continue to trace the origins of the murderous, shape-shifting entity known as Pennywise the Dancing Clown (played by Bill Skarsgård, reprising his role from the 2017 and 2019 films). Here’s how to watch HBO’s newest Sunday night drama. ‘It: Welcome to Derry’ release date: “The Chair Company” comes out at 10 p. m. ET tonight, Oct. 12, on HBO. The episode will release at the same time on HBO’s HBO Max streaming service. How to watch ‘It: Welcome to Derry’: If you’re new to HBO Max, you can sign up for as low as $10. 99/month with ads, but an ad-free subscription will cost $18. 49/month. If you want to stream even more and save a few bucks a month while you’re at it, we recommend subscribing to one of the discounted Disney+ Bundles with Hulu and HBO Max. With ads, the bundle costs $19. 99/month and without ads, $32. 99/month. Philo is the latest streaming service to include HBO Max in bundles; after one week free, you’ll pay $33. 00/month for over 70 live channels and access to HBO Max. ‘It: Welcome to Derry’ episodes: “It: Welcome to Derry” is an eight-episode series, with new episodes airing over the next eight weeks. Episode 1: “The Pilot” Nov. 2, 9 p. m. ET Episode 2: “The Thing in the Dark” Nov. 9, 9 p. m. ET Episode 3: “Now You See It” Nov. 16, 9 p. m. ET Episode 4: TBA Nov. 23, 9 p. m. ET Episode 5: TBA Nov. 30, 9 p. m. ET Episode 6: TBA Nov. 30, 9 p. m. ET Episode 7: TBA Nov. 30, 9 p. m. ET Episode 8: TBA Nov. 30, 9 p. m. ET ‘It: Welcome to Derry’ cast: Taylour Paige as Charlotte Hanlon Jovan Adepo as Leroy Hanlon Blake Cameron James as Will Hanlon Chris Chalk as Dick Hallorann, the head chef at the Overlook Hotel from “The Shining” James Remar as General Shaw Stephen Rider as Hank Madeleine Stowe Rudy Mancuso as Captain Pauly Russo Clara Stack as Lilly Amanda Christine as Ronnie Mikkal Karim-Fidler as Teddy Bill Skarsgård as Pennywise the Clown ‘It Welcome to Derry’ timeline: “It: Welcome to Derry” is a prequel to “It” and “It: Chapter Two” that aligns with Pennywise’s 27-year cycle. Season 1 of “It: Welcome to Derry” is set in 1962, while “It” takes place in 1989 and “Chapter Two” picks up 27 years later in 2016. The creators of “It: Welcome to Derry” have envisioned a three-season storyline that continues to go further back into Derry’s history using the same 27-year cycle. A potential Season 2 would be set in 1935 and Season 3 would go back to 1908. ‘It: Welcome to Derry’ trailer: Where to stream ‘It’ and ‘It: Chapter Two’: Both “It” and “It: Chapter Two” are also streaming on HBO Max. Why Trust Post Wanted by the New York Post.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnewspress-collage-45htbbsoh-1761155532641.jpg?quality%3D90%26strip%3Dall%261761141266",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnewspress-collage-45htbbsoh-1761155532641.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.092,
                "neg": 0.021,
                "neu": 0.886
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "30c7fca1-357a-4e9e-98a2-a0198d541bd6",
            "title": "The urge Lane Kiffin can’t give into at Ole Miss",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/the-urge-lane-kiffin-cant-give-into-at-ole-miss/",
            "keywords": [
                "lane kiffin",
                "don",
                "interested",
                "florida",
                "success",
                "is clearly interested",
                "florida is clearly",
                "mess with success"
            ],
            "topics": [
                "general"
            ],
            "description": "The urge Lane Kiffin can’t give into at Ole Miss",
            "pub_date": "2025-10-26T20:59:24",
            "creator": "Zach Braziller",
            "content": "Three words of advice for Lane Kiffin: Don’t do it. Don’t mess with happy. Don’t mess with success. Don’t even tempt fate. Florida is clearly interested. Penn State should be, too. LSU could wind up needing a new coach as well at this rate.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnewspress-collage-jf9f914bi-1761512227760.jpg?quality%3D90%26strip%3Dall%261761497881",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnewspress-collage-jf9f914bi-1761512227760.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.267,
                "neg": 0.089,
                "neu": 0.644
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "8b3791e8-0518-42f7-8f7a-3c4493bd6a58",
            "title": "Starmer set for Turkey visit to discuss fighter jets deal",
            "source_title": "Evening Standard",
            "source_link": "https://www.standard.co.uk",
            "article_link": "https://www.standard.co.uk/news/politics/keir-starmer-ankara-head-prime-minister-turkish-b1254990.html",
            "keywords": [
                "offender",
                "deported",
                "mistaken",
                "migrant",
                "mistaken release caused",
                "says mistaken release",
                "migrant sex offender",
                "father says mistaken"
            ],
            "topics": [
                "general"
            ],
            "description": "Starmer set for Turkey visit to discuss fighter jets deal",
            "pub_date": "2025-10-26T20:55:15",
            "creator": "David Hughes",
            "content": "Epping migrant sex offender to be ‘deported’ this week as victim’s father says mistaken release caused ‘so much stress and anxiety’ Epping migrant sex offender to be ‘deported’ this week.",
            "media_url": "https://static.standard.co.uk/2025/10/26/20/4b6e869ad43d2f0af00dc921a1ea6fe9Y29udGVudHNlYXJjaGFwaSwxNzYxNTk3MDkz-2.80789709.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.284,
                "neu": 0.716
            },
            "source": {
                "id": "evening-standard",
                "country": "GB",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "bce62aea-23c6-4fad-84a9-591c9e80e175",
            "title": "SDSU coach’s ‘insane’ tan line becomes unexpected focal point on FS1 broadcast",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/fs1-broadcast-calls-out-sdsu-coachs-insane-tan-line/",
            "keywords": [
                "san diego",
                "sean lewis",
                "fourth-quarter",
                "broadcasters",
                "play-by-play",
                "play-by-play announcer noah",
                "fs1 play-by-play announcer",
                "color commentator robert"
            ],
            "topics": [
                "entertainment",
                "media"
            ],
            "description": "SDSU coach’s ‘insane’ tan line becomes unexpected focal point on FS1 broadcast",
            "pub_date": "2025-10-26T20:36:03",
            "creator": "Cooper Albers",
            "content": "Here’s the thing about broadcasters: they notice everything. San Diego State head coach Sean Lewis became the center of attention on an FS1 broadcast for sporting an “insane” tan line before the Aztecs’ Saturday matchup against Fresno State. Lewis covered up the striking tan line with a hat during the game, but that didn’t stop the Fox Sports crew from poking fun at the coach for the viewers at home. “There’s a look at Sean Lewis,” said FS1 play-by-play announcer Noah Reed late in the first quarter. “Looks normal, right? College football head coach.” “Well, he’s got a hat on, because pregame, this is what he looked like,” Reed added, accompanied by a pregame look at Lewis. “That is one of the most insane tan lines I’ve ever seen,” he said with a laugh. Added color commentator Robert Smith: “No bald comments? I thought the bald comment was coming there for me.” “I save those for you,” Reed quipped. Despite their coach’s head soaking up the sunlight, the Aztecs had no trouble shining in a dominant 23-0 road win over the Bulldogs. Running back Lucky Sutton led the attack with 132 rushing yards and a touchdown, and linebacker Tano Letuli punctuated the shutout with a fourth-quarter pick-6. SDSU, winners of five straight, improved to 6-1 on the season and remained undefeated in Mountain West play. After two weeks on the road, the Aztecs return to San Diego to host Wyoming on Nov. 1.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2FScreenshot-2025-10-26-113234.png?w%3D832",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.134,
                "neg": 0.063,
                "neu": 0.803
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "fe5b675b-01cd-4227-ab6c-441755fba375",
            "title": "Jonas Brothers’ mid-game World Series performance confuses MLB fans",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/jonas-brothers-mid-game-world-series-performance-baffles-fans/",
            "keywords": [
                "lose",
                "stand up",
                "jacobpacheco6",
                "bewilderment",
                "intermission",
                "jacobpacheco6 wrote alongside",
                "media expressing bewilderment",
                "expressing bewilderment over"
            ],
            "topics": [
                "entertainment",
                "sports",
                "media"
            ],
            "description": "Jonas Brothers’ mid-game World Series performance confuses MLB fans",
            "pub_date": "2025-10-26T20:28:33",
            "creator": "Jaclyn Hendricks",
            "content": "Some MLB fans were caught off guard Saturday when the Jonas Brothers took the stage midway through the Dodgers’ eventual Game 2 win over the Blue Jays in the World Series. Performing “I Can’t Lose” as part of the “Stand Up to Cancer” initiative, in which players, personnel and spectators hold up placards to pay tribute to those impacted by cancer, the pop trio was featured after the fifth inning with the score tied at one apiece resulting in some on social media expressing bewilderment over the timing of the in-game show, not the campaign itself. “As touching as this moment was. doing it in the middle of the World Series Game 2 tie game?? And then randomly have the Jonas Brothers sing???” an X user posted. “Jonas Brothers playing in between innings of the World Series was not on my bingo card,” another user wrote on X. While one X user provided clarity on the moment in question, they too thought the appearance from the JoBros was “super random.” “For anyone wondering, that wasn’t new. The MLB does this ‘stand up to Cancer’ intermission at the All-Star games and at some point during the #WorldSeries,” X user @JacobPacheco6 wrote alongside a snap from a similar occurrence at the MLB All-Star Game in July. “Touching moment. But the Jonas Brothers was super random.” The in-stadium “Stand Up to Cancer” placard moment has been an MLB tradition for years, per the league’s official website. The Jonas Brothers, comprised of siblings Kevin Jonas, 37, Joe Jonas, 36, and Nick Jonas, 33, honored their father, Kevin Jonas Sr., a cancer survivor. The Dodgers, who were walloped 11-4 in Game 1, closed out the second game in Toronto with a 5-1 victory at the Rogers Centre. Star pitcher Yoshinobu Yamamoto struck out eight in his second consecutive complete game. Game 3 of the World Series gets underway Monday in Los Angeles.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fjonas-brother-perform-following-fifth-114205435.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.062,
                "neg": 0.038,
                "neu": 0.9
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "08e86f83-3b32-4d8d-9042-598bdf614c94",
            "title": "NFL roundup: Jets snatch first win of season; Giants’ Skattebo suffers gruesome ankle injury",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/2025/oct/26/nfl-scores-sunday-football",
            "keywords": [
                "bengals breece hall",
                "mason taylor",
                "philadelphia",
                "double-digit",
                "quarterback",
                "with double-digit receptions",
                "two second-half touchdowns",
                "philadelphia eagles saquon"
            ],
            "topics": [
                "sports",
                "entertainment"
            ],
            "description": "Jets come back from 14-point deficit in fourth quarterCostly injuries blight Eagles’ win over GiantsBreece Hall rushed for two second-half touchdowns and threw a four-yard TD pass to Mason Taylor with 1: 54 left, helping the New York Jets edge the Cincinnati Bengals for their first win of the season.",
            "pub_date": "2025-10-26T20:27:00",
            "creator": "Agencies",
            "content": "New York Jets 39-38 Cincinnati Bengals Breece Hall rushed for two second-half touchdowns and threw a four-yard TD pass to Mason Taylor with 1: 54 left, helping the New York Jets edge the Cincinnati Bengals for their first win of the season. Justin Fields was 21 for 32 for 244 yards and a touchdown in his first game since Jets owner Woody Johnson sharply criticized his team’s quarterback play during their winless start. Hall finished with 18 carries for 133 yards. The Jets (1-7), who trailed 31-16 after three quarters, rolled to 502 yards of offense in their highest scoring game of the season, including a season-high 254 on the ground. Joe Flacco passed for two touchdowns and rushed for a one-yard score, but the Bengals (3-5) lost for the fifth time in six games. Ja’Marr Chase had 12 catches for 91 yards in his third consecutive game with double-digit receptions. New York Giants 20-38 Philadelphia Eagles Saquon Barkley ran for a 65-yard score on his first carry of the game and topped 100 yards rushing for the first time this season in the Philadelphia Eagles’ victory over the New York Giants (2-6). Barkley finished with 150 yards rushing and caught one of Jalen Hurts’ four touchdown passes before he left the game with a groin injury. The Eagles (6-2) evened the season series against their division rivals. The Giants’ run at their first season sweep of the Eagles since 2007 and first win at Philadelphia since 2013 suffered a serious blow when rookie Cam Skattebo suffered a dislocated ankle and was taken to a hospital for further evaluation. Skattebo was carted off the field after he took a hard hit over the middle and went down. His foot appeared to twist backward, and players from both teams huddled around the standout running back until he was taken off the field. Chicago Bears 16-30 Baltimore Ravens Derrick Henry ran for two touchdowns, Tyler Huntley made a big third-down throw late in the fourth quarter and the Baltimore Ravens finally won without Lamar Jackson. The Ravens snapped a four-game skid and ended Chicago’s four-game winning streak. The Bears (4-3) dominated the first quarter but managed only two field goals in that period and didn’t score again until the fourth. Although Jackson returned to practice this week, he was ruled out Saturday for a third straight game because of a hamstring injury. The Ravens (2-5) had lost 11 of their previous 13 when their star quarterback didn’t play. Buffalo Bills 40-9 Carolina Panthers James Cook ran for a career-high 216 yards and two touchdowns, Josh Allen accounted for three touchdowns and the Buffalo Bills (5-2) returned from their bye with a resounding win over the Carolina Panthers (4-4). Allen improved to 8-0 following the bye week and established an NFL record by becoming the first player to run and throw for a touchdown in 46 games, breaking the mark previously held by former Panthers QB Cam Newton. Allen’s 77 career rushing touchdowns (including playoff games) tied Newton for the most all-time. Cook had touchdown runs of 64 and 21 yards. Cleveland Browns 13-32 New England Patriots Drake Maye passed for three touchdowns as the New England Patriots extended their winning streak to five games by beating the Cleveland Browns. Maye completed 18 of his 24 pass attempts for 282 yards. He was intercepted once. Each of his three TD passes came in the third quarter. The Patriots (6-2) were helped by three field goals from Andy Borregales. Cleveland (2-6) defensive end Myles Garrett recorded a franchise-record five sacks in the loss. Garrett passed Reggie White and set the NFL record for career sacks by a player under the age of 30 with his first sack in the game. Garrett has 10 sacks this season and 112. 5 for his career. Cleveland’s Dillon Gabriel was 21 of 35 for 156 yards. He threw two touchdowns and was intercepted twice. Miami Dolphins 34-10 Atlanta Falcons Tua Tagovailoa threw a season-high four touchdown passes and the Miami Dolphins ended their three-game losing streak by dominating the short-handed Atlanta Falcons. The Dolphins (2-6) held the Falcons (3-4) to 213 yards. Tagovailoa completed 20 of 26 passes for 205 yards with scoring passes to De’Von Achane, Malik Washington, Jaylen Waddle and Ollie Gordon II. The Falcons were without quarterback Michael Penix Jr, top wide receiver Drake London and sacks leader Zach Harrison, among others, due to injuries. Atlanta veteran quarterback Kirk Cousins made his first start of the season. Bijan Robinson was held to 25 rushing yards. San Francisco 49ers 15-26 Houston Texans CJ Stroud threw for a season-high 318 yards with two touchdowns and the Houston Texans got off to a quick start and held on for victory over the San Francisco 49ers. Stroud completed passes to nine different players with star receiver Nico Collins out after sustaining a concussion Monday night. Xavier Hutchinson led the group with 69 yards receiving and a score to help the 3-4 Texans bounce back after a loss to Seattle. Mac Jones had trouble getting San Francisco’s offense going. He threw for 193 yards and two touchdowns in his fourth straight game and sixth this season filling in for the injured Brock Purdy. The Niners fell to 5-3.",
            "media_url": "https://i.guim.co.uk/img/media/86dde75bc79b0941bc6903abb2604e68a594590a/200_0_3105_2484/master/3105.jpg?width=140&quality=85&auto=format&fit=max&s=2967e68fbc6b77f16c6d367a6aa6ee9c",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Joshua A Bickel/AP",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.066,
                "neg": 0.053,
                "neu": 0.881
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "48e655a9-0422-4183-b82a-8425f3b98d9c",
            "title": "Putin puppet makes chilling 'nuclear weapons' suggestion in rage over Trump sanctions",
            "source_title": "Daily Express",
            "source_link": "https://www.express.co.uk",
            "article_link": "https://www.express.co.uk/news/world/2126228/putin-puppet-vladimir-solovyov-russia-nuclear-weapons",
            "keywords": [
                "vladimir solovyov",
                "donald trump",
                "disrespecting",
                "propagandist",
                "organisation",
                "non-profit organisation russian",
                "kremlin propaganda orchestrator",
                "propagandist vladimir solovyov"
            ],
            "topics": [
                "politics",
                "international"
            ],
            "description": "Kremlin should move on \"from planned exercises\" to the \"unannounced use of tactical nuclear weapons\", according to the Kremlin propagandist Vladimir Solovyov.",
            "pub_date": "2025-10-26T20:27:00",
            "creator": "Laura Zilincanova",
            "content": "Russian propagandist Vladimir Solovyov has suggested using tactical nuclear weapons in response to the recent sanctions from the US and Donald Trump against Russia. The non-profit organisation Russian Media Monitor has shared a clip of Solovyov, an ally of Putin and key Kremlin propaganda orchestrator, claiming on the Russian radio show Full Contact that THE Kremlin should move on \"from planned exercises\" to the \"unannounced use of tactical nuclear weapons\". According to Solovyov, Russia should start \"carrying out strikes on a number of targets that will be determined by the military to radically change the course of the war.\" Article continues below ADVERTISEMENT He continues: \"Then, I think we should freeze relations, we should recall our Ambassador from the US, we should recall our Ambassador from Great Britain. Trump cancelled the meeting, and said it will happen later. Why is Trump the one to determine this? The bromance is over,\" Solovyov adds. He also accuses Trump of disrespecting Putin, claiming Russia should use weapons \"of a different level of power and ruthlessness\". Solovyov's reaction ties to the new US sanctions against Russia announced on Wednesday. They were the first sanctions imposed on Russia since Trump returned to office and are expected to hurt the country's revenues. Article continues below ADVERTISEMENT However, Russia's president Vladimir Putin has insisted that they were not strong enough to affect the economy. In the video, Solovyov goes on to suggest that Venezuela, whose leader, President Nicolás Maduro, is a Trump adversary, and should be supplied with weapons to take the fight to the US.",
            "media_url": "https://cdn.images.express.co.uk/img/dynamic/78/590x/2126228_1.jpg",
            "media_type": "img/jpeg",
            "media_description": "Russian President Vladimir Putin in Alaska",
            "media_credit": "Getty",
            "media_thumbnail": "https://cdn.images.express.co.uk/img/dynamic/78/237x141/2126228_1.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.041,
                "neg": 0.106,
                "neu": 0.853
            },
            "source": {
                "id": "daily-express",
                "country": "GB",
                "political_leaning": "right",
                "reliability_score": 5.0,
                "type": "newspaper"
            }
        },
        {
            "id": "b32cd227-8dec-4a6a-a185-d8e16d0be1d6",
            "title": "‘Love Is Blind’ star Anna Yuan hits back at ‘weird’ body shamers after 40-pound weight loss",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://pagesix.com/2025/10/26/celebrity-news/love-is-blind-star-anna-yuan-hits-back-at-body-shamers-after-40-pound-weight-loss/",
            "keywords": [
                "love is blind",
                "anna yuan",
                "connections",
                "hairstylist",
                "comfortable",
                "previously condemned negative",
                "condemned negative comments",
                "instagram stories saturday"
            ],
            "topics": [
                "social",
                "entertainment",
                "media"
            ],
            "description": "“Reminder that it’s weird as f--k to message a person you don’t know to comment about their weight or physical appearance,” she wrote on Instagram.",
            "pub_date": "2025-10-26T20:26:40",
            "creator": "Tamantha Ryan",
            "content": "“Love Is Blind” star Anna Yuan hit back at body shamers who commented on her 40-pound weight loss following Season 9 of the show. “Reminder that it’s weird as f-k to message a person you don’t know to comment about their weight or physical appearance,” she wrote on her Instagram Stories Saturday. “Please, for the love of God touch grass!” Yuan added. The reality star, 28, added that she has lost about 40 pounds since filming wrapped. “It is not that deep and again you are WEIRD,” she wrote. Yuan previously condemned negative comments fans made about her weight after the Season 9 premiere hit the streaming platform on Oct. 1. “Hi friends, reminder that I am human. A human who has devoted her life into a craft to make other women feel beautiful,” she wrote on her Instagram Story on Oct. 2. “I have struggled with my weight since I was a little girl. For the first time in my life, I am proud of how healthy I am. I’m not a character. I’m a real human being just like you. Be kind. Love you all anyway,” she added. Yuan made connections with both Patrick Suzuki and Blake Anderson while they were dating in the pods. However, halfway through the experiment, the hairstylist withdrew from the hit Netflix dating show without telling any of her connections she was leaving because she wasn’t comfortable on camera. “I started seeing myself being pretty vulnerable, and it scared me a little bit because this is an intimate part of my brain,” she told Netflix’s Tudum earlier this month. “These are very sensitive topics for me. It’s not that I’m just sharing it with whoever I’m dating or the other women this is going to be broadcast for people,” she added. Yuan later revealed that she privately reached out to Suzuki, who was her top connection on the show, to apologize. “The only thing I cared about was hurting Patrick with how exited the show and I deeply regretted that,” she wrote on her Instagram Stories earlier this month. “Since then him and I have built a friendship that means a lot to me. And that’s all that matters. Although I’m grateful for this experience this was filmed almost 2 years ago and when I left I wanted that chapter to come to a close.”.",
            "media_url": "https://pagesix.com/wp-content%2Fuploads%2Fsites%2F3%2F2025%2F10%2Flove-blind-season-9-anna-114250072.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.124,
                "neg": 0.061,
                "neu": 0.814
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "8a97d353-782c-4a91-b6c8-fa918f43644a",
            "title": "I nearly died of alcoholism — but I found purpose in life rescuing street dogs",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/world-news/i-nearly-died-of-alcoholism-but-i-found-purpose-in-life-rescuing-street-dogs/",
            "keywords": [
                "harbison",
                "valium",
                "entrepreneur",
                "emotionally",
                "permanently",
                "consuming massive quantities",
                "popular tourist destination",
                "followers across instagram"
            ],
            "topics": [
                "social",
                "media"
            ],
            "description": "Short videos that he has posted online showing him feeding dogs quickly went viral -- with social media users from around the world offering to help.",
            "pub_date": "2025-10-26T20:26:34",
            "creator": "Ariel Zilber",
            "content": "Niall Harbison was on the edge of death, alone, in an ICU in Thailand after consuming massive quantities of alcohol and Valium in 2020 when he made a deal with himself. “I just said . I’ve got to do something meaningful in my life,” he told The Post. “I was, like, 41, miserable, and ended up in the emergency room,” said Harbison, who left a successful career as a social media entrepreneur and private chef in Dublin and relocated to Southeast Asia permanently. Harbison, now 46, begged for another lease on life pledging that he would not let it go to waste. “If I survive, I’m gonna do something that actually makes a difference in the world, and I’d always loved dogs, so I just started feeding street dogs,” he recalled. Five years later, Harbison has come a long way. The short videos that he has posted online showing him feeding dogs quickly went viral with social media users from around the world offering to help. “I definitely didn’t expect it to turn into something this big,” he said from his home on the island of Koh Samui a popular tourist destination 300 miles south of Bankok. With more than 1 million followers across Instagram, X and TikTok, Harbison has built a nonprofit, Happy Doggo, which is devoted to reducing the stray dog population globally while educating humans on best practices to keep the pooches safe and happy. Each morning before sunrise, Harbison hops on his moped and heads out to feed the street dogs scattered across Koh Samui. “I feed 100 street dogs. I do that at 7 a. m. on my moped,” he said. “Before it gets hot or busy.” But no day goes according to plan. “A dog could have been hit by a car, six puppies could be dumped by the side of the road, there could be a dog that’s been shot,” he said. “From then on, the day, really, anything can happen.” The chaos is constant. “It’s insane. I mean, there’s no day that’s the same,” Harbison said. “Normally, I’ll have plans to catch up on admin or something, but we’ll get dogs from 8 in the morning . we could really be anywhere.” The work can be brutal. Harbison, who has been open about his suffering from bouts of depression, said some days leave him emotionally exhausted. “I’m just struggling here. It’s Friday evening here, and I’m struggling. We saw some bad stuff this week,” he revealed. Several of Harbison’s rescues have been victims of violence, including one dog that was stabbed several times in the stomach and another that suffered gunshot wounds. “It’s very, very emotionally draining. There’s times where I can’t. It gets the better of me, and I have to just, like, lay down in a dark room for an hour,” he said. Harbison keeps moving, he said, because no one else will. “The only thing that keeps me going is the dogs. They’ve got nobody to count on, so you’ve got to help them and try and move on to the next one.” That resolve has been tested more than once. Harbison has twice been confronted by locals while feeding dogs once by a man with a knife, another time by someone who appeared to have a gun. The violence, he said, stems less from malice than from culture and survival. “It’s a societal problem rather than one guy with an anger-management issue.” “These guys will be chicken farmers or have buffalo, and suddenly a bunch of stray dogs will come along that maybe eat one of their chickens. The rule of the land is you can kind of shoot the dog.” Instead of meeting anger with anger, he tries to model something else. “I could just be angry at the people who’ve shot the dog,” Harbison said. “A white person being angry is not really gonna change much. I have to change the whole culture through kindness, and community building and education.” Harbison now oversees a full-scale rescue operation with a team of 22 employees cooks, medics and field staff who care for the 1, 200 dogs fed daily by Happy Doggo. “We have, like, a hospital now, and we are trying to build a mobile clinic,” he said. Harbison’s aim is to expand the campaign of sterilization to bring down the number of street dogs while at the same time educating locals on how best to care for the canines. “Next year is where the big growth comes. We’re gonna go to 40 or 50 [staff], because we’re building these mobile clinics,” he said. To help fund the expansion, Harbison has turned his attention to an unlikely challenge running the Bangkok Marathon with just a month to prepare. “We were having a meeting and it was like, ‘Oh, we need to raise this money,’” he said. “And I was like, ‘OK, f-k it, I’ll do the marathon.'” He originally planned to train over six months, but kept putting it off. Harbison said the race will raise money for new mobile veterinary clinics vans equipped to travel into rural Thai communities where stray dogs are often shot or abandoned. The marathon, he added, is also personal. “So I’ve only got 30 days’ training, so it’s gonna be even tougher than a normal marathon but it’s for the dogs,” Harbison said. The run, he explained, is part of something bigger. Beyond the fundraiser, he’s chasing what he calls a lifelong mission: cutting the world’s 500 million street dogs in half. To get there, he relies on three pillars sterilization, education and legislation the framework he believes can turn small rescues into lasting change. “I can do a bit on the ground and raise some money and get people involved,” Harbison said. “But I know that I need to get governments to change. They’re the ones who can make the real difference.”.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F114122316.jpg?quality%3D90%26strip%3Dall",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F114122316.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.07,
                "neg": 0.135,
                "neu": 0.794
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "3646fdf5-c07b-4073-8a21-d760054a6ea1",
            "title": "Hadush Kebatu’s victim, 14, ’caused so much stress and anxiety’ over his release",
            "source_title": "Evening Standard",
            "source_link": "http://www.standard.co.uk",
            "article_link": "https://www.standard.co.uk/news/uk/ministry-of-justice-epping-labour-london-essex-b1254983.html",
            "keywords": [
                "kebatu",
                "hadush kebatu",
                "irresponsible",
                "disrespecting",
                "metropolitan",
                "released accidentally sponsored",
                "immigration detention centre",
                "accidentally sponsored get"
            ],
            "topics": [
                "crime",
                "stress",
                "anxiety",
                "media"
            ],
            "description": "Hadush Kebatu’s victim, 14, ’caused so much stress and anxiety’ over his release",
            "pub_date": "2025-10-26T20:24:11",
            "creator": "Ellie Ng",
            "content": "Kebatu was jailed for a year in September for sexually assaulting the teenager. Hadush Kebatu’s teenage victim was said to be ‘stressed and anxious’ about his mistaken release (Metropolitan Police/PA) PA Media Ellie Ng 4 minutes ago The mistaken release of a sex offender from prison caused his teenage victim “so much stress and anxiety”, her father has said as he condemned the error as “unbelievably irresponsible”. Hadush Kebatu was jailed for a year in September for sexually assaulting a 14-year-old girl, who has anonymity, and was wrongly freed from HMP Chelmsford on Friday morning instead of being sent to an immigration detention centre. The migrant, who had been living at the Bell Hotel in Epping, Essex, when he assaulted the girl, travelled from Chelmsford to London and was arrested on Sunday morning in Finsbury Park. In a statement read out by Shane Yerrell, Independent councillor for Epping Forest District Council (EFDC), the victim’s father said his traumatised daughter had been slowly regaining her confidence after the events. “Friday’s news has caused her so much stress and anxiety,” he said. “She feared seeing him again in the high road and him recognising her. I’m really worried for my daughter’s mental health and wellbeing because of this assault. “This man is a real danger to young women and children and for him to be wrongly released and walking the streets freely just four months after carrying out two sexual assaults, only five weeks after being sentenced, all because of a system failure on Friday is unbelievably irresponsible.” He said the entire family feel “massively let down and infuriated” by the prison, police, justice system and Government. “They have all failed, not just us as a family, but they have failed everyone in the country,” the father said. “I had to find out from a reporter that my daughter’s attacker was accidentally released in the day, then be sent images and videos of him walking around throughout the day before the police even alerted her mother. “Then later that day when I attended HMP Chelmsford to seek some answers I was greeted with hostility and complete disregard for anything I said or asked, totally disrespecting me and my family.” Read More Woman raped in Walsall in 'racially aggravated' attack Epping migrant sex offender to be ‘deported’ this week Timeline of events in case of asylum seeker who was released accidentally Sponsored Get ahead with expert services designed to boost business development The father, who expressed hopes that Kebatu will be deported “immediately”, also said he feared the sex offender would hurt someone else. “If anything had happened to another child or female then that would have been on the heads of HMP Chelmsford, as well as the police and the justice system and our Labour Government,” he said. The Ministry of Justice declined to comment further, with David Lammy telling broadcasters on Friday afternoon that he recognises it will have been an “anxious time” for Kebatu’s victims and their families, and for “many” women, adding: “I’m glad that we have brought that to an end.” The Justice Secretary said he will announce an independent inquiry into the incident in Parliament on Monday. The Bell Hotel, where Kebatu was living before his conviction, became the focal point of demonstrations and counter-protests over the summer following his criminal charges, which eventually led to demonstrations outside hotels housing asylum seekers across the country. A group of around 60 protesters holding union and St George’s flags gathered outside the Essex hotel on Sunday evening. The Bell Hotel became the focal point of demonstrations and counter-protests over the summer (Lucy North/PA) PA Wire The hotel is at the centre of an ongoing High Court battle between EFDC and Somani Hotels, which owns the Bell. The council is currently waiting to find out whether it has been successful in its bid for a High Court injunction blocking asylum seekers from being housed there. EFDC launched the legal action claiming that accommodating asylum seekers there breaches planning rules, and the company opposes the claim. The Home Office has intervened in the case, telling the court the council’s bid is “misconceived”. The Bell has been used to house single adult males since April, with barristers for the Home Office telling the court that it currently houses around 95 people. It first housed asylum seekers from May 2020 to March 2021 and accommodated single adult males from October 2022 to April 2024, with the council taking no enforcement action. EFDC was granted a temporary injunction in mid-August but this was overturned at the Court of Appeal later that month. MORE ABOUT.",
            "media_url": "https://static.standard.co.uk/2025/10/26/19/1030baf413430e65c1e35a837683c37aY29udGVudHNlYXJjaGFwaSwxNzYxNTkwMDk2-2.82157821.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Media",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.053,
                "neg": 0.189,
                "neu": 0.758
            },
            "source": {
                "id": "evening-standard",
                "country": "GB",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "0bc189a2-e121-4d88-9f0b-33cb87741630",
            "title": "Jets get first win with stunning comeback against Bengals hours after Nick Mangold’s death",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/jets-get-first-win-against-bengals-hours-after-nick-mangolds-death/",
            "keywords": [
                "nick mangold",
                "aaron glenn",
                "what-could-go-wrong",
                "fourth-and-two",
                "quarterback",
                "ageless 40-year-old quarterback",
                "best offensive performance",
                "had a what-could-go-wrong"
            ],
            "topics": [
                "general"
            ],
            "description": "Jets get first win with stunning comeback against Bengals hours after Nick Mangold’s death",
            "pub_date": "2025-10-26T20:22:05",
            "creator": "Mark Cannizzaro",
            "content": "CINCINNATI Who exactly saw this coming? The joy in this being the team’s first victory of the season after opening with seven consecutive losses and the fact that it was a first NFL win as a head coach for Jets leader Aaron Glenn was muted. The team announced about an hour before kickoff that Mangold, their star center from 2006-16, had suddenly succumbed to a rare genetic kidney disorder at age 41. The Jets and their depleted roster on this day looked like it would be no match for the Bengals. Considering they were without their best cornerback, Sauce Gardner, and both of their starting receivers, Garrett Wilson and Josh Reynolds, the day for the Jets had a what-could-go-wrong? vibe. They were playing a Cincinnati team led at the moment by ageless 40-year-old quarterback (and former Jet) Joe Flacco. Flacco was slinging the ball around to arguably the top receiving tandem in the league in Ja’Marr Chase and Tee Higgins. Chase, who entered the game as the NFL’s leader in receptions (58), was coming off a 16-catch, 161-yard, one-TD performance last week against the Steelers. There seemed to be so much going against the Jets on this day, with Chase and Higgins being covered by rookie corner Azareye’h Thomas, who was making his first NFL start, and Brandon Stephens. Offensively, the Jets entered the game having failed to score a single touchdown in their previous two games. Yet on Sunday, they broke out with their best offensive performance of the season. They amassed 503 yards of offense. Their quarterback, Justin Fields, who was publicly ripped by team owner Woody Johnson earlier in the week, played one of his best games, completing 21 of 32 passes for 244 yards and a TD. Their running game exploded with Breece Hall rushing for 133 yards and two TDs and throwing the game-winner on a halfback option to rookie tight end Mason Taylor with 1: 54 remaining. The Jets ended their dubious TD-less streak when Fields connected with Tyler Johnson for a 15-yard scoring pass on fourth-and-two with 5: 18 remaining in the first half. That cut the Cincinnati lead at the time to 17-10. Typical of the Jets, though, on a day when their offense finally showed some life, their defense let them down, allowing 24 points in the first half, which ended with Cincinnati leading 24-13. The Jets closed the deficit to 24-16 on Nick Folk’s fourth field goal, this one from 24-yards out with 6: 12 remaining in the third quarter. That score was made possible by a 50-yard run by running back Isaiah Davis. The Jets defense then answered that score by allowing the Bengals to march another 65 yards essentially uncontested and take a 31-16 lead on a 32-yard scoring run by Samaje Perine, his second TD of the day. The Jets cut that lead to 31-24 on a 5-yard TD run by Hall followed by a successful 2-point conversion with 14: 17 remaining in the game. It was Hall’s first TD of the season. Again, the defense failed spectacularly, as the Bengals took the next possession and cruised effortlessly down the field to take a 38-24 lead on a Chase Brown TD with 10: 21 remaining. The Jets offense, relentless on this day, cut it to 38-31 on a 27-yard Hall scoring run and a successful 2-point conversion with 7: 52 remaining.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnew-york-jets-running-back-114251123.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.076,
                "neg": 0.071,
                "neu": 0.853
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "5babe04b-5849-497a-9690-2734de48822b",
            "title": "Russia has tested a new nuclear-capable missile, Putin and top general say",
            "source_title": "Los Angeles Times",
            "source_link": "https://latimes.com",
            "article_link": "https://www.latimes.com/world-nation/story/2025-10-26/russia-has-tested-a-new-nuclear-capable-missile-putin-and-top-general-say",
            "keywords": [
                "vladimir putin",
                "putin",
                "intercontinental",
                "nuclear-capable",
                "nuclear-powered",
                "including intercontinental ballistic",
                "intercontinental ballistic missiles",
                "burevestnik reportedly suffered"
            ],
            "topics": [
                "general"
            ],
            "description": "Russia has tested a new nuclear-capable cruise missile, moving closer to deploying it, according to President Vladimir Putin. Meanwhile, overnight attacks killed at least three people in Ukraine.",
            "pub_date": "2025-10-26T20:20:44",
            "creator": "Los Angeles Times",
            "content": "Russia tested a new nuclear-capable, nuclear-powered cruise missile designed to confound existing defenses, inching closer to deploying it to its military, President Vladimir Putin said in remarks released Sunday. The announcement, which followed years of tests of the Burevestnik missile, comes as part of nuclear messaging from the Kremlin, which has resisted Western pressure for a ceasefire in Ukraine and strongly warned the U. S. and other NATO allies against sanctioning strikes deep inside Russia with longer-range Western weapons such as the U. S.-made Tomahawk. A video released by the Kremlin showed Putin, dressed in camouflage fatigues, receiving a report from Gen. Valery Gerasimov, Russia’s chief of general staff, who told the Russian leader that the Burevestnik covered 8, 700 miles in a key test Tuesday. Gerasimov said the Burevestnik “storm petrel” in Russian spent 15 hours in the air on nuclear power, adding, “That’s not the limit.” Mysterious history Little is known about the Burevestnik, which was code-named Skyfall by NATO, and many Western experts have been skeptical about it, noting that a nuclear engine could be highly unreliable. When Putin first revealed that Russia was working on the weapon in his 2018 state of the nation address, he said it would have an unlimited range, allowing it to circle the globe undetected by missile defense systems. Many observers argue that such a missile could be difficult to handle and pose an environmental threat. The U. S. and the Soviet Union worked on nuclear-powered missiles during the Cold War, but they eventually shelved the projects, considering them too hazardous. The Burevestnik reportedly suffered an explosion in August 2019 during tests at a navy range on the White Sea, killing five nuclear engineers and two service members and resulting in a brief surge in radioactivity that fueled fears in a nearby city. Russian officials never identified the weapon involved, but the U. S. said it was the Burevestnik. “We need to determine the possible uses and begin preparing the infrastructure for deploying these weapons to our armed forces,” Putin told Gerasimov. The Russian leader also claimed it was invulnerable to current and future missile defenses, because of what he said is its almost unlimited range and unpredictable flight path. Kirill Dmitriev, a top Putin aide who was in the U. S. as the video surfaced, said his delegation informed American colleagues of the “successful testing” of the Burevestnik, which he said was an “absolutely new class” of weapon. Last week, Putin directed drills of Russia’s strategic nuclear forces that featured practice missile launches. The exercise came as his planned summit on Ukraine with President Trump was put on hold. The Kremlin said that the maneuvers involved all parts of Moscow’s nuclear triad, including intercontinental ballistic missiles that were test-fired from launch facilities in northwestern Russia and a submarine in the Barents Sea. The drills also involved Tu-95 strategic bombers firing long-range cruise missiles. The exercise tested the skills of military command structures, the Kremlin said in a statement Wednesday. Attacks in Ukraine Meanwhile in Ukraine, Russia targeted the capital of Kyiv with drones, killing three people in their homes, authorities said early Sunday. At least 29 people were wounded, seven of them children, in the second consecutive nighttime attack on Kyiv to claim civilian lives. Ukraine’s Interior Minister Ihor Klymenko said a 19-year-old woman and her 46-year-old mother were among the killed. Russian drones caused fires in two residential buildings in the capital’s Desnianskyi district. Emergency crews evacuated civilians from nine-story and16-story buildings, put out flames and cleared the rubble. Olha Yevhenivha, 74, said there was so much smoke from the fire that she couldn’t leave her apartment. “Even until now our windows are totally black from the smoke, and it was impossible to go down, so that’s why we put wet blankets on our doors and balcony,” she said. Ihor Motchanyi, a soccer player, said he and his parents “miraculously survived” after a drone sparked a blaze inside their home the day after his 25th birthday. “My mother and I left. My father stayed behind in the apartment and wanted to take some documents, the most important things. He couldn’t get out because there was a fire, so he jumped down from the [third] floor” into a nearby tree, Motchanyi told the Associated Press. He said his family was planning to temporarily leave Kyiv, and stay with relatives in a village. Russia attacked Ukraine with 101 drones overnight into Sunday, according to Ukraine’s air force, of which 90 were shot down and neutralized. Five drones hit four locations and drone debris fell on five other places, the statement said. The attack came a day after Russian missiles and drones killed four people, including two in Kyiv, prompting fresh pleas from Ukraine’s President Volodymyr Zelensky for Western air defense systems. Russia’s Defense Ministry said Sunday that over the previous day its forces struck energy facilities and rail infrastructure serving Ukraine’s war effort, as well as other military targets, such as troop deployment points and a drone factory. It did not comment specifically on strikes on Kyiv, nor on the civilian casualties reported by Ukraine. In Russia’s Bryansk region near Ukraine, two civilians were hospitalized following Ukrainian drone strikes, according to regional Gov. Alexander Bogomaz. At least 26 Ukrainian drones were downed over southwestern Russia on Sunday, according to the Defense Ministry in Moscow.",
            "media_url": "https://ca-times.brightspotcdn.com/dims4/default/0e7af8e/2147483647/strip/true/crop/3580x1880+0+254/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff8%2F7e%2F269de40f4c7e878ff50edef9c544%2Ffb5869a1b66d435eaecfec17cf890910.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.023,
                "neg": 0.089,
                "neu": 0.888
            },
            "source": {
                "id": "la-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "37bac3d0-c73a-46d0-ba55-df8b3997be19",
            "title": "Aaron Rodgers faces Green Bay for the first time on SNF—Watch Packers vs. Steelers",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/how-to-watch-packers-steelers-for-free-on-sunday-night-football/",
            "keywords": [
                "aaron rodgers",
                "rodgers",
                "relationship",
                "organization",
                "subscription",
                "at washington commanders",
                "subscription options and",
                "the pittsburgh steelers"
            ],
            "topics": [
                "sports",
                "entertainment"
            ],
            "description": "Aaron Rodgers faces Green Bay for the first time on SNF—Watch Packers vs. Steelers",
            "pub_date": "2025-10-26T20:20:00",
            "creator": "Angela Tricarico",
            "content": "For the first time since the trade that sent him packing in 2023, Aaron Rodgers will face his old team, the Green Bay Packers. While Rodgers treated his and the Pittsburgh Steelers’ Week 1 victory of the New York Jets as a “revenge game” of sorts, he says that won’t be the case tonight against the team he spent 18 years with. Ahead of the game, Rodgers told the press, “Obviously, I wish that things have been better in our last year there, but I have a great relationship with a lot of people still in that organization, and this is not a revenge game for me. I’m just excited to see some of those guys and be on ‘Sunday Night Football.'” The Steelers (4-2) are entering this week off a close loss against the Bengals during Week 7’s Thursday Night Football, while the Packers (4-1-1) beat the Cardinals 27-23 for their second straight win. A Steelers win tonight would make Rodgers the fifth quarterback in NFL history to win against all 32 NFL teams. Here’s how to tune in to Packers vs. Steelers on Sunday Night Football without cable. Packers vs. Steelers start time: Tonight’s (Oct. 26) Falcons vs. 49ers game is scheduled to start at 8: 20 p. m. ET. How to watch Packers vs. Steelers for free: If you don’t have cable, you’ll need a live TV streaming service to stream the Falcons vs. 49ers on Sunday Night Football for free. One option we love is DIRECTV, which comes with five days free and starts at $49. 99/month, with plenty of subscription options and genre packs that include NBC. Sling TV is another affordable way to stream NFL games; its Select plan includes NBC and starts at $19. 99/month. 2025 Sunday Night Football schedule: Week 8: Green Bay Packers at Pittsburgh Steelers Oct. 26 Week 9: Seattle Seahawks at Washington Commanders Nov. 2 Week 10: Pittsburgh Steelers at L. A. Chargers Nov. 9 Week 11: Detroit Lions at Philadelphia Eagles Nov. 16 Week 12: Tampa Bay Buccaneers at Los Angeles Rams Nov. 23 Week 13: Denver Broncos at Washington Commanders Nov. 30 Week 14: Houston Texans at Kansas City Chiefs Dec. 7 Week 15: Minnesota Vikings at Dallas Cowboys Dec. 14 Week 16: Cincinnati Bengals at Miami Dolphins Dec. 21 Week 17: Chicago Bears at San Francisco 49ers Dec. 28 Week 18: Teams TBD Jan. 4 Why Trust Post Wanted by the New York Post.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnewspress-collage-wir95f002-1761253633574.jpg?quality%3D90%26strip%3Dall%261761239321",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnewspress-collage-wir95f002-1761253633574.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.133,
                "neg": 0.007,
                "neu": 0.86
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "45479b88-baf8-4404-9232-a71fde649116",
            "title": "Newsom’s story about ‘hustling’ to pay the bills raises eyebrows, given his family’s ties to billionaire heir",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/us-news/gavin-newsoms-story-about-hustling-to-pay-the-bills-raises-eyebrows-given-his-familys-ties-to-billionaire-heir/",
            "keywords": [
                "gavin newsom",
                "gordon getty",
                "characterizations",
                "billion-dollar",
                "hardscrabble",
                "hardscrabble stories implying",
                "newsom attended kindergarten",
                "similar hardscrabble stories"
            ],
            "topics": [
                "general"
            ],
            "description": "California Gov. Gavin Newsom's characterizations of his humble origins are raising eyebrows, given his family's ties to the late billionaire heir Gordon Getty.",
            "pub_date": "2025-10-26T20:12:23",
            "creator": "Ryan King",
            "content": "California Gov. Gavin Newsom’s characterizations of his humble origins are raising eyebrows, given his family’s ties to the late billionaire heir Gordon Getty. During a recent appearance on the “All The Smoke” podcast, Newsom (D) recounted how his mother, who divorced from his father when he was young, hustled when he was growing up. “My mom was 19, pregnant and divorced a few years later, with two kids,” he said on the podcast. “Came from no money and just hustled. You know, worked hard, grinding every single day. Two and a half jobs, no bulls-.” “We had roommates all the time because she couldn’t afford the rent,” he continued. “. It was also about paying the bills, man. It was just like hustling and and so I was out there, kind of raising myself, turning on the TV, just getting obsessed. I was sitting there with the Wonder Bread. the macaroni and cheese.” Throughout his career, Newsom has told similar hardscrabble stories implying that he grew up in poverty or in the lower echelons of the middle class, seeking to be more relatable to voters. Over the summer, for example, he claimed to have slept on the couch and that his sister slept in a hallway because his mother had to rent out the spare bedroom. But skeptics have pointed out that Newsom’s late father, William, a former associate justice on the California Court of Appeals, served as a hifalutin attorney for Getty’s billion-dollar fortune. William was so involved with the Gettys that he helped deliver the ransom payment in response to the kidnapping of John Paul Getty III. The elder Newsom previously explained that he was limited in helping out Gavin’s mother financially due to his costly run for the Senate in 1968. “I made a foolish mistake of putting my own money in it and losing,” he said, according to a 2003 San Francisco Chronicle article. “I had a huge deficit when it was over. I lost my law practice in the process. Things were unraveling. It took me quite a while to pull myself out financially. Tessa was working a number of jobs. Gavin had jobs after school.” He later added, “I was around people of wealth, but I never had any money, nor did Gavin.” Yet, after Gavin graduated from Santa Clara University, he started up a boutique winery, PlumpJack Group, with Getty’s financial backing. “Anyone with more than an inch of curiosity would know that Governor Newsom was raised by his mother after her divorce from his father when he was 3 years old,” a Newsom spokesperson told The Post. “He has talked about moving between two different worlds, but he was raised by a mother who worked three jobs at one point secretary, waitress, and paralegal.” Notably, Newsom attended kindergarten and first grade at École Notre Dame des Victoires, a Catholic school. In August, Newsom trolled Vice President JD Vance, showing off a stylish photo purportedly of him in high school wearing a fancy scarf juxtaposed with a throwback pic of the VP in high school wearing a bland t-shirt standing next to women posed in front of urinals.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fwww-youtube-com-watch-v-114245815.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.039,
                "neg": 0.053,
                "neu": 0.908
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "d77bece0-3b8e-481b-b699-6ef01b9a0101",
            "title": "Giants dominated by Eagles in rematch after crushing Cam Skattebo injury",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/giants-dominated-by-eagles-in-rematch-after-cam-skattebo-injury/",
            "keywords": [
                "eagles",
                "cam skattebo",
                "not-out-of-it-yet",
                "fourth-and-inches",
                "injury-ravaged",
                "not-out-of-it-yet touchdown with",
                "the not-out-of-it-yet touchdown",
                "team-leading seventh touchdown"
            ],
            "topics": [
                "general"
            ],
            "description": "Giants dominated by Eagles in rematch after crushing Cam Skattebo injury",
            "pub_date": "2025-10-26T20:07:18",
            "creator": "Ryan Dunleavy",
            "content": "PHILADELPHIA The Giants were looking for a sweep, but the Eagles mopped the floor. Instead of sending any kind of NFC East table-turning message, the Giants lost a piece of their heart and soul when Cam Skattebo suffered a likely season-ending injury within a loss that likely ends any sense of suspense to their season. An injury-ravaged defense had no answers for Saquon Barkley (two touchdowns) or Jalen Hurts (four passing touchdowns) and the Giants fell, 38-20, to the Eagles. The Giants failed in their bid to sweep the season series for the first time since 2007. Jaxson Dart willed the undermanned Giants to stay competitive deep into the third quarter, dropping a 28-yard pass in the bucket for third-string running back Devin Singletary to convert a third-and-7 into the red zone. That was the Giants’ chance to cut into a 24-10 deficit, but two incompletions and a sack forced a 34-yard field goal and made a minimal dent. Want more? Trailing 31-13 and taking hit after hit on telegraphed passes, Dart rose to his feet to throw an in-stride 68-yard touchdown pass on fourth-and-11. Or so it seemed. Darius Slayton was flagged for a controversial offensive pass interference he extended his arm against Quinyon Mitchell as both players jostled with the ball in the air to replace the not-out-of-it-yet touchdown with a punt. The Giants trailed by as many as 25 points before Dart, who was sacked five times, rushed for a one-yard touchdown. Dart threw for 193 yards and had a fumble overturned by replay. Sixteen days after he was held to 58 yards rushing by his former teammates in a loss, Barkley wasted no time letting it be known that the rematch would be different. He ran for a 65-yard touchdown on his first touch Darius Muasau and Rakeem Nunez-Roches were cleared out of the hole and safety Tyler Nubin looked stuck in cinder blocks and the second offensive snap for the Eagles. Barkley’s second touchdown came after the Giants were on the wrong end of a bang-bang call in a 7-7 game. Officials ruled that Hurts’ forward progress was stopped, which made the play unreviewable. A heated Daboll threw the challenge flag anyway and had the spot of the ball reviewed. The first down was upheld, and Hurts then dumped off a go-ahead 9-yard touchdown pass to Barkley, who leaked out of the backfield uncovered against a blitz. Disaster struck the Giants with 8: 11 remaining in the second quarter. Skattebo suffered a dislocated right ankle when he was brought down by Zack Baun on an incompletion. Giants teammates immediately dropped to a knee and turned away from the gruesome sight of Skattebo’s foot turned in the wrong direction. Skattebo, who earlier scored his team-leading seventh touchdown of the season on an 18-yard pass from Dart, was cheered in support by the notoriously hostile Eagles fans in a show of respect. He waved in appreciation as he rode off the cart, after a head-bump from Dart and well wishes from his replacement Tyrone Tracy Jr. Hurts threw three touchdown passes in the final 31 minutes, including two to Dallas Goedert and one to Jahan Dotson when he climbed the back of the recently re-acquired Korie Black. The Giants played the entire second half without 60 percent of their ideal secondary: Cor’Dale Flott (concussion) was sidelined after Jevon Holland and Paulson Adebo did not make the trip because of knee injuries.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnew-york-giants-vs-philadelphia-114244846.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.057,
                "neg": 0.196,
                "neu": 0.746
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "86b67f21-282b-4f99-96a4-87b9917fed76",
            "title": "YouTuber Tyler Oliveira branded ‘racist,’ dragged through the muck after filming Indian village’s messy ‘poop-throwing’ fight",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/world-news/youtuber-tyler-oliveira-branded-racist-dragged-through-the-muck-after-filming-indian-villages-messy-poop-throwing-fight/",
            "keywords": [
                "tyler oliveira",
                "happy diwali",
                "misinformation",
                "dung-flinging",
                "poop-throwing",
                "subsequently shared screengrabs",
                "shared screengrabs purporting",
                "post-diwali hindu tradition"
            ],
            "topics": [
                "culture",
                "media",
                "international"
            ],
            "description": "YouTuber Tyler Oliveira branded ‘racist,’ dragged through the muck after filming Indian village’s messy ‘poop-throwing’ fight",
            "pub_date": "2025-10-26T20:06:42",
            "creator": "Anthony Blair",
            "content": "An American YouTuber is raising a holy stink after he filmed a dung-flinging ritual in a remote Indian village. Tyler Oliveira, 25, shared a teaser clip titled “Inside India’s Poop-Throwing Festival,” where it quickly piled up more than 5 million views. But the video, taken at the Gorehabba festival, in which villagers hurl dried cow dung at each other as part of a post-Diwali Hindu tradition, was criticized for ignoring the significance behind the smelly stunt. In another post, he shared a picture of himself in a hazmat suit and goggles covered in brown smears following the event in the remote village of Gumatapura, in Karnataka, southwestern India. “Happy Diwali! Yes, I went to India’s poop throwing festival. It was the s-tiest experience of my life. I will never go back. Please pray that I survive,” he wrote, accompanying the post with a poop emoji. Backlash soon started piling up around him. He subsequently shared screengrabs purporting to show that his video was facing censorship and mass reporting from Indian users who claim he is smearing their country. “Why do you have to come to India and then record a video of a cow dung festival by going in the middle of the event and then cry like a loser!” one Indian X user wrote. “You s-ty fellow. You can record poop in Western countries, plenty on streets of California. Human poop you can have record in your countries. Make videos,” the user added. “I’ve filmed in many of these cities. Don’t be mad bro,” Oliveira responded. Others claimed the YouTuber, who has more than 8 million subscribers, had been hired to leave a stain on India’s reputation. “He’s not here to explore; he’s here to defame. It’s hard to believe this isn’t part of a planned smear campaign,” an X user wrote. “He is known for spreading racism & misinformation,” added another. Others insisted the video of the annual festival, which is also held in at least two other Indian villages, must be AI-generated BS. “This is 100% real. I can’t wait to show you a 30-minute version of it,” Oliveira said in response to a doubter. Devotees of the festival believe their god, Beereshwara Swamy, was born in cow excrement, and the ritual is seen as sacred and purifying. But some purported Indian social media users argued that in the modern day, such a smelly tradition would only paint the country in a bad light. “India’s PR got nuked. I am not sure how to defend my country anymore,” a Reddit user said. “Once that drops, we’re finished. Why does the government even allow this disgusting festival to happen? Why hasn’t it been banned already? It’s crazy how one tiny village can tank India’s image this bad,” they added. Oliveira did not respond immediately to requests for comment.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fun-muzzed-version-travel-vlogger-114249507.jpg?w%3D860",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.101,
                "neg": 0.116,
                "neu": 0.783
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "320e8352-6f2f-406e-981d-ffd2227f2be6",
            "title": "Zohran Mamdani boasts he’s a ‘proud’ DSA member in response to GOP citizenship threats",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/us-news/zohran-mamdani-boasts-hes-a-proud-dsa-member-in-response-to-gop-citizenship-threats/",
            "keywords": [
                "zohran mamdani",
                "mamdani",
                "naturalization",
                "congressional",
                "investigation",
                "democratic socialists of america",
                "off congressional republicans",
                "his naturalization paperwork"
            ],
            "topics": [
                "politics",
                "social"
            ],
            "description": "Mayoral candidate Zohran Mamdani boasted he was a “proud democratic socialist” Sunday as he brushed off congressional Republicans' threats to revoke his citizenship over his naturalization paperwork.",
            "pub_date": "2025-10-26T20:05:42",
            "creator": "David DeTurris, Alex Oliveira",
            "content": "Mayoral candidate Zohran Mamdani boasted he was a “proud democratic socialist” Sunday as he brushed off congressional Republicans’ threats to revoke his citizenship over his naturalization paperwork. Mamdani, 34, denied being a communist after opponents claimed he lied by not disclosing on his 2018 citizenship forms that he was a member of the Democratic Socialists of America. “No matter how many times these Republican Congress members or the president of this country calls me a communist, it doesn’t make it true.” Mamdani told The Post Sunday, adding it was “telling” that DC Republicans were more concerned about deporting him than ending the ongoing government shutdown. “I’m proud to be a democratic socialist,” he added. That dismissal comes days after Rep. Randy Fine (R-Fla.) renewed calls to have Mamdani’s citizenship investigated and revoked echoing allegations from GOP Rep. Andy Ogles (R-Tenn.). The Republicans have claimed the DSA is a communist organization, and that Mamdani’s membership could have disqualified him from citizenship citing congressional rules that categorize communism as part of a totalitarian umbrella and can disqualify followers from becoming US citizens. How well that argument would hold water is unclear, however, as the DSA is not officially a communist party even though some members are communists. Mamdani was born in Uganda and moved to New York City at the age of 7 while his father taught at Columbia University, and became a naturalized US citizen in 2018. He has also always maintained that he is not a communist, but merely a DSA member and doubled down on those claims when asked about Fine’s and Ogles’ crusade. “I think it is telling that in a moment where their Republican Party has shut down the federal government out of an attempt to throw four million Americans off their healthcare, a moment when active duty military families are forced to line up at food banks, they would rather focus on my citizenship,” Mamdani added. The communist angle is not the GOP’s only attempt to probe Mamdani’s citizenship. In June, Ogles also sent a letter to US Attorney General Pam Bondi asking for a Department of Justice investigation into his citizenship over lyrics Mamdani once rapped that appeared to express solidarity for Hamas terrorists.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnew-york-city-mayoral-candidate-114247034.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.054,
                "neg": 0.064,
                "neu": 0.882
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "2ffa3275-036d-47d4-98d1-455ee3882aa0",
            "title": "Nick Mangold deserves to be remembered as a champion",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/nick-mangold-deserves-to-be-remembered-as-a-champion/",
            "keywords": [
                "nick mangold",
                "mangold",
                "philadelphia",
                "immediately",
                "accessible",
                "called mangold immediately",
                "something to announce",
                "would have something"
            ],
            "topics": [
                "general"
            ],
            "description": "Nick Mangold deserves to be remembered as a champion",
            "pub_date": "2025-10-26T20:01:54",
            "creator": "Steve Serby",
            "content": "PHILADELPHIA The text from Nick Mangold came at 3: 37 p. m. on Oct. 14: “Give me a call when you can.” I had covered him from the day he was drafted by the Jets in the first round in 2006 until he retired in 2015. Great player, always accessible, always cordial, driest humor in the room. I called Mangold immediately. He told me he would have something to announce to everyone at 4 o’clock and wanted to give me a heads-up.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnick-mangold-family-day-new-113475614_0ee54b.jpg?quality%3D90%26strip%3Dall",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fnick-mangold-family-day-new-113475614_0ee54b.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.078,
                "neg": 0.0,
                "neu": 0.922
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "72072e9a-d03e-4219-ac2a-15ee125fae35",
            "title": "bet365 bonus code NYPBET: Bet $5, get $200 in bonus bets for Packers vs. Steelers",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/betting/bet365-bonus-code-nypbet-bet-5-get-200-in-bonus-bets-for-packers-vs-steelers/",
            "keywords": [
                "aaron",
                "pittsburgh",
                "1-800-gambler",
                "pennsylvania",
                "long-awaited",
                "trust new york post betting sean treppedi",
                "efficient protection units",
                "three-point home underdogs"
            ],
            "topics": [
                "sports"
            ],
            "description": "bet365 bonus code NYPBET: Bet $5, get $200 in bonus bets for Packers vs. Steelers",
            "pub_date": "2025-10-26T20:00:00",
            "creator": "Sean Treppedi",
            "content": "Aaron Rodgers’ long-awaited reunion with the Green Bay Packers headlines “Sunday Night Football” as the Steelers host one of the NFC’s hottest teams. It’s Rodgers’ first meeting with his former franchise after 18 seasons and a Super Bowl title together, and he enters with Pittsburgh sitting atop the AFC North despite a Week 7 stumble in Cincinnati. Oddsmakers have the Steelers as three-point home underdogs, though Mike Tomlin’s teams have made a living beating the spread in that role; he’s 21-7-3. bet365 bonus code NYPBET: Packers vs. Steelers You can take advantage of a welcome offer at bet365, where new users can bet $5 and get $200 in bonus bets. The bonus will appear in your account whether the bet wins or loses. Just enter the bet365 promo code NYPBET to activate. This offer is only live in Arizona, Colorado, Iowa, Illinois, Indiana, Kansas, Kentucky, Louisiana, Maryland, North Carolina, New Jersey, Ohio, Pennsylvania, Tennessee, or Virginia. How to sign up for bet365 Sportsbook Select your bonus offer: Bet $5, get $200 in bonus bets, win or lose! Choose your state. Hit the “Join Now” button. Fill out your login details. When prompted, enter the promo code NYPBET. Choose your preferred welcome offer. Make a minimum deposit of $10 What our Post expert thinks about Packers vs. Steelers Rodgers’ Steelers lead the AFC in red-zone touchdown rate, while the Packers’ offense ranks top-five in scoring thanks to 27-plus points in five of six games. Green Bay’s defense, sparked by Micah Parsons’ career-high three sacks last week, faces its biggest test yet against Rodgers, who’s thrown 14 touchdowns to just five picks behind one of the league’s most efficient protection units. Deposit Required. Paid in Bonus Bets. Bonus Bets wager excluded from returns. New Customers Only. T&Cs, time limits, and exclusions apply. 21+ (18+ in KY). Gambling Problem? Call 1-800-GAMBLER. Available in AZ, CO, IA, IL, IN, KS, KY, LA, MD, NC, NJ, OH, PA, TN, VA only. Bet $5 and Get $200 in Bonus Bets at bet365. Minimum odds -500 of greater. Why Trust New York Post Betting Sean Treppedi handicaps the NFL, NHL, MLB and college football for the New York Post. He primarily focuses on picks that reflect market value while tracking trends to mitigate risk.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2FAP_Steelers_Bengals_Football_51076-7e32d-0-1.jpg?quality%3D90%26strip%3Dall",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2FAP_Steelers_Bengals_Football_51076-7e32d-0-1.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.149,
                "neg": 0.041,
                "neu": 0.81
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "3c24656e-5baa-4788-93e4-e23e093dacf2",
            "title": "Fourth celebrity leaves Strictly after dance-off",
            "source_title": "Evening Standard",
            "source_link": "http://www.standard.co.uk",
            "article_link": "https://www.standard.co.uk/showbiz/celebrity-news/jimmy-floyd-hasselbaink-amber-davies-bbc-oakley-anton-du-beke-b1254988.html",
            "keywords": [
                "halloween",
                "craig revel horwood",
                "professional",
                "competitions",
                "hairdressers",
                "53-year-old and professional",
                "professional dancers kuzmin",
                "professional partner lauren"
            ],
            "topics": [
                "entertainment",
                "media"
            ],
            "description": "Fourth celebrity leaves Strictly after dance-off",
            "pub_date": "2025-10-26T20:00:00",
            "creator": "Lauren Del Fabbro",
            "content": "The remaining 10 couples will return to the dancefloor for Halloween week next Saturday. Craig Revel Horwood, Motsi Mabuse, Shirley Ballas and Anton Du Beke dressed to impress on Icons Week (Guy Levy/BBC/PA) PA Media Lauren Del Fabbro 4 minutes ago Sign up to our free . Former Chelsea star Jimmy Floyd Hasselbaink has become the fourth celebrity to leave Strictly Come Dancing. The 53-year-old and professional partner Lauren Oakley left the competition on Sunday night after losing the dance-off to Amber Davies and professional Nikita Kuzmin. Both couples performed their routine from Saturday night’s Icons Week show, with Hasselbaink dancing the American Smooth to Prince’s Purple Rain while Davies and Kuzmin performed a Cha Cha to Ariana Grande’s Break Free. Jimmy Floyd Hasselbaink and Lauren Oakley performing in the Strictly ballroom (Guy Levy/BBC/PA) PA Media Judges Craig Revel Horwood, Motsi Mabuse and head judge Shirley Ballas chose to save Davies and Kuzmin, with Anton Du Beke, who was this week’s judge with the casting vote, adding he would have voted the same way had it been required. Hasselbaink said: “I have absolutely loved my experience. I can only say thank-you very much for letting me have this experience and to my daughters for pushing me to come here and do this. “I never expected that I would enjoy it this much. The people behind the scenes, from the wardrobe people to the hairdressers to the make-up people, are absolutely magnificent thank-you very much. “This experience is going to live with me forever.” Despite securing their highest score of the competition on Saturday night with 30 points, Hasselbaink said: “The only thing you can do is dance as best as you can and then it’s up to the public. I was actually quite happy to dance again because I wanted to do better than my previous one. So listen, I have had a blast.” Amber Davies and Nikita Kuzmin, left, went up against Jimmy Floyd Hasselbaink and Lauren Oakley in the dance off (Guy Levy/BBC/PA) PA Media Speaking about Oakley, he added: “She is just absolutely incredible. She has been absolutely amazing with me. You are a diamond.” Oakley said the pair have had “so many laughs” and she was “absolutely gutted” to be leaving, however she praised Hasselbaink for being an “amazing student”. She said: “We have had the best time and I am so proud of how far he has come. It proves that anyone can be a dancer if you put your mind to it. He’s a footballer, and he just danced like that. We’ve had the best time and I’m just so proud and I feel honoured to have been able to teach you.” Sunday night’s results show also featured a performance of Don’t Cry For Me Argentina by Hollywood and West End star Rachel Zegler, accompanied by a routine from professional dancers Kuzmin and Luba Mushtuk. The Strictly professionals also performed a Britney Spears group dance which paid tribute to the popstar’s musical eras. Claudia Winkleman, left, and Tess Daly watch on as Jimmy Floyd Hasselbaink and Lauren Oakley perform their last dance (Guy Levy/BBC/PA) PA Media It comes after Strictly hosts Claudia Winkleman and Tess Daly announced last week they will leave the show after fronting it together since 2014. Read More Kaye Adams says her name has been ‘dragged through mud’ after BBC show decision Rachel Reeves wants to eat the rich, but London needs a better boost Lewis Cope tops Strictly leaderboard as Johnny Cash during Icon Week Sponsored Investing with confidence: How to make your money work harder The pair’s last appearance will be in the Strictly festive special which will air on Christmas Day. Hasselbaink and Oakley will appear on Strictly: It Takes Two on Monday at 6. 30pm on BBC Two and BBC iPlayer. The remaining 10 couples will return to the dancefloor for Halloween Week next Saturday at 6. 35pm on BBC One and BBC iPlayer. MORE ABOUT.",
            "media_url": "https://static.standard.co.uk/2025/10/26/20/a49659aa84202d4637b2b3f06e5180efY29udGVudHNlYXJjaGFwaSwxNzYxNTcyMjI5-2.82152773.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Media",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.126,
                "neg": 0.016,
                "neu": 0.858
            },
            "source": {
                "id": "evening-standard",
                "country": "GB",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "4b629f75-917f-4d5a-8708-4df6f65c40f9",
            "title": "Funeral home displays wrong body at memorial service, leading relative to suffer heart attack: kin",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/us-news/funeral-home-displays-wrong-body-at-memorial-service-leading-relative-to-suffer-heart-attack-kin/",
            "keywords": [
                "joey espinosa",
                "laura levario",
                "compensation",
                "remembering",
                "significant",
                "forest lawn covina hills",
                "mourning and remembering",
                "remembering their loved"
            ],
            "topics": [
                "general"
            ],
            "description": "Funeral home displays wrong body at memorial service, leading relative to suffer heart attack: kin",
            "pub_date": "2025-10-26T19:59:54",
            "creator": "Chris Nesi",
            "content": "A California family was horrified to find a stranger’s body on display at a memorial service for their loved one and the ordeal was enough to cause a relative to suffer a heart attack in the chapel, kin said. The family of Joey Espinosa, 44, who recently died of heart failure, was attending his memorial service at Forest Lawn Covina Hills funeral home when they discovered the mortuary had put the wrong body in the casket. “They didn’t know where my nephew’s body was,” Espinosa’s aunt, Laura Levario, told CBS Los Angeles. Funeral home staff ushered the family into a different room at the facility after the apparent mix-up, but the body on display there wasn’t Espinosa’s, either. The upheaval was so unnerving that Levario’s husband collapsed of a heart attack in the chapel, only to wake up three days later on life support in the hospital. “It’s the worst experience we’ve ever had,” he said. Forest Lawn chalked up the mortifying mishap to a “scheduling error” and adding insult to injury, offered the family a mere $200 in compensation just 1% of the nearly $20,000 funeral cost. The family is now suing the funeral home for emotional distress and negligence. “Instead of mourning and remembering their loved one, they are searching for a body,” said Elvis Tran, the family’s lawyer. “When you’re spending that much money on a place like Forest Lawn, you would think they would do things properly,” he said of the facility, which boasts of offering “significant” artwork and “spectacular” grounds on its website. The funeral home was eventually able to locate Espinosa’s body and begin the service after over an hour of flubs. Though rare, similar tragic mistakes by funeral homes do happen. In October, a funeral home in Camden, NJ, was sued by a family after it displayed the wrong body draped in the deceased loved one’s clothing. The man’s kin accused the funeral home of negligence in the handling of human remains, among other claims.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fjoey-espinosa-died-heart-failure-114244170.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.056,
                "neg": 0.21,
                "neu": 0.734
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "fd526117-caf6-405c-939d-3f30ad550187",
            "title": "Emotional Jaxson Dart in disbelief after gruesome Cam Skattebo injury",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/giants-qb-jaxson-dart-in-disbelief-after-gruesome-cam-skattebo-injury/",
            "keywords": [
                "jaxson",
                "cam skattebo",
                "league-mandated",
                "personalities",
                "philadelphia",
                "league-mandated concussion protocol",
                "caught third-string quarterback",
                "third-string quarterback jameis"
            ],
            "topics": [
                "sports"
            ],
            "description": "Emotional Jaxson Dart in disbelief after gruesome Cam Skattebo injury",
            "pub_date": "2025-10-26T19:55:44",
            "creator": "Dan Martin",
            "content": "Jaxson Dart and Cam Skattebo have been attached ever since they were drafted by the Giants Dart in the first round, Skattebo in the fourth earlier this season. And their bond only grew when the rookie duo helped give the Giants a spark once Dart took over the starting quarterback spot following an 0-3 start to the season. So it was no surprise to see Dart’s emotional reaction to Skattebo going down with an apparently serious right ankle injury when he was hit while attempting to make a catch in the second quarter Sunday against the Eagles in Philadelphia. With the training staff tending to Skattebo, who had a cast placed on his lower right leg before being carted off at Lincoln Financial Field, Dart could be seen yelling to himself and then taking a knee, seemingly unable to look at Skattebo’s injury. As Skattebo left the field, Fox cameras caught third-string quarterback Jameis Winston appearing to console and perhaps encourage Dart, with an arm around his shoulder. An extended absence by Skattebo, which is expected, is another blow to a Giants offense that was already without star wide receiver Malik Nabers, who suffered a torn ACL last month. Even without Nabers, Dart injected life into the offense with considerable help from Skattebo, as their athleticism and personalities gave Giants fans something to root for. Earlier Sunday, Dart hit Skattebo for an 18-yard touchdown pass that helped tie the game at 7-7 late in the first quarter. It was against the Eagles two weeks ago that Skattebo had his best game as a Giant, scoring three rushing touchdowns and gaining 98 yards on the ground. He was also fined $15,000 for his role in violating the league-mandated concussion protocol during Dart’s sideline examination in that Oct. 9 victory at MetLife Stadium. That was part of a convincing win at MetLife Stadium that had the team thinking about the postseason.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fdart-1.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.074,
                "neg": 0.071,
                "neu": 0.855
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "f88d1821-e530-4347-bdf0-3f3d5acca806",
            "title": "Lauren Sánchez puts on leggy display for date night with husband Jeff Bezos",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://pagesix.com/2025/10/26/celebrity-news/lauren-sanchez-puts-on-leggy-display-for-date-night-with-husband-jeff-bezos/",
            "keywords": [
                "lauren",
                "jeff bezos",
                "kardashian-jenner",
                "ultra-exclusive",
                "editor-in-chief",
                "photographed wearing coordinated",
                "british vogue editor-in-chief",
                "ultra-exclusive 72 magazine"
            ],
            "topics": [
                "entertainment",
                "media"
            ],
            "description": "The Amazon founder and the author enjoyed a romantic night out at Carbone restaurant on Saturday night.",
            "pub_date": "2025-10-26T19:52:30",
            "creator": "Vanessa Serna",
            "content": "Lauren Sánchez showed off her toned legs in a minidress as she stepped out for a romantic date night with husband Jeff Bezos. The Amazon founder and the former journalist were all smiles as they walked into Carbone restaurant in Miami on Saturday night. Bezos sported a black shirt and black pants for the outing, accessorizing with a watch and sunglasses. As for Sánchez, 55, she donned a mini floral dress with black lace and heels. The media personality, who walked behind Bezos, 61, smiled for photographers as she made her way inside the restaurant. The couple’s sighting back in the US comes after they were spotted in France for Paris Fashion Week earlier this month. At the time, Sánchez and Bezos were photographed wearing coordinated gray outfits while grabbing lunch at Le Grand Café. A few weeks before, the duo attended New York Fashion Week festivities and were seen at the ultra-exclusive 72 magazine party hosted by Edward Enninful, former British Vogue editor-in-chief, at The Cut restaurant. The “Fly Who Flew to Space” author put on another stylish display, wearing a mini silk dress and a brown leather blazer. Bezos attempted to match his wife’s outfit, sporting a satin suit. The billionaire and Sánchez have been traveling between the US and Europe since tying the knot in Venice, Italy, on June 27. Their nuptials were attended by several A-listers, including Orlando Bloom, Oprah Winfrey, the Kardashian-Jenner clan and Leonardo DiCaprio. The three-day event, which was estimated to cost around $50 million, was referred to as the “wedding of the century.” Bezos and Sánchez then spent time in the South of France for their honeymoon.",
            "media_url": "https://pagesix.com/wp-content%2Fuploads%2Fsites%2F3%2F2025%2F10%2Fexclusive-miami-beach-fl-rainy-114237647.jpg?w%3D944",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.071,
                "neg": 0.008,
                "neu": 0.922
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "21d3c8ab-149a-4936-9867-bcfa7a87a16f",
            "title": "Tottenham: Thomas Frank reveals pre-season chat with Micky van de Ven after scoring run",
            "source_title": "Evening Standard",
            "source_link": "http://www.standard.co.uk",
            "article_link": "https://www.standard.co.uk/sport/football/tottenham-frank-van-de-ven-goals-b1254987.html",
            "keywords": [
                "van",
                "ven",
                "bournemouth",
                "centre-back",
                "leadership",
                "point behind bournemouth",
                "liverpool and manchester",
                "set-piece coach andreas"
            ],
            "topics": [
                "sports"
            ],
            "description": "Tottenham: Thomas Frank reveals pre-season chat with Micky van de Ven after scoring run",
            "pub_date": "2025-10-26T19:51:26",
            "creator": "Matt Verri",
            "content": "Van de Ven wore the captain's armband in the absence of Cristian Romero and stepped up to lead from the front as he scored twice in Tottenham's 3-0 win over Everton. Those goals gave Spurs a two-goal lead at the break and after what Frank described as a \"dogfight\" of a second half, Pape Matar Sarr came off the bench to put the match to bed late on. Van de Ven's brace at the Hill Dickinson Stadium took him to five goals for the season having not scored at all last term. Frank spoke of the work that has been done on the training ground with set-piece coach Andreas Georgson to make the Dutchman more of a threat \"First and foremost, I think he's really growing and taking some big steps. I'm very pleased with him overall. \"I think he's taken more leadership, defending better and better. Not only using his pace but also more clever positions. Very happy with that. \"And then actually at the beginning of the season I said, 'it's OK you score with your left and your right foot, but you need to score headed goals you're a centre-back, you need to score more with that'. \"And then we have worked with it. Big praise to Micky but especially to Andreas. And the way he attacked the ball, also get in there where it hurts is key, Hopefully he can continue.\" Spurs took advantage of defeats this weekend for Liverpool and Manchester City to rise up the table. They sit only a point behind Bournemouth in second and five off leaders Arsenal, who they face away from home next month. No side have scored more in the Premier League this season than Spurs and the away record is superb. They are the only side to remain unbeaten on the road, picking up 13 points from a possible 15. However, Frank refused to get carried away. Asked if his side were title contenders, Frank responded firmly: \"No. I think there's probably a few teams that are ahead of us, I think it's fair to say that.",
            "media_url": "https://static.standard.co.uk/2025/10/26/19/47/SEI271952108.jpeg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Peter Byrne/PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.114,
                "neg": 0.05,
                "neu": 0.836
            },
            "source": {
                "id": "evening-standard",
                "country": "GB",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "3773c94b-8fdb-4923-990a-97bc0e41717e",
            "title": "Lakers star Luka Doncic sidelined by finger injury",
            "source_title": "Los Angeles Times",
            "source_link": "https://latimes.com",
            "article_link": "https://www.latimes.com/sports/lakers/story/2025-10-26/lakers-star-luka-doncic-sidelined-by-finger-injury-kings-recap",
            "keywords": [
                "luka doncic",
                "doncic",
                "timberwolves",
                "respectively",
                "reevaluated",
                "the minnesota timberwolves",
                "standard contract players",
                "lakers announced doncic"
            ],
            "topics": [
                "sports"
            ],
            "description": "Lakers guard Luka Doncic will miss at least one week with a left finger sprain and a left lower leg contusion, the team announced Sunday.",
            "pub_date": "2025-10-26T19:49:13",
            "creator": "Thuc Nhi Nguyen",
            "content": "Lakers guard Luka Doncic will miss at least one week with a left finger sprain and a left lower leg contusion, the team announced Sunday before a road game at Sacramento. The star guard suffered the finger injury early in Friday’s game against the Minnesota Timberwolves. It didn’t slow him down at all, though, as Doncic finished with 49 points, 11 rebounds and eight assists in a 128-110 Lakers victory. The 26-year-old is off to a blazing start as his 92 points in the first two games are the most in Lakers history to begin a season. The Lakers announced Doncic will be reevaluated in about one week, but it will be a busy stretch without the five-time All-Star. Already without LeBron James as the 40-year-old deals with a sciatica injury, the Lakers have four games in six days this week. After Sacramento on Sunday, the Lakers (1-1) return to L. A. to face Portland on Monday and have road games at Minnesota and Memphis on Wednesday and Friday, respectively. The Lakers will be down to just nine standard contract players Sunday as center Jaxson Hayes was also ruled out with left knee soreness. He will miss his second consecutive game. James and forwards Maxi Kleber (abdominal muscle strain) and Adou Theiro (knee) are also out.",
            "media_url": "https://ca-times.brightspotcdn.com/dims4/default/737481f/2147483647/strip/false/crop/3724x2482+0+0/resize/1500x1000!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F86%2F13%2F62fad3764bba92e75b40bae0f172%2F1526975-sp-nba-lakers-timberwolves-029-eat.jpg",
            "media_type": "image/jpeg",
            "media_description": "Los Angeles, CA - October 24: Los Angeles Lakers guard Luka Doncic (77) dribbles during the second half of an NBA basketball game against the Minnesota Timberwolves at Crypto.com Arena on Friday, Oct. 24, 2025 in Los Angeles, CA. (Eric Thayer / Los Angeles Times)",
            "media_credit": "Eric Thayer/Los Angeles Times",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.014,
                "neg": 0.058,
                "neu": 0.928
            },
            "source": {
                "id": "la-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "608baf89-60a6-4faa-b824-e020d6af9fbc",
            "title": "Federal food aid will not go out starting Nov. 1, USDA website alert says",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/federal-food-aid-govenrment-shutdown/",
            "keywords": [
                "hakeem jeffries",
                "margaret brennan",
                "administration",
                "second-longest",
                "supplemental",
                "supplemental nutrition assistance program",
                "administration blames democrats",
                "connecticut accused republicans"
            ],
            "topics": [
                "economy",
                "government",
                "finance",
                "social"
            ],
            "description": "The USDA notice comes after the Trump administration said it would not tap roughly $5 billion in contingency funds to keep benefits through SNAP.",
            "pub_date": "2025-10-26T19:47:36",
            "creator": "CBS News",
            "content": "The U. S. Department of Agriculture has posted a notice on its website saying federal food aid will not go out on Nov. 1, raising the stakes for families nationwide as the government shutdown drags on. The new notice comes after the Trump administration said it would not tap roughly $5 billion in contingency funds to keep benefits through the Supplemental Nutrition Assistance Program, commonly referred to as SNAP, flowing into November. That program helps about 1 in 8 Americans buy groceries. \"Bottom line, the well has run dry,\" the USDA notice says. \"At this time, there will be no benefits issued November 01. We are approaching an inflection point for Senate Democrats.\" The shutdown, which began on Oct. 1, is now the second-longest on record. While the Republican administration took steps leading up to the shutdown to ensure SNAP benefits were paid this month, the cutoff would expand the impact of the impasse to a wider swath of Americans and some of those most in need unless a political resolution is found in just a few days. The administration blames Democrats, who say they will not agree to reopen the government until Republicans negotiate with them on extending expiring subsidies under the Affordable Care Act. Republicans say Democrats must first agree to reopen the government before negotiations. \"There is an urgent need to reopen the government, which is why we continue to demand that Republicans sit at the negotiating table so we can enact a spending agreement that's bipartisan in nature,\" House Minority Leader Hakeem Jeffries said on \"Face the Nation with Margaret Brennan\" on Sunday. Democratic lawmakers have written to Agriculture Secretary Brooke Rollins requesting that she use contingency funds to cover the bulk of next month's benefits. But a USDA memo that surfaced Friday says \"contingency funds are not legally available to cover regular benefits.\" The document says the money is reserved for such things as helping people in disaster areas. The memo cited Hurricane Melissa, which has strengthened into a major hurricane, as an example of why it's important to have the money available to mobilize quickly in the event of a disaster. The prospect of families not receiving food aid has deeply concerned states run by both parties. Some states have pledged to keep SNAP benefits flowing even if the federal program halts payments, but there are questions about whether U. S. government directives may allow that to happen. The USDA memo also says states would not be reimbursed for temporarily picking up the cost. Other states are telling SNAP recipients to be ready for the benefits to stop. Arkansas and Oklahoma, for example, are advising recipients to identify food pantries and other groups that help with food. Democratic Sen. Chris Murphy of Connecticut accused Republicans and President Trump of not agreeing to negotiate. \"The reality is, if they sat down to try to negotiate, we could probably come up with something pretty quickly,\" Murphy said Sunday on CNN's \"State of the Union. We could open up the government on Tuesday or Wednesday, and there wouldn't be any crisis in the food stamp program.\".",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/1e8bffc7-8324-4c58-a309-4665c49bcc84/thumbnail/1200x630/924d7980dda8d5c957d49dc2f34f18d4/ap25289506125167.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.104,
                "neg": 0.057,
                "neu": 0.839
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "03f18866-a953-4912-a0e4-ecc4a103a789",
            "title": "Student, 20, drops dead during hike from little-known condition that affects 1 in 250",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/health/young-student-drops-dead-from-rare-heart-condition/",
            "keywords": [
                "cambridge",
                "clarissa nicholls",
                "cardiovascular",
                "arrhythmogenic",
                "cardiomyopathy",
                "had arrhythmogenic cardiomyopathy",
                "facing serious cardiovascular",
                "ideal cardiovascular health"
            ],
            "topics": [
                "general"
            ],
            "description": "Student, 20, drops dead during hike from little-known condition that affects 1 in 250",
            "pub_date": "2025-10-26T19:47:00",
            "creator": "Fabiana Buontempo",
            "content": "What a complete shock. Two years ago, a 20-year-old student at the University of Cambridge collapsed and died without any warning signs while hiking in southern France and now her family is doing everything possible to prevent others from experiencing this same type of unexpected tragedy. Clarissa Nicholls had arrhythmogenic cardiomyopathy, or ACM, a rare heart condition that occurs when the heart muscle is replaced by both scar and fat. ACM caused the student’s heart to go into cardiac arrest. Nicholls was described by her mother to the Times as a “supremely active, one of the fittest and healthiest and energetic girls you would have ever met,” so her passing was a complete shock to anyone who knew her. The scary part is that she didn’t have any symptoms and with routine screenings, there’s a possibility this could’ve been prevented. It’s believed that these types of heart conditions often go undiagnosed and can be made worse by strenuous exercise. Following the 20-year-old’s passing, the Nicholls family and friends, Izzy Winter and Jess Reeve set up a campaign to prevent this from happening to others, especially young people, since one in every 250 people is affected by this little-known condition. Over £100, 000 (over $133,000) was raised for Clarissa’s Campaign, which allows young students at Cambridge to get routine heart screenings, which are provided by the charity CRY Cardiac Risk in the Young. Thanks to the campaign, over 400 students have been screened so far, with 42 having to go for further testing. “Cambridge has been brilliant in supporting this and I believe there is the will to keep the momentum going,” Nicholls’ mother said in a recent press release. As alarming and unfortunate as Nicholls’ story is, research shows that by age 17, most people’s heart health scores start to decline. “I frequently care for people in their early 20s who are entering adulthood and are already facing serious cardiovascular risk factors such as elevated blood pressure, high blood sugar or a body mass index in the obesity range,” Dr. Jewel Scott, a primary care nurse practitioner, wrote in The Conversation. And something many don’t realize is that heart health can easily decline during one’s childhood. “Most children are born healthy, but unfortunately much of the benefit of heart health is lost during childhood, and currently less than 5% of US children enjoy ideal cardiovascular health,” Dr. David Jacobs, a professor of public health at the University of Minnesota, said in a statement. Lifestyle choices like lack of exercise, using cigarettes, vapes or other nicotine products, diet and excessive drinking all contribute to poor heart health, especially in young people.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fclarissa-nicholls-seen-photo-released-114247201.jpg?w%3D768",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.094,
                "neg": 0.089,
                "neu": 0.817
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "7823ed27-de6f-4d1e-b8e6-440dbd867087",
            "title": "Novartis to acquire Avidity Biosciences for about $12B",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/business/novartis-to-acquire-avidity-biosciences-for-about-12b/",
            "keywords": [
                "novartis",
                "early-to-mid-stage",
                "san-diego-based",
                "pharmaceutical",
                "in early-to-mid-stage development",
                "early-to-mid-stage development as",
                "early-stage precision cardiology"
            ],
            "topics": [
                "business",
                "finance",
                "technology",
                "medicine"
            ],
            "description": "Novartis has been proactively striking deals this year to address the impending patent cliff for some of its blockbuster drugs, including Entresto for heart failure, Xolair for asthma and Cosentyx for autoimmune diseases.",
            "pub_date": "2025-10-26T19:46:04",
            "creator": "Reuters",
            "content": "Swiss drugmaker Novartis on Sunday said it agreed to acquire US biotech firm Avidity Biosciences for about $12 billion in cash, as the company looks to bolster its portfolio of treatments for rare muscle disorders. Avidity stockholders will receive $72 per share in cash, representing a premium of 46% to the company’s closing on Friday. Novartis has been proactively striking deals this year to address the impending patent cliff for some of its blockbuster drugs, including Entresto for heart failure, Xolair for asthma and Cosentyx for autoimmune diseases. Under the terms of the deal, Avidity will separate its early-stage precision cardiology programs into a new company called Spinco, which is expected to be a publicly traded company, Avidity said in a separate statement. With this acquisition, Novartis is expanding into areas with limited treatment options, while strengthening its presence in the rare disease landscape. San-Diego-based Avidity, a clinical-stage company, is developing treatments for various muscle disorders and advancing several first-in-class drug candidates. Its lead drug, Del-zota, is in early-to-mid-stage development as a potential treatment for a rare form of Duchenne muscular dystrophy, while the company is also working on two other drugs for serious muscle diseases. This deal also helps Novartis to establish a stronger foothold in the U. S. market amid a potential hefty pharmaceutical tariff threat from President Trump.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fcompanys-logo-seen-new-cell-21662386.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.073,
                "neg": 0.044,
                "neu": 0.884
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "316d41fb-60fc-4d6c-b19e-36198f47e037",
            "title": "UFO tracker shows thousands of eerie underwater objects lurking along US coasts",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/us-news/ufo-tracker-shows-thousands-of-eerie-underwater-objects-lurking-along-us-coasts/",
            "keywords": [
                "enigma",
                "objects",
                "characteristics",
                "instrumentation",
                "world-changing",
                "calibrated military instrumentation",
                "with unexplainable characteristics",
                "displaying capabilities gallaudet"
            ],
            "topics": [
                "science",
                "technology"
            ],
            "description": "A popular UFO-reporting app has recorded thousands of sightings of Unidentified Submersible Objects (USOs) near US waterways -- phenomena which high-ranking US Navy officials warn could pose a threat to national security.",
            "pub_date": "2025-10-26T19:45:29",
            "creator": "Chris Nesi",
            "content": "The truth is under there. A popular UFO-reporting app has recorded thousands of sightings of Unidentified Submersible Objects and Florida (306) both among the top three US states with the most ocean coastline. One of the most bizarre reports includes phone camera video of unexplained green lights traveling beneath the surface of the ocean. The app has released maps plotting out the reported sightings, represented as clusters of orange dots running up and down the east and west coasts. UFO sightings are nothing new, and are often dismissed as crackpottery by much of the scientific community or relegated to the stuff of science fiction, but retired Navy Rear Admiral Tim Gallaudet warns UFOs with the ability to go from air to sea without crashing or even creating a splash could have “world-changing” ramifications. “The fact that unidentified objects with unexplainable characteristics are entering US water space and the DOD is not raising a giant red flag is a sign that the government is not sharing all it knows about all-domain anomalous phenomena,” Gallaudet wrote in a March 2024 report. Alarm bells were raised in July 2019, when the USS Omaha recorded a UFO/UAP that vanished into the ocean without a trace after buzzing a Navy fleet off the coast of San Diego. Video of the incident was verified by the Pentagon, displaying capabilities Gallaudet said “jeopardizes U. S. maritime security, which is already weakened by our relative ignorance about the global ocean.” In his 29-page report for UFO-focused think tank the Sol Foundation, Gallaudet said there’s a documented pattern of similar phenomena being reported. “Pilots, credible observers and calibrated military instrumentation have recorded objects accelerating at rates and crossing the air-sea interface in ways not possible for anything made by humans,” he wrote.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Ftwo-bright-lights-hovering-underwater-114245576.jpg?w%3D575",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.042,
                "neg": 0.058,
                "neu": 0.9
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "6e9d1f92-024f-40b7-918b-ba0b653ac679",
            "title": "Charles Spencer planned ‘very different’ eulogy for sister Princess Diana — why he changed it",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/entertainment/charles-spencer-originally-planned-very-different-eulogy-for-princess-diana/",
            "keywords": [
                "charles",
                "gyles brandreth",
                "heartbreaking",
                "respectively",
                "traditional",
                "who transcended nationality",
                "his heartbreaking eulogy",
                "heartbreaking eulogy for"
            ],
            "topics": [
                "general"
            ],
            "description": "Charles Spencer planned ‘very different’ eulogy for sister Princess Diana — why he changed it",
            "pub_date": "2025-10-26T19:43:05",
            "creator": "Eric Todisco",
            "content": "Charles Spencer is looking back on his heartbreaking eulogy for Princess Diana. The 9th Earl Spencer, 61, appeared on the latest episode of Gyles Brandreth’s “Rosebud” podcast and revealed that he initially had a “very different” speech written for his sister’s funeral in Sept. 1997. “I flew back [to England] I was living in South Africa I flew back from Cape Town overnight. [I had a] very sweet stewardess help me, because I was in bits,” Spencer recalled. “I had a big, thick address book, and I thought, ‘I want to find someone who’s going to make the speech for her.’ And I got to ‘Z’ and I hadn’t found anyone,” he explained. “[I] got off the plane in Heathrow [Airport], called my mother, I said, ‘I can’t think who’s going to give the eulogy. And I’ve got an awful feeling it’s going to have to be me.’ And she said, ‘Well, it is going to be you. Your sisters and I have decided it.'” Spencer said that his original tribute to Diana who died on Aug. 31, 1997 in a car crash in Paris was a “very traditional eulogy.” “Almost.‘She was very good at this as a child’ and all that,'” Spencer shared. “And then I thought, ‘Well, this is ridiculous, that’s not who she was.'” He said he “realized” that his job to deliver the eulogy wasn’t to speak about Diana but to “speak for” her. “And I knew I’d been left at that stage it had no legal standing but I knew she’d left me as guardian of her sons,” he added, referring to his nephews Prince William and Prince Harry, who were 15 and 12, respectively, at the time of the accident. “Obviously, the other parent being alive, that meant nothing, but it meant something to me,” Spencer went on. “That sort of duty, I think. And then I wrote it in an hour and a half and, yeah, that was it, really.” Spencer also admitted he took “one bit out” of his eulogy about Rupert Murdoch because it was “rather unnecessary.” Spencer gave the eulogy for his late sister at Westminster Abbey on September 6, 1997. “Diana was the very essence of compassion, of duty, of style, of beauty,” Spencer said at the time. “All over the world she was a symbol of selfless humanity. All over the world, a standard bearer for the rights of the truly downtrodden, a very British girl who transcended nationality. Someone with a natural nobility who was classless and who proved in the last year that she needed no royal title to continue to generate her particular brand of magic.” “She would want us today to pledge ourselves to protecting her beloved boys, William and Harry, from a similar fate and I do this here Diana on your behalf,” he continued. “We will not allow them to suffer the anguish that used regularly to drive you to tearful despair.” Spencer also pledged that William and Harry would be raised as “two exceptional young men” whose souls “can sing openly as you planned.”.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fcharles-spencer-reveals-planned-very-114246072.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.078,
                "neg": 0.063,
                "neu": 0.859
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "8b4030fd-6217-481e-86c1-b5856a8c648d",
            "title": "US airports report over 20 air traffic controller shortage triggers in one day",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/us-news/2025/oct/26/air-traffic-controller-shortages-shutdown",
            "keywords": [
                "sean duffy",
                "duffy",
                "administration",
                "transportation",
                "international",
                "national air traffic controllers association",
                "transportation security administration",
                "federal aviation administration"
            ],
            "topics": [
                "economy",
                "government",
                "transportation",
                "media"
            ],
            "description": "Transportation secretary says figure is ‘one of the highest we’ve seen’ since 1 October as shutdown drags onUS airports have reported more than 20 incidents of air traffic controller shortages on Saturday, said Sean Duffy, transportation secretary, in the latest sign of the government shutdown’s impact. A ground stop was issued by the agency at Los Angeles international airport due to the air traffic controller staffing shortages at around 11. 30am ET (15. 30 GMT). The restriction covered most of the southern California region and delays are likely when flights resume.",
            "pub_date": "2025-10-26T19:42:15",
            "creator": "Michael Sainato and agencies",
            "content": "US airports have reported more than 20 incidents of air traffic controller shortages on Saturday, said Sean Duffy, transportation secretary, in the latest sign of the government shutdown’s impact. A ground stop was issued by the agency at Los Angeles international airport due to the air traffic controller staffing shortages at around 11. 30am ET (15. 30 GMT). The restriction covered most of the southern California region and delays are likely when flights resume. By noon ET on Sunday, the agency had recorded shortfalls in air traffic controllers at six US airports. The Trump administration warned flight disruptions are expected to increase as the shutdown drags on. He said that figure was “one of the highest that we’ve seen in the system” since 1 October. “That’s a sign that the controllers are wearing thin,” Duffy said. According to FlightAware, a flight tracking website, there were more than 5, 300 US flight delays on Saturday and more than 2, 500 by 12pm ET on Sunday. Since the shutdown began, delays have often been above average. According to the FAA, air traffic control staffing issues had already been reported on Sunday for Chicago and Newark flights. Through the shutdown of the federal government, around 13, 000 air traffic controllers and about 50, 000 Transportation Security Administration (TSA) officers must work without pay during the shutdown, as Republicans and Democrats remain deadlocked over passing a federal budget. “This shutdown has real consequences for these hard-working American patriots,” said Nick Daniels, President of the National Air Traffic Controllers Association (NATCA), in a statement last week. “With each passing day, controllers become more distracted by the risk of receiving a zero-dollar paycheck on 28 October, despite working 40 hours per week and, in many cases, mandatory overtime due to the controller staffing shortage.” Air traffic controllers received a paycheck two weeks ago at around 90% of their regular pay, but Tuesday will mark their first fully unpaid pay period for work in October. Duffy noted air traffic controllers have been taking on second jobs to try to supplement the lost income. “They’re taking second jobs, they’re out there looking,” he said. The FAA is around 3, 500 air traffic controllers short of targeted staffing levels, which had many to work mandatory overtime and six-day weeks before the shutdown began. The shutdown also forced employees in training at the FAA Academy in Oklahoma to be sent home on 3 October. “Any lapse in training can push the clock back, as it did during the academy’s closure during the pandemic. “The furloughed employees want to be back on the job, all of the employees need to be paid and they want to start actively contributing to the modernization of the air traffic control system. We call on Congress to open the government as soon as possible.”.",
            "media_url": "https://i.guim.co.uk/img/media/5069ab5e9144e2766fb0cf770f388fd0b98fd352/417_0_4167_3333/master/4167.jpg?width=140&quality=85&auto=format&fit=max&s=6a48f589641ca074870e0252d7336df2",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: David Dee Delgado/Reuters",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.032,
                "neg": 0.046,
                "neu": 0.922
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "1a8d3c99-df16-4279-9faf-4a84708f4aef",
            "title": "NCAA ordered to pay $18M to former football player in concussion lawsuit",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/ncaa-south-carolina-state-football-robert-geathers-cte-concussion-lawsuit/",
            "keywords": [
                "orangeburg county",
                "robert geathers",
                "representatives",
                "encephalopathy",
                "dementia-like",
                "chronic traumatic encephalopathy",
                "influence dementia-like symptoms",
                "that influence dementia-like"
            ],
            "topics": [
                "lawsuit",
                "economy",
                "sports"
            ],
            "description": "Robert Geathers, who played at South Carolina State University from 1977 to 1980, was awarded $10 million. His wife, Debra, was awarded $8 million.",
            "pub_date": "2025-10-26T19:32:26",
            "creator": "CBS News",
            "content": "The NCAA owes a former college football player and his wife $18 million, a South Carolina jury decided while finding college sports' major governing body negligent in failing to warn the player about the long-term effects of concussions. Following a civil trial that wrapped up late last week, Orangeburg County jurors awarded $10 million to 68-year-old Robert Geathers, who played at South Carolina State University from 1977 to 1980 as a defensive end. His wife, Debra, was awarded $8 million, according to a court document. A physician diagnosed Robert Geathers with dementia several years ago, The Times and Democrat newspaper in Orangeburg reported. Now he has trouble with day-to-day tasks such as dressing himself and helping make meals. Other physicians who testified at the trial said Geathers displays symptoms of chronic traumatic encephalopathy, a degenerative brain disease found in former football players who received repeated blows to their heads while playing. CTE can be diagnosed only posthumously. The couple's attorneys argued to jurors that blows Geathers took during practices and games for the historically Black school in Orangeburg caused trauma that didn't show up until decades later, the newspaper reported. Geathers' attorney, Bakari Sellers, alleged the NCAA knew about concussion risks since the 1930s and when Robert Geathers' college career ended but didn't tell coaches or players about those risks until later. \"All of the information they knew, they withheld,\" Sellers told jurors, adding that \"their job was to keep the boys safe.\" The verdict can be appealed. NCAA spokesperson Greg Johnson said Saturday in an email that the organization disagreed with the verdict and that it \"was prepared to pursue our rights on post-trial motions and on appeal, if necessary.\" Johnson said the \"NCAA has prevailed in every other jury trial around the country on these issues\" and that the South Carolina State team standards \"followed the knowledge that existed at the time, and college football did not cause Mr. Geathers' lifelong health problems.\" NCAA trial attorney Andy Fletcher said at the trial that Robert Geathers has several health conditions that influence dementia-like symptoms, and that the NCAA's football rules committee is composed of representatives of member schools who could propose rules. \"There's going to be head-hits. That's inherent to the game. You can't take head-hits out of football,\" Fletcher said in closing arguments. According to the newspaper, the jury determined the NCAA \"unreasonably increased the risk of harm of head impacts to Robert Geathers over and above the risks inherent to playing football.\" And it also determined the NCAA \"voluntarily assumed duties to protect the health and safety of Robert Geathers\" and that the NCAA \"negligently breached their duties\" to him. After the trial, Sellers said the result provided justice: \"I felt good to hug Debra Geathers. She gets to go home and tell her husband some good news.\".",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/591c1294-7335-437f-9069-09e1e3e937cf/thumbnail/1200x630/05f272e38d5cf5123adc91e0fea7605f/gettyimages-1354908291.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.098,
                "neg": 0.062,
                "neu": 0.84
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "a5eada65-ff19-484a-b024-17956f7bd160",
            "title": "Staffing issues trigger temporary ground stop at LAX",
            "source_title": "Los Angeles Times",
            "source_link": "https://latimes.com",
            "article_link": "https://www.latimes.com/california/story/2025-10-26/staffing-issues-trigger-temporary-ground-stop-at-lax",
            "keywords": [
                "california gov",
                "gavin newsom",
                "transportation",
                "international",
                "experiencing",
                "faa air traffic control system command center",
                "los angeles international airport",
                "leaving passengers experiencing"
            ],
            "topics": [
                "airport",
                "government",
                "travel",
                "economy"
            ],
            "description": "The government shutdown, now in its fifth week, forces a ground stoppage at Los Angeles International Airport on Sunday. Flights have resumed, but travelers are advised to check their status.",
            "pub_date": "2025-10-26T19:31:37",
            "creator": "Los Angeles Times",
            "content": "A staffing shortage at Los Angeles International Airport prompted a temporary ground stop affecting flights Sunday morning. The restriction began around 8: 45 a. m. affecting departing flights for Oakland and was lifted at 10: 30 a. m. with a possibility of being extended until 2 p. m., according to an FAA Air Traffic Control System Command Center advisory. Even after the resumption of flights, travelers were instructed to check the status of their flights. The stoppage affected most of Southern California, leaving passengers experiencing flight delays of around 49 minutes, with some waiting up to 87 minutes, according to KTLA. California Gov. Gavin Newsom’s press office was quick to seize on news of the problems and goad President Trump’s Secretary of Transportation Sean Duffy. “Hell of a job, @SecDuffy,” Newsom’s office posted on X, sharing a news story about the LAX ground stop. “Can’t wait to see what you do with NASA.” The federal government shutdown, now in its fifth week, has forced air traffic controllers to work without pay.",
            "media_url": "https://ca-times.brightspotcdn.com/dims4/default/18aed8d/2147483647/strip/true/crop/3000x1575+0+215/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9e%2F1f%2F49d6503e475d9407afb31c6b7b18%2Fla-tr-lax-02.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.024,
                "neg": 0.092,
                "neu": 0.884
            },
            "source": {
                "id": "la-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "e361245c-5278-42e5-b142-6c39caebbeaf",
            "title": "Saracens’ Noah Caluori called up by England for autumn internationals",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/2025/oct/26/noah-caluori-called-up-to-england-squad-for-autumn-internationals",
            "keywords": [
                "noah caluori",
                "steve borthwick",
                "cunningham-south",
                "internationals",
                "rehabilitation",
                "forward chandler cunningham-south",
                "by table-topping northampton",
                "table-topping northampton on"
            ],
            "topics": [
                "sports",
                "international"
            ],
            "description": "19-year-old wing scored five tries on first Prem startBorthwick has picked 36-player squad for four matchesNoah Caluori, the 19-year-old Saracens wing, has been named in England’s autumn internationals squad by Steve Borthwick. Caluori burst on to the Prem scene by scoring five tries against Sale on 18 October and, as England gear up for a busy November featuring four Tests, Borthwick has called up the uncapped youngster after initially inviting him to a training camp last week. The 36-player squad, including 19 forwards and 17 backs, gathered at Pennyhill Park in Surrey on Sunday night.",
            "pub_date": "2025-10-26T19:30:54",
            "creator": "Luke McLaughlin",
            "content": "Noah Caluori, the 19-year-old Saracens wing, has been named in England’s autumn internationals squad by Steve Borthwick. Caluori burst on to the Prem scene by scoring five tries against Sale on 18 October and, as England gear up for a busy November featuring four Tests, Borthwick has called up the uncapped youngster after initially inviting him to a training camp last week. The 36-player squad, including 19 forwards and 17 backs, gathered at Pennyhill Park in Surrey on Sunday night. Caluori made his second Prem start for Saracens in the defeat by table-topping Northampton on Friday. He had a considerably quieter night than the phenomenal display against Sale, and was given a severe defensive test by the Saints’ all-court attacking game. However, his remarkable aerial ability was in evidence at Franklin’s Gardens and, by turning to Caluori for his autumn squad, Borthwick has signalled that he sees potential for him to play at the 2027 Rugby World Cup in Australia. The head coach found no place for Adam Radwan of Leicester, who shone in the Tigers’ win over Sale on Saturday and was chosen in Borthwick’s training squad last week. Radwan’s 23-year-old club colleague Emeka Ilione misses out because of a shoulder problem. The Sale flanker Tom Curry returns, having had surgery on a wrist ligament problem after the British & Irish Lions tour in the summer, and his scrum-half clubmate Raffi Quirke is also back from injury. There is good news for the Harlequins forward Chandler Cunningham-South, who takes his place in the squad despite a recent ankle injury, while Elliot Daly of Saracens and Leicester’s George Martin and Jack van Poortvliet will join the squad to work on injury rehabilitation. “Our focus is on making the most of the time we have together as we approach what will be a fiercely competitive series,” Borthwick said. “Facing Australia in the opening match will be a great test against a team that has been training and playing together for some time and is one of the in-form teams in the world.” The uncapped Caluori will be pitched into an fierce battle for starting spots in the back line: Tommy Freeman scored four tries in Northampton’s win against Saracens, and while the 24-year-old may be switching to outside-centre, there are several other world-class wing options available to Borthwick. Immanuel Feyi-Waboso notched his seventh try of the Prem season in Exeter’s victory against Gloucester on Saturday and leads the try-scoring charts, with Sale’s Tom Roebuck on five and Henry Arundell of Bath on four. Feyi-Waboso’s Exeter colleague Henry Slade, meanwhile, has scored a league-leading 70 points in five Prem rounds, roaring back into top form at 32. Slade has started the past two matches in the centres alongside the Chiefs’ new signing Len Ikitau of Australia, and they may now face each other at Twickenham on Saturday. The fly-half shirt could provide intrigue after George Ford enjoyed an outstanding summer tour with Borthwick’s team, playing in two wins against Argentina and one against the USA. Fin Smith, who stylishly pulled the strings for Northampton on Friday, was on Lions duty in Australia and the stock of the 32-year-old Ford rose in his absence. Tom Willis of Saracens is left out, as expected, after announcing his decision to return to France having established himself as Borthwick’s first-choice No 8. The 20-year-old Henry Pollock, another player who starred for the Saints on Friday, will be an option for the No 8 jersey leading into the World Cup. Australia defeated Japan 19-15 in Tokyo on Saturday to begin their autumn schedule but after the forwards Lukhan Salakaia-Loto and Josh Canham were injured, Joe Schmidt said he may be forced to call up reinforcements, with the second row being an area of concern. “With England’s strong pack, it just means that we are light in the second row, and we may need to get some reserves dug out from Australia,” the Australia head coach said. “That’s probably our first thought.” Australia’s visit to Twickenham on Saturday is followed by fixtures for England against Fiji a week later, the All Blacks on 15 November, and Argentina on 23 November.",
            "media_url": "https://i.guim.co.uk/img/media/cd3260da5dc1480f844a0757c70cbed4d00dae62/292_0_2917_2333/master/2917.jpg?width=140&quality=85&auto=format&fit=max&s=4ec309310d243ff8ae987fd4260c30d7",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Gaspafotos/MB Media/Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.083,
                "neg": 0.058,
                "neu": 0.859
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "f3233933-fc14-4449-92f1-70ecef32b3a8",
            "title": "Nick Mangold honored by ex-Jets teammates and NFL world after shocking death at 41",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/nick-mangold-honored-by-nfl-community-after-shocking-death-at-41/",
            "keywords": [
                "nick mangold",
                "mangold",
                "accomplishments",
                "complications",
                "hall-of-famer",
                "football community collectively",
                "community collectively mourned",
                "seven-time pro-bowler during"
            ],
            "topics": [
                "sports",
                "death"
            ],
            "description": "Nick Mangold honored by ex-Jets teammates and NFL world after shocking death at 41",
            "pub_date": "2025-10-26T19:28:38",
            "creator": "Cooper Albers",
            "content": "The football community collectively mourned the sudden passing of former Jets center Nick Mangold on Sunday, with Mangold’s family and friends receiving an outpouring of support from his former teammates, peers and friends on social media. The beloved Jets lineman died Saturday night from complications of kidney disease just two weeks after revealing he was in need of a transplant. Mangold was 41 years old. “I was fortunate to have the opportunity to lace them up with you every Sunday,” NFL Hall of Famer and former Jet Darrelle Revis wrote on X. “I will miss you and forever cherish our moments in the locker room. Love you buddy. Rest in Paradise, Nick.” “No way, I can’t believe this. Life is too short,” posted former teammate Leger Douzabele who played with Mangold on the Jets from 2013-2015 shortly before Sunday’s public announcement. “Tell people who you love how you feel about them. While they’re still here.” Mangold was a seven-time Pro-Bowler during his 11-year career with New York from 2006-2016. A tremendous teammate and fierce competitor, Mangold garnered respect and admiration from around the league. “When I got the nod from Rex Ryan to come to New York and play, I didn’t just want to play with the Jets I wanted to play with Nick Mangold,” Willie Colon, who played with the Jets from 2013-2015, said on the team’s pregame show Sunday afternoon. “The rivalry brought us to each other the way you prepared and played the game made you my brother on the grid iron,” wrote Braylon Edwards, a former Cleveland Brown who had two stints with the Jets (2009-10 and 2012). “Praying for your family and loved ones. I’ll be sure to have a Mcallan 12 years aged today in honor of the latest we played together.” Embattled former Jets quarterback Mark Sanchez also paid tribute to Mangold on X. “We lost a good man today. I know @nickmangold will be a hall-of-famer, but there’s more to his story than his accomplishments on the gridiron. He was more than a teammate. He was my big brother who introduced me to the NFL. He showed me the ropes. He was my friend and confidant. He was a role model and a great father to his children and husband to his wife. Our hearts are heavy. We will miss you. Rest easy amigo. I love you big fella. #74,” he wrote. Longtime Patriots receiver Julian Edelman added that “Nick was a force on the field and a genuinely nice guy off of it. He will be missed.” Bartsool Sports founder and Patriots superfan Dave Portnoy also recognized Mangold in a heartfelt post. “So sad. By all accounts just a great guy. Insane how quickly this happened. Cruel reminder not to take a day for granted on this earth. RIP Nick,” he posted on X. Said former Texans great JJ Watt, “This is just terrible. Rest in Peace Nick.” Elsewhere on X, seven-year NFL vet Bobby Carpenter reflected on his college days playing with Mangold at Ohio State University. “I thought we had more time of his death. Mangold is survived by his wife, Jennifer, and their four children.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F74-new-york-jets-laughs-114246399.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.178,
                "neg": 0.044,
                "neu": 0.778
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "fc680772-ae1e-4782-a554-ce74542e18a3",
            "title": "Random serial slasher — who cuts men on left side of face — suspected in three weekend NYC attacks: sources",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/us-news/random-serial-slasher-suspected-in-three-weekend-nyc-attacks-sources/",
            "keywords": [
                "cops",
                "kings county hospital",
                "law-enforcement",
                "investigation",
                "intersection",
                "preliminary investigation suggests",
                "law-enforcement sources said",
                "but law-enforcement sources"
            ],
            "topics": [
                "crime",
                "violence",
                "attack",
                "law",
                "public"
            ],
            "description": "The suspect launched three bloody attacks over the weekend, beginning around 6: 30 a. m. Saturday on a northbound Q train at the Church Avenue subway station, when a 37-year-old straphanger was slashed in the left side of his face, sources said.",
            "pub_date": "2025-10-26T19:24:21",
            "creator": "Joe Marino, Jorge Fitz-Gibbon",
            "content": "A suspected random serial slasher who cuts men on the left side of their face is on the loose in Brooklyn, law-enforcement sources said Sunday. The suspect launched three bloody attacks over the weekend, beginning around 6: 30 a. m. Saturday on a northbound Q train at the Church Avenue subway station, when a 37-year-old straphanger was slashed in the left side of his face, sources said. Cops responded to a 911 call at the scene and rushed the victim to Kings County Hospital, where he was listed in stable condition, according to police. Then at 9: 40 p. m. Saturday, the same fiend apparently struck again, attacking a 53-year-old man at the intersection of Foster Avenue and New York Avenue again leaving the victim with a slash to the left side of his face, sources said. He was also taken to Kings County Hospital in stable condition, sources said. The latest attack occurred shortly before 7 a. m. Sunday in front of 3311 Newkirk Ave., when a 56-year-old man was attacked and again slashed to the left side of the face, according to police. The victim was also taken to Kings County Hospital in stable condition, also. Cops said the attacks are under investigation, and there have been no arrests. Police have not officially linked the three incidents, but law-enforcement sources said a preliminary investigation suggests that the same deranged nut is behind all three assaults.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F20pm-intoxicated-man-fell-subway-19335545_ce9a43.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.025,
                "neg": 0.154,
                "neu": 0.821
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "fa80f923-a1e9-44ad-bf3c-ba83ff8e7cd3",
            "title": "Russia’s new ‘invincible’ nuclear missile is ready to be deployed, Putin claims",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/world-news/russias-new-invincible-nuclear-missile-is-ready-to-be-deployed-putin-claims/",
            "keywords": [
                "vladimir putin",
                "putin",
                "intercontinental",
                "nuclear-capable",
                "infrastructure",
                "including intercontinental ballistic",
                "intercontinental ballistic missiles",
                "nuclear-capable cruise missile"
            ],
            "topics": [
                "military",
                "defense"
            ],
            "description": "Moscow carried out a successful test of its new \"invincible\" nuclear-capable cruise missile, with the Kremlin working towards military deployment of the weapon, Russian President Vladimir Putin said on Sunday.",
            "pub_date": "2025-10-26T19:22:10",
            "creator": "Ronny Reyes",
            "content": "Moscow carried out a successful test of its new “invincible” nuclear-capable cruise missile, with the Kremlin now working to deploy the doomsday weapon, Russian President Vladimir Putin said on Sunday. Putin hailed the test in a video released by the Kremlin while dressed in military fatigues, with the strongman calling on his top general to start preparing the Burevestnik missile for potential use. “We need to determine the possible uses and begin preparing the infrastructure for deploying these weapons to our armed forces,” Putin instructed. Little is known about the Burevestnik missile, which NATO code-named Skyfall. Putin previously touted the weapons as his “invincible” missile, capable of bypassing all current and future missile defense systems. He also claimed that the nuclear-armed has a nearly unlimited range and an unpredictable flight path, making it impossible to intercept. Valery Gerasimov, chief of the general staff of Russia’s armed forces, claimed the latest test showed the missile was capable of flying for 15 hours and covered a distance of about 8, 700 miles, easily capable of reaching New York City or Washington D. C. The Trump administration has been made aware of the “successful” missile test, said Kirill Dmitriev, Putin’s special envoy who was in the US when the video was released. The test comes after Putin directed a set of nuclear drills earlier this week that featured practice launches of the Kremlin’s nuclear-capable missile fleet, the largest in the world. The Kremlin claimed the drills included all parts of Moscow’s nuclear triad, including intercontinental ballistic missiles and its Tu-95 strategic bombers. Putin has previously said that the Kremlin is free to use doomsday weapons against any nation propped up by a nuclear power, a clear threat against NATO and the US over their support of Ukraine. Despite Moscow’s boasts, experts have said it remains unclear if the Skyfall missile boasts all of the advances that Putin claims. The Burevestnik has had a poor test record in recent years, with two partial successes documented among the 13 known tests, according to the Nuclear Threat Initiative advocacy group. The missile also reportedly killed five nuclear engineers and two service members following an explosion in 2019 during tests at a navy White Sea base. With Post wires.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Frussian-president-vladimir-putin-speaks-114223233.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.092,
                "neg": 0.094,
                "neu": 0.814
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "8cd97fd3-c9d9-4817-be45-eed63de718c5",
            "title": "U.S. warship docks in Trinidad and Tobago amid tensions with Venezuela",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/us-warship-docks-trinidad-and-tobago-venezuela/",
            "keywords": [
                "tobago",
                "venezuela",
                "non-international",
                "persad-bissessar",
                "administration",
                "non-international armed conflict",
                "potential military operations",
                "operations against venezuela"
            ],
            "topics": [
                "international",
                "politics"
            ],
            "description": "In an interview aired Sunday Lindsey Graham said land strikes in Venezuela are a \"real possibility\" amid rising tensions.",
            "pub_date": "2025-10-26T19:21:57",
            "creator": "CBS News",
            "content": "A U. S. warship docked in Trinidad and Tobago's capital on Sunday as the Trump administration boosts its military pressure on neighboring Venezuela and President Nicolás Maduro. The arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation joins the aircraft carrier USS Gerald R. Ford, which is moving closer to Venezuela. Maduro criticized the movement of the carrier as an attempt by the U. S government to fabricate \"a new eternal war\" against his country. President Trump has accused Maduro, without providing evidence, of being the leader of the organized crime gang Tren de Aragua. Government officials from the twin-island nation and the U. S. said the massive warship will remain in Trinidad until Thursday so both countries can carry out training exercises. A senior military official in Trinidad and Tobago told The Associated Press that the move was only recently scheduled. The official spoke under the condition of anonymity due to a lack of authorization to discuss the matter publicly. Kamla Persad-Bissessar, the prime minister of Trinidad and Tobago, has been a vocal supporter of the U. S. military presence and the deadly strikes on suspected drug boats in waters off Venezuela. The Trump administration has said the U. S. is in a \"non-international armed conflict\" with drug cartels, arguing that the narcotics they smuggle kill tens of thousands of Americans every year, constituting an \"armed attack.\" The wife of Alejandro Carranza, one of the more than 30 people killed in the strikes, claimed he left home on Colombia's Caribbean coast to fish in open waters and denied he had any link to drug trafficking. In an interview aired Sunday Lindsey Graham said land strikes in Venezuela are a \"real possibility\" amid rising tensions. \"I think President Trump's made a decision that Maduro, the leader of Venezuela, is an indicted drug trafficker, that it's time for him to go. That Venezuela and Colombia have been safe havens for narco terrorists for too long,\" the Republican senator told Margaret Brennan. \"And President Trump told me yesterday that he plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia.\" U. S. Embassy Chargé d'Affaires Jenifer Neidhart de Ortiz said in a statement that the exercises seek to \"address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts.\" The visit comes one week after the U. S. Embassy in Trinidad and Tobago warned Americans to stay away from U. S. government facilities there. Local authorities said a reported threat against Americans prompted the warning. People in Trinidad and Tobago have criticize the warship's docking in town at a recent demonstration outside the U. S. Embassy. David Abdulah, the leader of the Movement for Social Justice political party, said Trinidad and Tobago should not have allowed the warship into its waters. \"This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there's a threat of war,\" said Abdulah, who is also the leader of the Movement for Social Justice political party. \"That's an abomination.\" Caricom, a regional trade bloc made up of 15 Caribbean countries, has called for dialogue. Trinidad and Tobago is a member of the group, but Persad-Bissessar has said the region is not a zone of peace, citing the number of murders and other violent crimes.",
            "media_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/10/26/a71ea015-fe80-4d07-8d6f-9c8e5e3ea987/thumbnail/1200x630/43cc70f700d5b938ac9f0344558e9831/ap25299602827484.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.044,
                "neg": 0.149,
                "neu": 0.807
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "3a3d2256-506e-4064-bd8b-4d27093d65d8",
            "title": "Arrests made in Louvre crown jewel heist, Paris prosecutor says",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/arrests-made-in-louvre-crown-jewel-heist-paris-prosecutor-says/",
            "keywords": [
                "charles de gaulle airport",
                "prosecutor",
                "connection",
                "allegedly",
                "brazen daytime robbery",
                "the paris prosecutor",
                "prosecutor 's office"
            ],
            "topics": [
                "crime",
                "theft",
                "international"
            ],
            "description": "The Paris prosecutor's office said Sunday that arrests had been made in connection to the brazen crown jewel heist at the Louvre, with one suspect arrested at Charles De Gaulle Airport as he allegedly tried to flee the country. Thieves stole an estimated $100 million worth of jewels and gems during a brazen daytime robbery that took less than eight minutes.",
            "pub_date": "2025-10-26T19:21:00",
            "creator": "CBS News",
            "content": "The Paris prosecutor's office said Sunday that arrests had been made in connection to the brazen crown jewel heist at the Louvre, with one suspect arrested at Charles De Gaulle Airport as he allegedly tried to flee the country. Thieves stole an estimated $100 million worth of jewels and gems during a brazen daytime robbery that took less than eight minutes.",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/45fb5da0-d77b-47c1-9b8e-67093ced7e77/thumbnail/1200x630/9837b1a4e7429f7f3b41ac46b75c072c/102625-ftn-paris.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.103,
                "neg": 0.16,
                "neu": 0.737
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "ebf53ed9-6a11-44fa-9134-14e68d641b1c",
            "title": "Hero ex-cops rescue woman walking with 5-month-old baby into NYC’s East River: ‘You guys gotta get over there!’",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/us-news/hero-ex-cops-rescue-woman-walking-with-baby-into-east-river/",
            "keywords": [
                "kevin o",
                "donnell",
                "presbyterian",
                "near-tragedy",
                "significant",
                "apparent near-tragedy occurred",
                "near-tragedy occurred just",
                "shore university hospital"
            ],
            "topics": [
                "general"
            ],
            "description": "A group of hero ex-cops pulled a woman holding a 5-month-old baby from the East River on Sunday after the lady walked into the water carrying the child, the former officers told The Post.",
            "pub_date": "2025-10-26T19:18:57",
            "creator": "Mikella Schuettler",
            "content": "A group of hero ex-cops pulled a woman holding a 5-month-old baby from the East River on Sunday after the lady walked into the water carrying the child, the former officers told The Post. “We heard a lot of screaming, and somebody yelled, ‘You guys gotta get over there!’ ” said retired cop Kevin O’Donnell, who used to helm the Community Affairs Office at the NYPD’s 109th Precinct in Queens. “She was walking straight out into the water.” O’Donnell was part of a gathering of retired NYPD officers helping at a Halloween event in Hermon Macneil Park in College Point when the apparent near-tragedy occurred just before noon. As the group of ex-officers rushed toward the water and O’Donnell called 911, the 30-year-old woman was with the baby and up to her chest in the water, he said. “Eventually, coming up from behind the woman, by then it was up to their neck in the water, both her and the baby she was holding, [one of the former cops] grabbed them both,” O’Donnell said. “He’s a hero, he was the one that grabbed her and pulled her out,” O’Donnell said. The ex-officer struggled to drag the woman to shore, and O’Donnell said there was a significant “language barrier” and that the woman caused a “commotion” as she got closer to land. After EMS and the NYPD arrived, a group of first responders was able to further get the woman and the infant out of the water. The 30-year-old woman was transported to North Shore University Hospital, while the baby went to New York Presbyterian, according the the NYPD. It’s unclear as of yet if the woman had given birth to the baby or what her intentions were, the department said.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fretired-nypd-officers-reporedly-stopped-114242627.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.046,
                "neg": 0.03,
                "neu": 0.924
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "e17c16a7-d0b6-47cf-98b4-a561d0000a98",
            "title": "Trump administration posts notice that no federal food aid will go out Nov. 1",
            "source_title": "Chicago Tribune",
            "source_link": "https://www.chicagotribune.com",
            "article_link": "https://www.chicagotribune.com/2025/10/26/trump-administration-federal-food-aid-nov-1/",
            "keywords": [
                "brooke rollins",
                "melissa",
                "administration",
                "second-longest",
                "supplemental",
                "supplemental nutrition assistance program",
                "administration blames democrats",
                "republican administration took"
            ],
            "topics": [
                "economy",
                "government",
                "shutdown",
                "food",
                "aid"
            ],
            "description": "The U. S. Department of Agriculture has posted a notice on its website saying federal food aid will not go out Nov. 1, raising the stakes for families nationwide as the government shutdown drags on.",
            "pub_date": "2025-10-26T19:18:20",
            "creator": "Adriana Gomez Licon",
            "content": "The U. S. Department of Agriculture has posted a notice on its website saying federal food aid will not go out Nov. 1, raising the stakes for families nationwide as the government shutdown drags on. The new notice comes after the Trump administration said it would not tap roughly $5 billion in contingency funds to keep benefits through the Supplemental Nutrition Assistance Program, commonly referred to as SNAP, flowing into November. That program helps about 1 in 8 Americans buy groceries. “Bottom line, the well has run dry,” the USDA notice says. “At this time, there will be no benefits issued November 01. We are approaching an inflection point for Senate Democrats.” The shutdown, which began Oct. 1, is now the second-longest on record. While the Republican administration took steps leading up to the shutdown to ensure SNAP benefits were paid this month, the cutoff would expand the impact of the impasse to a wider swath of Americans and some of those most in need unless a political resolution is found in just a few days. The administration blames Democrats, who say they will not agree to reopen the government until Republicans negotiate with them on extending expiring subsidies under the Affordable Care Act. Republicans say Democrats must first agree to reopen the government before negotiation. Democratic lawmakers have written to Agriculture Secretary Brooke Rollins requesting to use contingency funds to cover the bulk of next month’s benefits. But a USDA memo that surfaced Friday says “contingency funds are not legally available to cover regular benefits.” The document says the money is reserved for such things such as helping people in disaster areas. It cited a storm named Melissa, which has strengthened into a major hurricane, as an example of why it’s important to have the money available to mobilize quickly in the event of a disaster. The prospect of families not receiving food aid has deeply concerned states run by both parties. Some states have pledged to keep SNAP benefits flowing even if the federal program halts payments, but there are questions about whether U. S. government directives may allow that to happen. The USDA memo also says states would not be reimbursed for temporarily picking up the cost. Other states are telling SNAP recipients to be ready for the benefits to stop. Arkansas and Oklahoma, for example, are advising recipients to identify food pantries and other groups that help with food. Sen. Chris Murphy, D-Conn., accused Republicans and Trump of not agreeing to negotiate. “The reality is, if they sat down to try to negotiate, we could probably come up with something pretty quickly,” Murphy said Sunday on CNN’s “State of the Union.” “We could open up the government on Tuesday or Wednesday, and there wouldn’t be any crisis in the food stamp program.”.",
            "media_url": "https://www.chicagotribune.com/wp-content/uploads/2025/10/US_Government_Shutdown_Food_Aid_What_to_Know_25167_9936bd-1.jpg?w=1400px&strip=all",
            "media_type": "image/jpeg",
            "media_description": "FILE &#8211; A California&#8217;s SNAP benefits shopper pushes a cart through a supermarket in Bellflower, Calif., Feb. 13, 2023. (AP Photo/Allison Dinner, File)",
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.101,
                "neg": 0.068,
                "neu": 0.831
            },
            "source": {
                "id": "chicago-tribune",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "43c1f79e-05ed-4a1e-abfb-d9aa658bcba9",
            "title": "How Winston Churchill’s work impacted six monarchs: ‘Advised a whole dynasty’",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/opinion/how-winston-churchills-work-impacted-six-monarchs-advised-a-whole-dynasty/",
            "keywords": [
                "andrew morton",
                "morton",
                "counterintelligence",
                "america-loving",
                "transatlantic",
                "counterintelligence work going",
                "of counterintelligence work",
                "those melancholy interviews"
            ],
            "topics": [
                "culture",
                "media"
            ],
            "description": "“Winston and the Windsors” covers Churchill's life across six monarchs, from his birth during Queen Victoria’s reign through Edward VII, George V, Edward VIII, George VI and, finally, Elizabeth II.",
            "pub_date": "2025-10-26T19:14:10",
            "creator": "James Panero",
            "content": "Not just any biographer gets portrayed in a Netflix series. But Andrew Morton is no ordinary biographer. Morton released “Diana: Her True Story” in 1992. The source of his blockbuster biography was the princess herself, a fact Morton only revealed after Diana’s death. The details of those melancholy interviews, recorded secretly on cassette tape, appeared in the fifth season of “The Crown.” “In a funny kind of way, the actual buildup to the Diana book was more dramatic than they portrayed it,” Morton tells The Post. “We swept the room for bugs. There was a lot of counterintelligence work going on there.” Morton is in New York for the launch of “Winston and the Windsors: How Churchill Shaped a Royal Dynasty,” his latest book on the royal family. As he marks the publication of his 25th biography, Morton is soft-spoken as he enters the grand library of the gilded-age clubhouse where he has just given a reading. It could be the memory of bugged rooms still stings. “What a beautiful library. It’s almost as big as mine,” he says in his clipped Yorkshire English. While “Winston and the Windsors” tracks the connection of Britain’s greatest prime minister to the lives of six monarchs, the conversation first turns to New York. Many fail to realize the English statesman was, in fact, half Brooklynite. Churchill’s mother, Jennie Jerome, was born in Cobble Hill in 1854. A “dollar princess,” she married into the British aristocracy and conferred a certain New-York toughness in her America-loving son. “He’s got the English bulldog and the New York chutzpah,” says Morton. “And unlike many of those who’ve been born in palaces and in high places, he was pushy, he was shovy. He used his elbows to get where he wanted. He didn’t wait for the glittering prizes to fall into his lap. He opened them up, opened the wrapping, and consumed them.” If New York was part inspiration, the city almost once did him in as well. In December 1931, just up Fifth Avenue from where Morton now spoke, at 76th Street, Churchill was struck down by an unemployed motorist from Yonkers. Churchill had exited a taxi in the middle of the street and forgotten to notice the flow of American traffic. “It was bad enough to make headlines around the world,” Morton notes, as Churchill was whisked away to Lenox Hill Hospital, saying on intake he was a friend of the king. “And for the king to ask his advisers to get him on the phone, in the days when transatlantic phone calls were tricky, it was a measure of his fame or infamy.” Churchill at the time was a 57-year-old member of Parliament in need of money after the 1929 stock-market crash, and he made the best of a bad situation. “All the New York papers sent people along to try and interview him. A girl dressed up as a nurse. She was caught by a detective,” Morton recounts. Instead of giving away the story, Churchill sold his accident to a British newspaper. “So he goes in, and he tries to waft away the nurses and the doctors because he’s on the phone, dictating 2, 000 words or whatever on ‘my New York misadventure.’ For which he’s paid the princely sum of $2,500. Which enables him to go off to the Bahamas on holiday.” The accident also provided Churchill with a doctor’s note for a “naturally indefinite” amount of alcohol to be consumed each day, “especially at mealtimes” a not-so-sobering script to receive during American Prohibition. Such New York chutzpah may be one reason Churchill gets admired more today in America than in Great Britain. “Revisionist history,” Morton laments of the British reception. “Churchill is accused of all kinds of heinous crimes, which he had nothing to do with.” In America, however, “he was someone whom both sides of the aisle admired. When he spoke at Congress, he got standing ovations. People on both sides of the aisle believed him because he’d been right about the German expansionism of the 1930s just as when he gave his famous Iron Curtain speech in 1946. I don’t think it’s any coincidence that Trump ordered the bust of Churchill as one of the first things back into the Oval Office.” For Churchill, the transatlantic affection was mutual. “His big idea,” adds Morton, “was always follow America, always go with America. He believed that Britain’s future lay with America, and America’s future lay with Britain. Yes, and together they could do great things.” “Winston and the Windsors” covers Churchill’s life across six monarchs, from his birth during Queen Victoria’s reign through Edward VII, George V, Edward VIII, George VI and, finally, Elizabeth II. “There’ve been lots of politicians and statesmen who have advised a single president or prime minister,” says Morton, but “there’s not been a politician or statesman who has advised a whole dynasty as Churchill did.” The frequent turnover tells us much about Churchill’s long 63 years of public service as well as something of the era’s royal disorder. Such turmoil came to a head in 1936 with the freshly minted Edward VIII’s abdication over his twice-divorced American lover and intended wife, Wallis Simpson. Surprisingly, as someone who cared both for the monarchy and the new monarch, “Churchill felt that Mrs. Simpson was a good thing for Edward VIII,” says Morton. “Because as Prince of Wales, he was often drunk. He was late to events. His timekeeping was poor. He let people down. And Wallis emphasized the need for manners. She gave him calm, so that all these ticks and things that he did, he became calmer.” Churchill spent much political capital defending Edward, whose intended marriage stirred up a constitutional crisis. “He’s concerned that politicians can tell the monarch who he can or can’t marry. And that’s overstepping the bounds of the constitution,” Morton says of Churchill’s view of the critics. “He speaks in Parliament again, and he’s howled down for asking for more time,” Morton explains of Churchill’s defense of the beleaguered royal. A confidant tells Churchill, “In three minutes or five minutes, you’ve done more damage to yourself and the monarchy than anybody could have.” “So Churchill is a lonely, forlorn figure. But when it comes to the actual days of the abdication, he speaks in the House of Parliament very convincingly, and some people are moved to tears.” “Edward gave up his throne and the greatest empire we’ve all ever seen,” Morton says. “He was in love with her.” Churchill stayed loyal to Edward and Wallis, says Morton, even as the royal family swept them aside and the former king drew close to Hitler and his Nazi ambassador Joachim von Ribbentrop. “It was a great relief to everybody when he finally left because he was in the pocket of Hitler and Ribbentrop,” says Morton, adding, “Ribbentrop was alleged to have had an affair with Wallis.” And yet even when this started to come out, Churchill didn’t turn away. “One of the things about Churchill is that he’s very, very loyal to his friends. He was loyal to the nth degree.” As George VI replaced Edward VIII and Britain entered World War II, Churchill “did a signal service in making the monarchy seem relevant and sympathetic,” says Morton. “When Buckingham Palace was bombed, there’s a famous photograph of Churchill, George VI and the queen going through the rubble. He was the great showman. He got the press there to take pictures of them because he was talking to an audience of one, and that was Roosevelt.” In its darkest hour, as the Nazis made final preparations for an invasion of the English homeland, Britain’s last hope was America. “They pulled out all the diamonds and rubies from the crown jewels, put them in a hatbox and hid them in the basement of Windsor Castle,” Morton says of the royals, persuaded by Churchill to stay put in England rather than flee to Canada. “The queen was learning to shoot and would shoot rats as target practice. Churchill didn’t expect to live more than three weeks.” Churchill and the new king drew close through the war. “George VI proved to be an admirable counselor and a silent drum” for the prime minister, says Morton. “The king would be let in on these secrets by Churchill, who was carrying this great burden with him. And George VI helped carry that burden.” When George VI died in 1952 at the age of 56, Churchill became a surrogate parent to Elizabeth II as she ascended the throne at just 25 years old. “He was a father figure, not just to her but to the family,” says Morton. Asked how Churchill might have viewed this biographer’s other famous princess, “He would have been enamored with Diana,” Morton replies. “What senior statesman, and I include Henry Kissinger and others, wasn’t enamored by Diana?” Thinking about what happened just up the street nearly a century ago, what would the world be like if Churchill hadn’t survived that car crash? “We might all be wearing brownshirts,” Morton says of the fascist garb, shifting in his seat. “Churchill was blessed with good luck. He took part in the last-ever cavalry charge. He was lucky to escape injury in the Boer War. He was fortunate not to be pulverized by shells in the First World War when he went back to the trenches after the disaster of the Dardanelles. A series of fortunate events saved him. But it is also fortunate for us,” Morton concludes. “Absolutely fortunate.” James Panero is The New Criterion’s executive editor.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F1-new-york-times-bestselling-113922518.jpg?w%3D677",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.101,
                "neg": 0.076,
                "neu": 0.823
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "3c9936c5-ef6c-4a42-971e-bdfff56a0a2f",
            "title": "Migrant sex offender mistakenly released from prison arrested",
            "source_title": "Evening Standard",
            "source_link": "https://www.standard.co.uk",
            "article_link": "https://www.standard.co.uk/news/uk/finsbury-park-london-essex-police-keir-starmer-labour-government-b1254948.html",
            "keywords": [
                "hadush kebatu",
                "david lammy",
                "mistakenly-released",
                "plain-clothes",
                "conservative",
                "the mistakenly-released prisoner",
                "mistakenly-released prisoner was",
                "immigration detention centre"
            ],
            "topics": [
                "crime",
                "justice",
                "immigration"
            ],
            "description": "Migrant sex offender mistakenly released from prison arrested",
            "pub_date": "2025-10-26T19:12:45",
            "creator": "Ellie Ng",
            "content": "Ethiopian national Hadush Kebatu was jailed for 12 months in September for the sexual assault of a 14-year-old girl and was wrongly freed from HMP Chelmsford on Friday morning instead of being sent to an immigration detention centre. The migrant, who had been living at the Bell Hotel in Epping, Essex, when he assaulted the girl, took a train from Chelmsford to Stratford, east London, the day he was released and was later spotted in Dalston carrying a white bag with pictures of avocados on it. Police found and arrested him inside Finsbury Park at around 8. 30am on Sunday after a member of the public spotted him at a nearby bus stop. He added: “This man is a real danger to young women and children and for him to be wrongly released and walking the streets freely just four months after carrying out two sexual assaults, only five weeks after being sentenced, all because of a system failure on Friday is unbelievably irresponsible.” David Lammy told broadcasters that Kebatu needs to be questioned by police before he is deported, adding: “I can assure you that he will be deported as he was expected to be deported. I expect that to happen this week.” The Justice Secretary said he recognises that it will have been an “anxious time” for Kebatu’s victims and their families, and that he will announce a “full independent inquiry” into what has happened in Parliament on Monday. A witness who saw Kebatu being led out of Finsbury Park by female officers said the mistakenly-released prisoner was walking “calmly” and “wasn’t trying to get away”. Jack Neill-Hall told the PA news agency: “I was there to walk my dog and as I entered the park I saw a group of five people two uniformed officers, someone who looked more like they were a plain-clothes officer, and a fourth person who I don’t know what their role was and a man who looked awfully like the Epping asylum seeker guy who’d been on all the newspapers over the weekend. “I knew that he’d last been seen in the Hackney area and I thought ‘oh, that looks awfully like that guy, he’s not wearing the same clothes but it looks like him’. “I didn’t see him being arrested but I saw they were walking with the two female officers with their hands on him, two further officers who were talking into a radio walking down. towards the exit. The 40-year-old, who lives in the Finsbury Park area, continued: “He wasn’t struggling, he was walking quite calmly, a bit dejectedly, he was staring down, he had his hood up, but it was a calm situation. “It was a leisurely stroll out of the park with him with his hands cuffed but he wasn’t trying to get away.” “It’s unacceptable that the safety of my constituents, and the people of London, was ever put at risk,” she said. “The Government has serious questions to answer and major work to do to make the system fit for purpose. It certainly isn’t at the moment. The Conservative MP for Croyd “What should happen now to this man is that he should be immediately deported. He is quite clearly a risk to women and girls.” Zia Yusuf, head of policy for Reform UK, said he was “relieved” Kebatu was apprehended, telling Sky News: “This is a man who eyewitnesses said was actively trying to go back into prison after being accidentally let go. “So, look, glad he’s been apprehended but I mean it’s absolutely shocking and how any victim of sexual assault could look at this Labour Government and Jess Phillips in particular, and the whole state apparatus right now, and have any degree of confidence is beyond me.” It is understood Kebatu, who crossed the Channel in a small boat to enter the UK on June 29, left prison with an amount of personal money but was not given a discharge grant to cover subsistence costs. A delivery driver, named only as Sim, described to Sky News seeing Kebatu return to HMP Chelmsford in a “very confused” state “four or five times”, only to be turned away by prison staff and directed to the railway station. Kebatu was convicted of making inappropriate comments to a 14-year-old girl before he tried to kiss her on July 7 just eight days after he arrived in the country on a small boat. His trial also heard that a day later, he sexually assaulted a woman by trying to kiss her, putting his hand on her leg and telling her she was pretty. The woman later called 999 after she spotted him being inappropriate to the same teenage girl who he sexually assaulted while she was wearing her school uniform. The migrant was found guilty of five offences after a three-day trial at Chelmsford and Colchester magistrates’ courts in September and his sentencing hearing heard it was his “firm wish” to be deported. In court, Kebatu gave his date of birth through a translator as being in December 1986, making him 38 years old, although Essex Police have said their records state his date of birth is in December 1983, making him 41.",
            "media_url": "https://static.standard.co.uk/2025/10/26/09/901c58e806d3fc439f17f765c98dd812Y29udGVudHNlYXJjaGFwaSwxNzYxNTU3ODk4-2.82153458.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.061,
                "neg": 0.069,
                "neu": 0.87
            },
            "source": {
                "id": "evening-standard",
                "country": "GB",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "7dc2375f-9fa5-4123-b1d4-943b89a683cc",
            "title": "Drivers raging as £450k raked in from yellow box junction in just 8 months",
            "source_title": "Daily Express",
            "source_link": "https://www.express.co.uk",
            "article_link": "https://www.express.co.uk/news/uk/2126217/drivers-raging-fines-yellow-box-junction",
            "keywords": [
                "between january",
                "kingston-upon-thames",
                "astonishing",
                "accommodate",
                "situated in kingston-upon-thames",
                "kingston-upon-thames in south",
                "drivers repeatedly falling",
                "in kingston-upon-thames in"
            ],
            "topics": [
                "economy",
                "business",
                "finance"
            ],
            "description": "Drivers raging as £450k raked in from yellow box junction in just 8 months",
            "pub_date": "2025-10-26T19:12:00",
            "creator": "Laura Zilincanova",
            "content": "A yellow box junction has raked in an astonishing £450, 000 in just eight months, with drivers repeatedly falling foul of the rules. Between January and August this year, the junction brought in just over £450, 000 from motorists who entered the yellow box illegally often without realising it. The junction, situated in Kingston-upon-Thames in South West London, features two yellow boxes side by side, directly in front of a set of traffic lights large enough to accommodate two small cars. The Highway Code forbids drivers from entering a yellow box until they can drive over it without needing to stop, to help traffic flow on busy roads. Residents have reported \"constant tooting, screaming and shouting\" as drivers fall foul of the system and rack up fines. A local who runs The Real Butchers, which is next to the yellow boxes, said on a Wednesday morning, in just 25 minutes, he saw five drivers getting stuck on the yellow grid.",
            "media_url": "https://cdn.images.express.co.uk/img/dynamic/1/590x/2126217_1.jpg",
            "media_type": "img/jpeg",
            "media_description": "Drivers have been left frustrated by the fines",
            "media_credit": "Getty",
            "media_thumbnail": "https://cdn.images.express.co.uk/img/dynamic/1/237x141/2126217_1.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.029,
                "neg": 0.053,
                "neu": 0.918
            },
            "source": {
                "id": "daily-express",
                "country": "GB",
                "political_leaning": "right",
                "reliability_score": 5.0,
                "type": "newspaper"
            }
        },
        {
            "id": "557a1adb-9518-49f1-a2b0-2f810d31e069",
            "title": "Mexican Grand Prix: Formula One – live updates",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/live/2025/oct/26/mexican-grand-prix-formula-one-live-updates",
            "keywords": [
                "lando norris",
                "oscar piastri",
                "opportunity",
                "performance",
                "significant",
                "significant advantage over",
                "performance in qualifying",
                "qualifying yesterday has"
            ],
            "topics": [
                "sports",
                "racing"
            ],
            "description": "Live updates from the Autodromo Hermanos RodríguezEpic three-way title in Mexico . in 1964 | Email Billy1) Lando Norris (McLaren) 2) Charles Leclerc (Ferrari)3) Lewis Hamilton (Ferrari) 4) George Russell (Mercedes).",
            "pub_date": "2025-10-26T19:10:07",
            "creator": "Billy Munday",
            "content": "Preamble Well, what an opportunity for Lando Norris in Mexico City. His performance in qualifying yesterday has given him a significant advantage over his title rivals in a race that gets under way in an hour’s time. The McLaren driver starts on pole, with his teammate and overall leader Oscar Piastri only 7th and Max Verstappen in 5th. Completing the front row is Charles Leclerc, with Lewis Hamilton in 3rd and George Russell 4th. I’ll be bringing you lap-by-lap updates when the grand prix gets started at 8pm (GMT). With only five races of the season remaining and just 40 points between the top three drivers in the standings, it’s sure to be pivotal in the destination of the title. ¡Vamos!.",
            "media_url": "https://i.guim.co.uk/img/media/75cc6d75248c8c0694dc93c1afb52fd22321be48/1140_191_3499_2800/master/3499.jpg?width=140&quality=85&auto=format&fit=max&s=045e2b3d3e05614ed41ce68b900ba834",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Bryn Lennon/Formula 1/Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.126,
                "neg": 0.0,
                "neu": 0.874
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "55a059bb-3584-432b-9b47-fdcc759bc8b5",
            "title": "Nick Mangold’s heartbreaking final interview before Jets great’s death at 41",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/sports/nick-mangolds-heartbreaking-final-interview-before-jets-greats-death-at-41/",
            "keywords": [
                "nick",
                "mangold",
                "life-or-death",
                "acknowledged",
                "particularly",
                "acknowledged was frightening",
                "particularly like surgery",
                "kidney disease awareness"
            ],
            "topics": [
                "death",
                "health"
            ],
            "description": "Nick Mangold passed away Saturday at 41, less than two weeks after the former Jets center went public with the fact he needed a kidney transplant.",
            "pub_date": "2025-10-26T19:09:59",
            "creator": "Dan Martin",
            "content": "Nick Mangold passed away Saturday at 41, less than two weeks after the former Jets center went public with the fact he needed a kidney transplant. That same day, Oct. 14, Mangold spoke with The Post’s Steve Serby, in what’s believed to be his final interview. “I assumed I’d be like 60 or so before it came up,” Mangold said that day. “But it’s reared its ugly head now, sooner than I thought it would.” Mangold learned he had chronic kidney disease in 2006, but only let those closest to him aware of his condition until this month. “I don’t think anybody knew about it other than the doctors and my family,’’ Mangold said. “I didn’t want any cloud hanging over anything that I did.” But that changed when his health worsened recently, which led Mangold to have to get dialysis three times a week. “Over the summer I had lost about 35 pounds over two months, and my red blood cell count dropped to about half of what is supposed to be normal,” Mangold told Serby. “I was very fatigued and having dizzy spells and nausea and everything and so I went to the doctor.” That’s when he learned he needed a transplant for a new kidney, which he acknowledged was frightening. “Oh, very much so,’’ Mangold said. “Getting told to go to the hospital immediately was not a great phone call to get. I don’t particularly like surgery, so that’s always scary. You put the trust in the doctors’ hands.” Despite the dire situation he was in, Mangold said his life wasn’t at risk. “It’s more just to get it done, rather than [a] life-or-death situation,’’ Mangold said. “Apparently you can be on dialysis for many years. It’s quality of life that we’re looking at.” And he called himself “fortunate” that he knew what was ahead of him. “In a weird way I’m actually kinda fortunate that I have a path to recovery,” Mangold said. “There’s a lot of people that go through illness and different things that there isn’t a direct path to how you get better. I have a direct path, I just need to go on that path.” He wanted to go public, as well, to spread the message of kidney disease awareness. “It’s something that I feel now I think a little bit more empowered to talk about,” Mangold said. “That it’s really affecting me, for people that it’s also affecting. Because there’s plenty of people out there that deal with chronic kidney disease in everyday life. I played 11 years with chronic kidney disease, and now, if I have the opportunity to share that message, that I was able to do things that I wanted to do while dealing with it, that they can do things as well.” He leaves behind his wife, Jenny, and four children, Matthew, 14; Eloise, 11; Thomas, 9; and Charlotte, 7.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2Fjets-center-nick-mangold-speaking-38176687_e533cb.jpg?w%3D1024",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.066,
                "neg": 0.072,
                "neu": 0.861
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "07923d12-1dcd-4a65-afe4-9c530dcfb322",
            "title": "Dylan Efron suffers brutal nose injury in ‘DWTS’ rehearsals",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://pagesix.com/2025/10/26/celebrity-news/dylan-efron-suffers-brutal-nose-injury-in-dwts-rehearsals/",
            "keywords": [
                "dylan",
                "efron",
                "star-studded",
                "competition",
                "dylannnnnn",
                "instagram stories alongside",
                "joining the star-studded",
                "the star-studded season"
            ],
            "topics": [
                "entertainment",
                "media"
            ],
            "description": "Back in September, it was announced that the \"Traitors\" alum would be joining the star-studded Season 34 cast of “DWTS.\".",
            "pub_date": "2025-10-26T19:06:56",
            "creator": "Tamantha Ryan",
            "content": "Dylan Efron revealed he broke his nose while rehearsing for an upcoming episode of “Dancing With the Stars.” “Broke my nose, but dont need it to dance 🕺,” he captioned a carousel of Instagram photos of him in the hospital. “I’m seriously all good- but I’ll never forget the way Dani [Daniella Karagach], Pasha [Pashkov] and Danielle [Fisher] WOULDN’T leave me side when it happened, warms my heart to have friends like them ❤️,” Efron, 33, added. In one of the clips, the producer laughed with a friend as he was about to get an MRI scan. Efron was sent well wishes by his co-stars, friends and fans in the comments section of his post. “WHAT?!! @dylanefron hope you’re ok!” “DWTS” pro Emma Slater wrote. Efron’s Pal Rob “Boston Rob” Mariano commented, “Keep him in line @daniellakaragach.” “What!!!!! Feel better mate 👊,” Robert Irwin wrote, while Alix Earle added, “OMG 😢 dylannnnn.” “I’m alerting HR!” Andy Richter joked. “Dylannnnnn NOOOOOO im so sorry!” Whitney Leavitt wrote. The “Traitors” alum then gave an update on his injury, writing that he was thankful for all of the kind messages. “I truly am ok :),” he added to his Instagram Stories alongside a smiling selfie. “We’re back practicing and giving 100.” Back in September, it was announced that the younger brother of actor Zac Efron would be joining the star-studded Season 34 cast of “DWTS,” joining celebs like Danielle Fishel, Irwin, Earle and more. Earlier this week, Dylan revealed why the “High School Musical” actor, 38, has been absent from cheering him on in the ballroom. “Hey, he’s doing his thing,” he told “Extra” after the Oct. 21 episode of the competition series. Dylan also said his Zac has been “supporting me every day.”.",
            "media_url": "https://pagesix.com/wp-content%2Fuploads%2Fsites%2F3%2F2025%2F10%2Fdylan-efron-suffers-brutal-nose-114240844.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.216,
                "neg": 0.039,
                "neu": 0.744
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        },
        {
            "id": "b7506501-82f0-4e3f-95d9-f70f3455a5dc",
            "title": "Rape of woman in Walsall being treated as racially aggravated, police say",
            "source_title": "Evening Standard",
            "source_link": "https://www.standard.co.uk",
            "article_link": "https://www.standard.co.uk/news/uk/walsall-west-midlands-police-cctv-police-sikh-b1254985.html",
            "keywords": [
                "detective superintendent ronan tyrer",
                "tame road",
                "superintendent",
                "investigation",
                "investigators",
                "development chief superintendent",
                "officers recovering evidence"
            ],
            "topics": [
                "crime",
                "violence",
                "race",
                "law"
            ],
            "description": "Rape of woman in Walsall being treated as racially aggravated, police say",
            "pub_date": "2025-10-26T19:04:51",
            "creator": "Claire Hayhurst",
            "content": "West Midlands Police have released CCTV footage of the suspect. CCTV image of a man believed to have carried out a rape of a woman in a racially aggravated attack (West Midlands Police/PA) PA Media Claire Hayhurst 4 minutes ago An urgent police appeal has been launched to identify a man believed to have raped a woman in a racially aggravated attack. West Midlands Police were called to the Park Hall area of Walsall just after 7. 15pm on Saturday after a woman was reported to be distressed in the street. Officers established that the woman, aged in her 20s, had been raped and assaulted at a nearby property by a man she did not know, the force said. It confirmed that the incident was being treated as “racially aggravated”. The attacker is described as white, aged in his 30s, with short hair and wearing dark clothing at the time. Police released CCTV footage of the suspect and asked anyone who knows his identity to ring 999 immediately. (West Midlands Police/PA) Detective Superintendent Ronan Tyrer, of West Midlands Police, said: “This was an absolutely appalling attack on a young woman, and we are doing absolutely everything we can to arrest the person responsible. “We have teams of officers recovering evidence and building a profile of the attacker so that he can be brought into custody as soon as possible. “While we are following multiple lines of enquiry right now, it’s vital that we get to hear from anyone who saw a man acting suspiciously in the area at the time. “It may be that you were driving through the area and have dashcam footage, or you have CCTV that we have not yet recovered. Your information could be the vital breakthrough that we need. “At this stage we are not linking this attack to any other offences.” Last month, a Sikh woman was raped in grassland on Tame Road, Oldbury, in an incident also treated as racially aggravated by police. Preet Kaur Gill MP, the Labour (Co-op) MP for Birmingham Edgbaston, posted on X: “Deeply shocked and saddened that we are hearing of yet another racially aggravated rape this time in Walsall. “West Midlands Police have reported a rape and assault of a young woman in her 20s in the Park Hall area, described as racially aggravated.” In a statement on Sunday evening, West Midlands Police confirmed that officers from the public protection unit, local policing officers and forensic officers had worked overnight on the investigation. Read More Hadush Kebatu’s victim, 14, ’caused so much stress and anxiety’ over his release Migrant sex offender mistakenly released from prison arrested Streeting hits out at ‘racist’ comments by Reform’s Pochin Sponsored Get ahead with expert services designed to boost business development Chief Superintendent Phil Dolby said: “Our focus is on supporting the investigators in identifying and arresting the attacker. “Walsall is a diverse area and we know the fear and concern that this awful attack will cause in our communities. “We have been speaking to people in the community today to listen to and understand their concerns and there will be an increased policing presence in the coming days.” Anyone with information is asked to contact West Midlands Police on 101 or the live chat online, quoting log 4027 of 25 October. MORE ABOUT.",
            "media_url": "https://static.standard.co.uk/2025/10/26/19/7350179e1859014809318ff57acfbd33Y29udGVudHNlYXJjaGFwaSwxNzYxNTkxNjAy-2.82164721.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Media",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.027,
                "neg": 0.205,
                "neu": 0.768
            },
            "source": {
                "id": "evening-standard",
                "country": "GB",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "dfb2753d-a233-4d3b-a129-70b0d0b5d2f2",
            "title": "US warship docks in Trinidad and Tobago, putting more pressure on Venezuela",
            "source_title": "Chicago Tribune",
            "source_link": "https://www.chicagotribune.com",
            "article_link": "https://www.chicagotribune.com/2025/10/26/us-warship-trinidad-and-tobago-venezuela/",
            "keywords": [
                "tobago",
                "persad-bissessar",
                "administration",
                "port-au-spain",
                "administration boosts military",
                "recent demonstration outside",
                "trump administration boosts"
            ],
            "topics": [
                "military",
                "international"
            ],
            "description": "A U. S. warship docked in Trinidad and Tobago ‘s capital Sunday as the Trump administration boosts military pressure on neighboring Venezuela and its President Nicolás Maduro.",
            "pub_date": "2025-10-26T19:03:36",
            "creator": "Anselm Gibbs",
            "content": "PORT-AU-SPAIN, Trinidad and Tobago A U. S. warship docked in Trinidad and Tobago ‘s capital Sunday as the Trump administration boosts military pressure on neighboring Venezuela and its President Nicolás Maduro. The arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation is in addition to the aircraft carrier USS Gerald R. Ford, which is moving closer to Venezuela. Maduro criticized the movement of the carrier as an attempt by the U. S government to fabricate “a new eternal war” against his country. U. S. President Donald Trump has accused Maduro, without providing evidence, of being the leader of the organized crime gang Tren de Aragua. Government officials from the twin-island nation and the U. S. said the massive warship will remain in Trinidad until Thursday so both countries can carry out training exercises. A senior military official in Trinidad and Tobago told The Associated Press that the move was only recently scheduled. The official spoke under condition of anonymity due to lack of authorization to discuss the matter publicly. Kamla Persad-Bissessar, the prime minister of Trinidad and Tobago, has been a vocal supporter of the U. S. military presence and the deadly strikes on suspected drug boats in waters off Venezuela. U. S. Embassy Chargé d’Affaires Jenifer Neidhart de Ortiz said in a statement that the exercises seek to “address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts.” The visit comes one week after the U. S. Embassy in Trinidad and Tobago warned Americans to stay away from U. S. government facilities there. Local authorities said a reported threat against Americans prompted the warning. Many people in Trinidad and Tobago criticize the warship’s docking in town. At a recent demonstration outside the U. S. Embassy, David Abdulah, the leader of the Movement for Social Justice political party, said Trinidad and Tobago should not have allowed the warship into its waters. “This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there’s a threat of war,” said Abdulah, who is also the leader of the Movement for Social Justice political party. “That’s an abomination.” Caricom, a regional trade bloc made up of 15 Caribbean countries, has called for dialogue. Trinidad and Tobago is a member of the group, but Persad-Bissessar has said the region is not a zone of peace, citing the number of murders and other violent crimes.",
            "media_url": "https://www.chicagotribune.com/wp-content/uploads/2025/10/Trinidad_Tobago_US_Ship_26129-1.jpg?w=1400px&strip=all",
            "media_type": "image/jpeg",
            "media_description": "The USS Gravely destroyer arrives to dock for military exercises in Port-of-Spain, Trinidad and Tobago, Sunday, Oct. 26, 2025. (AP Photo/Robert Taylor)",
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.047,
                "neg": 0.116,
                "neu": 0.836
            },
            "source": {
                "id": "chicago-tribune",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 8.0,
                "type": "newspaper"
            }
        },
        {
            "id": "2f1023a8-bc1f-4ab5-8ad0-7d26fdf6b780",
            "title": "Packers vs. Steelers prediction: Week 8 ‘Sunday Night Football’ picks, odds, props",
            "source_title": "New York Post",
            "source_link": "https://nypost.com",
            "article_link": "https://nypost.com/2025/10/26/betting/packers-vs-steelers-prediction-week-8-picks-odds-props-for-snf/",
            "keywords": [
                "aaron rodgers",
                "rodgers",
                "interceptions",
                "knowledgeable",
                "second-fewest",
                "trust new york post betting mike turay",
                "long-awaited matchup between",
                "pass-catchers in receptions"
            ],
            "topics": [
                "sports"
            ],
            "description": "Packers vs. Steelers prediction: Week 8 ‘Sunday Night Football’ picks, odds, props",
            "pub_date": "2025-10-26T19:00:00",
            "creator": "Mike Turay",
            "content": "The long-awaited matchup between Aaron Rodgers and the Packers has finally arrived. Rodgers’ former mentee, Jordan Love, leads the NFC-leading Packers (4-1-1) into Acrisure Stadium for a “Sunday Night Football” showdown against the Steelers (4-2). Green Bay is a 3-point favorite, with the over/under checking in at 45. 5 total points, per DraftKings. This will be an entertaining nightcap to Sunday’s slate, as the Packers’ stout defense, led by Micah Parsons, looks to spoil Rodgers’ reunion with his NFC North faithful. Packers vs. Steelers odds, prediction The turnover battle will be key in this one, as the Packers enter Week 8 tied for the second-fewest giveaways in the NFL, with only three (two interceptions, one fumble) in total. On the other hand, Mike Tomlin’s defense has forced 10 turnovers (five interceptions, five fumbles) on the year, tied for fourth in the league. Despite this high amount, the Steelers have struggled to contain offenses in the passing game, particularly tight ends. Pittsburgh ranks second in the NFL in passing yards allowed per game, surrendering 258. 8 to opposing quarterbacks. In addition, tight ends have averaged 67. 7 receiving yards per contest and have scored in four of six games against Pittsburgh’s defense, per CBS Sports. Cue Love and a Packers offense that has scored 27-plus in five of six games. Although there is no definitive wide receiver one for Green Bay, Romeo Doubs leads the Packers’ pass-catchers in receptions (24) on the season, but right behind him is third-year tight end Tucker Kraft (23). The South Dakota State product has racked up a team-high 326 receiving yards and four touchdowns on the season. Last week, Kraft caught five receptions for 58 yards and a touchdown against the Cardinals, including a clutch 15-yard connection with Love on fourth down, which led to the Josh Jacobs go-ahead score. Betting on the NFL? Read our expert guide on how to bet on the NFL Check out the best NFL betting sites Get the BetMGM Bonus Code Matt LaFleur is sure to scheme up against a suspect Steelers’ secondary. In honor of National Tight Ends Day, I’m confident Kraft will have yet another productive outing and pace the Packers’ receivers. His line of over/under 51. 5 receiving yards falls slightly lower than his season average of 54. 3 per game. I see value in taking the over. I’m rolling with Kraft and Love to connect on all cylinders for this primetime clash. The play: Tucker Kraft Over 51. 5 receiving yards (-114, DraftKings) Why Trust New York Post Betting Mike Turay is a sports journalist and editor who closely follows the NBA, NFL, college sports and UFC. He has demonstrated expertise in both NBA and NFL player prop bets for nearly three years. Mike is also highly knowledgeable about the sportsbook offer landscape, frequently trying and reviewing the latest apps and sites.",
            "media_url": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F8-throws-pass-warmups-game-113601169.jpg?quality%3D90%26strip%3Dall",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://nypost.com/wp-content%2Fuploads%2Fsites%2F2%2F2025%2F10%2F8-throws-pass-warmups-game-113601169.jpg?quality%3D90%26",
            "language": "en",
            "sentiment": {
                "pos": 0.122,
                "neg": 0.036,
                "neu": 0.842
            },
            "source": {
                "id": "new-york-post",
                "country": "US",
                "political_leaning": "center_right",
                "reliability_score": 6.0,
                "type": "newspaper"
            }
        }
    ]
}