{
    "next_cursor": "MC4wLDE3NjE1MDM2NDMwMDAsMjU0MjgyMjEy",
    "total_results": 2640,
    "per_page": 50,
    "data": [
        {
            "id": "527f2cd3-3f74-43ce-96cc-a5e5720ebc13",
            "title": "Strictly viewers ‘devastated’ over ‘biggest surprise’ elimination of series as Jimmy Floyd Hasselbaink leaves show",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.the-independent.com/arts-entertainment/tv/news/jimmy-floyd-hasselbaink-strictly-viewers-b2852475.html",
            "keywords": [
                "jimmy floyd hasselbaink",
                "lauren oakley",
                "professional",
                "disappointed",
                "hasselbaink",
                "professional partner lauren",
                "professional dancing living",
                "prematurely is devastating"
            ],
            "topics": [
                "entertainment",
                "media",
                "sports"
            ],
            "description": "Strictly viewers ‘devastated’ over ‘biggest surprise’ elimination of series as Jimmy Floyd Hasselbaink leaves show",
            "pub_date": "2025-10-26T21:00:49",
            "creator": "Ellie Harrison",
            "content": "Strictly viewers have said they are “devastated” after former Chelsea striker Jimmy Floyd Hasselbaink became the fourth celebrity to be eliminated from the 2025 series tonight. The Dutch sportsman, 53, and his professional partner Lauren Oakley were booted out of the competition on Sunday’s results show (26 October), after finding themselves in the bottom two with West End star Amber Davies and her partner Nikita Kuzmin. In the dance off, Hasselbaink and Oakley performed their American Smooth to “Purple Rain” by Prince, and Davies and Kuzmin danced the Cha Cha Cha to “Break Free” by Ariana Grande. Ultimately, the judges decided to save Davies and Kuzmin. Hasselbaink’s early departure has come as a shock to viewers, given that he received his personal best score of 30 on Saturday’s episode (placing sixth on the leaderboard), and hadn’t appeared in the bottom two during the first weeks of the competition. “Jimmy is what Strictly is meant to be about,” wrote one disappointed fan on X. “A celebrity with little or no professional dancing living in the moment and enjoying the competition. Such a shame Jimmy and Lauren were eliminated this early as they were so good .” Another added: “I think if this weeks #strictly dance off has taught us anything, it’s VOTE FOR YOUR FAVOURITE, or the BETTER DANCERS of the night. NOT who people encourage you to vote for. Because WTF is this dance off? NEITHER couple deserved to be there!!!” A third said: “Jimmy and Lauren have been improving every single week and he's been the biggest suprise of the series for me. He shouldn't be in the dance off.” “I was genuinely excited to see where Jimmy could go on his Strictly journey,” shared a fourth. “To have it end so prematurely is devastating. I think there was a possibility he could get to QF, SF or even the final. He had so much growth still in him. So angry. Robbed.” The remaining 10 couples will return to the ballroom for next week’s Halloween special, on Saturday 1 November at 6. 35pm, with the results show on Sunday 2 November at 7. 15pm.",
            "media_url": "https://static.independent.co.uk/2025/10/26/13/54/540130.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "BBC",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.089,
                "neg": 0.068,
                "neu": 0.843
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "c8f7f0a2-f88a-4e5a-9ede-92896b0072d3",
            "title": "James Cook runs for 216 yards and 2 TDs, Allen accounts for 3 TDs as Bills rout Panthers 40-9",
            "source_title": "ABC11",
            "source_link": "https://abc11.com",
            "article_link": "https://abc11.com/post/james-cook-runs-216-yards-2-tds-allen-accounts-3-bills-rout-panthers-40-9/18074499/",
            "keywords": [
                "james cook",
                "josh allen",
                "interception",
                "established",
                "quarterback",
                "career rushing touchdowns",
                "three-game winning streak",
                "joining cookie gilchrist"
            ],
            "topics": [
                "sports",
                "football",
                "entertainment"
            ],
            "description": "James Cook runs for 216 yards and 2 TDs, Allen accounts for 3 TDs as Bills rout Panthers 40-9",
            "pub_date": "2025-10-26T21:00:15",
            "creator": "AP",
            "content": "CHARLOTTE, N. C James Cook ran for a career-high 216 yards and two touchdowns, Josh Allen accounted for three scores and the Buffalo Bills returned from their bye with a resounding 40-9 win over the Carolina Panthers on Sunday. Allen improved to 8-0 following the bye week and established an NFL record by becoming the first player to run and throw for a touchdown in 46 games, breaking the mark previously held by former Panthers QB Cam Newton. Allen's 77 career rushing touchdowns (including playoff games) tied Newton for the most all-time. Allen finished 12 of 19 for 163 yards for the Bills (5-2), including a 54-yard toss to Khalil Shakir, and ran for two short touchdowns. Cook had touchdown runs of 64 and 21 yards, becoming the third Bills running back to run for 200 yards and two touchdowns, joining Cookie Gilchrist and O. J. Simpson. Cook, who didn't play in the fourth quarter, did it against a defense that had allowed just 131 yards on the ground over the past three weeks. Buffalo's defense sacked Andy Dalton seven times and forced the veteran quarterback into three turnovers to open a 40-3 lead in the third quarter. Dalton, who got the start for the injured Bryce Young, finished 16 of 24 for 175 yards with two fumbles and one interception as the Panthers' three-game winning streak came to a screeching halt. Buffalo built a 19-3 halftime lead behind a career-high 153 yards rushing from Cook the most in the first half by a running back since his brother Dalvin Cook ran for 153 in 2021 and three huge mistakes by Dalton. Dalton's first miscue came with the Panthers deep in Buffalo territory when he to scramble and was stripped from behind by Greg Rousseau, resulting in Christian Benford's recovery. The Bills turned that into Matt Prater's field goal. A short while later Dalton threw a ill-advised screen pass directly into the arms of Bills defensive end A. J. Espenesa, who returned it to Carolina 1, setting up a QB sneak for a score by Allen. With the Panthers (4-4) threatening to score a touchdown in the waning seconds of the first half, Dalton took a sack on third down. Without any timeouts, the Panthers rushed their field goal unit on to the field but kicker Ryan Fitzgerald wasn't able to convert a rushed kick from 32 yards and the Panthers went into the locker room down by 16. The Bills extended the lead to 26-3 when Khalil Shakir turned a short pass from Allen into a 54-yard TD. Khalil finished with six catches for 88 yards. Dalton had another fumble that led to Allen's second touchdown run of the game and fell to 1-6 as a starter for the Panthers over the past three seasons.",
            "media_url": "https://cdn.abcotvs.com/dip/images/18074492_billsbeatpanthers.jpg?w=1600",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.026,
                "neg": 0.021,
                "neu": 0.953
            },
            "source": {
                "id": "abc11",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "8cc7d326-6f2e-4b2f-9beb-dbff487b7c83",
            "title": "How China Trains Your Robot Dog",
            "source_title": "Bloomberg",
            "source_link": "https://bloomberg.com",
            "article_link": "https://www.bloomberg.com/opinion/articles/2025-10-26/how-china-trains-your-robot-dog",
            "keywords": [
                "robot dog",
                "humanoid robot",
                "china",
                "embodied ai",
                "quadruped"
            ],
            "topics": [
                "technology",
                "science"
            ],
            "description": "Humanoid robots have been getting a lot of buzz this year. But quadrupeds &mdash; the mechanical “dogs” &mdash; are emerging as the true proving ground for embodied artificial intelligence.",
            "pub_date": "2025-10-26T21:00:08",
            "creator": "Catherine Thorbecke",
            "content": null,
            "media_url": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/id.JjBESHX4g/v1/1200x-1.jpg",
            "media_type": "image/jpeg",
            "media_description": "Police patrol with robot dogs during the Jiangsu City Football League match between Wuxi and Huai'an in Wuxi, in China's eastern Jiangsu province on July 20, 2025. (Photo by AFP) / China OUT (Photo by STR/AFP via Getty Images)",
            "media_credit": null,
            "media_thumbnail": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/id.JjBESHX4g/v1/1200x-1.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "bloomberg",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "65b6c85f-0ccd-4d23-8d11-08476c211e33",
            "title": "Saquon Barkley leads Philadelphia Eagles to rout of New York Giants",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/new-york-giants-josh-allen-james-cook-philadelphia-eagles-buffalo-bills-b2852587.html",
            "keywords": [
                "saquon",
                "barkley",
                "serious-looking",
                "complications",
                "philadelphia",
                "serious-looking ankle injury",
                "another touchdown through",
                "complications from kidney"
            ],
            "topics": [
                "sports",
                "football"
            ],
            "description": "Elsewhere, James Cook ran for 216 yards and two touchdowns as the Buffalo Bills hammered the Carolina Panthers.",
            "pub_date": "2025-10-26T20:50:48",
            "creator": "Pa Sport Staff",
            "content": "Saquon Barkley scored two touchdowns as the Philadelphia Eagles beat divisional rivals the New York Giants 38-20. However, the game was overshadowed by a serious-looking ankle injury suffered by Giants rookie Cam Skattebo. The running back grabbed a touchdown in the first quarter but was carried off in some distress in the second. Barkley ran for 150 yards and a score against his former team, adding 24 yards and another touchdown through the air, before an injury of his own allowed back-up Tank Bigsby to also top 100 yards. Jalen Hurts threw two more touchdowns to tight end Dallas Goedert and one to Jahan Dotson. Derrick Henry grabbed two rushing touchdowns as the Baltimore Ravens ripped up the form book with a 30-16 win against the Chicago Bears. The Ravens were on a four-game losing streak while the Bears, by contrast, had won their last four. James Cook capped a 216-yard running display with two touchdowns as the Buffalo Bills thumped the Carolina Panthers 40-9. Quarterback Josh Allen also ran in two scores and threw another to Khalil Shakir. The New York Jets won their first game of the season after running back Breece Hall threw to tight end Mason Taylor in the end zone to snatch a 39-38 victory at the Cincinnati Bengals. It came on the day former Jets centre Nick Mangold’s death was announced, at the age of only 41, due to complications from kidney disease. Tearful former Jets coach Rex Ryan said on ESPN’s pre-game show: “It’s just brutal. Such a great young man. He was awesome, and just way too young. I feel so bad for his wife and family.” The Houston Texans pulled off a surprise by beating the in-form San Francisco 49ers 26-15, with quarterback CJ Stroud throwing for 318 yards and two touchdowns. The Miami Dolphins ended a three-game losing run with a commanding 34-10 win at the Atlanta Falcons. Star of the show was Tua Tagovailoa with four touchdown passes, while the Falcons have now lost back-to-back games. The New England Patriots made it five wins in a row after a comfortable 32-13 success over the Cleveland Browns.",
            "media_url": "https://static.independent.co.uk/2025/10/26/21/26-44e94fe93c6546339be9a4f4d833fcc0.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "AP",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.122,
                "neg": 0.113,
                "neu": 0.764
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "f306b321-a420-4253-8dfc-6660ae7393e3",
            "title": "AP poll: Longhorns rise after comeback win vs. Mississippi State",
            "source_title": "KXAN Austin",
            "source_link": "https://kxan.com",
            "article_link": "https://www.kxan.com/sports-general/horns-report/ap-poll-longhorns-rise-after-comeback-win-vs-mississippi-state/",
            "keywords": [
                "texas longhorns",
                "ap poll",
                "college football",
                "southeastern conference",
                "win",
                "ranking"
            ],
            "topics": [
                "sports",
                "college",
                "ranking",
                "entertainment"
            ],
            "description": "AUSTIN (KXAN) — Texas moved up two spots to No. 20 in the latest Associated Press rankings following a dramatic come-from-behind victory 45-38 over Mississippi State on Saturday. The new AP Top 25 was released Sunday, with Texas as the lowest-ranked Southeastern Conference team. The Longhorns are one of eight 2-loss teams in the rankings. [...]",
            "pub_date": "2025-10-26T20:29:06",
            "creator": "Billy Gates",
            "content": null,
            "media_url": "https://www.kxan.com/wp-content/uploads/sites/40/2025/10/AP25298799828013.jpg?w=900",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "kxan-austin",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "08e86f83-3b32-4d8d-9042-598bdf614c94",
            "title": "NFL roundup: Jets snatch first win of season; Giants’ Skattebo suffers gruesome ankle injury",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/2025/oct/26/nfl-scores-sunday-football",
            "keywords": [
                "bengals breece hall",
                "mason taylor",
                "philadelphia",
                "double-digit",
                "quarterback",
                "with double-digit receptions",
                "two second-half touchdowns",
                "philadelphia eagles saquon"
            ],
            "topics": [
                "sports",
                "entertainment"
            ],
            "description": "Jets come back from 14-point deficit in fourth quarterCostly injuries blight Eagles’ win over GiantsBreece Hall rushed for two second-half touchdowns and threw a four-yard TD pass to Mason Taylor with 1: 54 left, helping the New York Jets edge the Cincinnati Bengals for their first win of the season.",
            "pub_date": "2025-10-26T20:27:00",
            "creator": "Agencies",
            "content": "New York Jets 39-38 Cincinnati Bengals Breece Hall rushed for two second-half touchdowns and threw a four-yard TD pass to Mason Taylor with 1: 54 left, helping the New York Jets edge the Cincinnati Bengals for their first win of the season. Justin Fields was 21 for 32 for 244 yards and a touchdown in his first game since Jets owner Woody Johnson sharply criticized his team’s quarterback play during their winless start. Hall finished with 18 carries for 133 yards. The Jets (1-7), who trailed 31-16 after three quarters, rolled to 502 yards of offense in their highest scoring game of the season, including a season-high 254 on the ground. Joe Flacco passed for two touchdowns and rushed for a one-yard score, but the Bengals (3-5) lost for the fifth time in six games. Ja’Marr Chase had 12 catches for 91 yards in his third consecutive game with double-digit receptions. New York Giants 20-38 Philadelphia Eagles Saquon Barkley ran for a 65-yard score on his first carry of the game and topped 100 yards rushing for the first time this season in the Philadelphia Eagles’ victory over the New York Giants (2-6). Barkley finished with 150 yards rushing and caught one of Jalen Hurts’ four touchdown passes before he left the game with a groin injury. The Eagles (6-2) evened the season series against their division rivals. The Giants’ run at their first season sweep of the Eagles since 2007 and first win at Philadelphia since 2013 suffered a serious blow when rookie Cam Skattebo suffered a dislocated ankle and was taken to a hospital for further evaluation. Skattebo was carted off the field after he took a hard hit over the middle and went down. His foot appeared to twist backward, and players from both teams huddled around the standout running back until he was taken off the field. Chicago Bears 16-30 Baltimore Ravens Derrick Henry ran for two touchdowns, Tyler Huntley made a big third-down throw late in the fourth quarter and the Baltimore Ravens finally won without Lamar Jackson. The Ravens snapped a four-game skid and ended Chicago’s four-game winning streak. The Bears (4-3) dominated the first quarter but managed only two field goals in that period and didn’t score again until the fourth. Although Jackson returned to practice this week, he was ruled out Saturday for a third straight game because of a hamstring injury. The Ravens (2-5) had lost 11 of their previous 13 when their star quarterback didn’t play. Buffalo Bills 40-9 Carolina Panthers James Cook ran for a career-high 216 yards and two touchdowns, Josh Allen accounted for three touchdowns and the Buffalo Bills (5-2) returned from their bye with a resounding win over the Carolina Panthers (4-4). Allen improved to 8-0 following the bye week and established an NFL record by becoming the first player to run and throw for a touchdown in 46 games, breaking the mark previously held by former Panthers QB Cam Newton. Allen’s 77 career rushing touchdowns (including playoff games) tied Newton for the most all-time. Cook had touchdown runs of 64 and 21 yards. Cleveland Browns 13-32 New England Patriots Drake Maye passed for three touchdowns as the New England Patriots extended their winning streak to five games by beating the Cleveland Browns. Maye completed 18 of his 24 pass attempts for 282 yards. He was intercepted once. Each of his three TD passes came in the third quarter. The Patriots (6-2) were helped by three field goals from Andy Borregales. Cleveland (2-6) defensive end Myles Garrett recorded a franchise-record five sacks in the loss. Garrett passed Reggie White and set the NFL record for career sacks by a player under the age of 30 with his first sack in the game. Garrett has 10 sacks this season and 112. 5 for his career. Cleveland’s Dillon Gabriel was 21 of 35 for 156 yards. He threw two touchdowns and was intercepted twice. Miami Dolphins 34-10 Atlanta Falcons Tua Tagovailoa threw a season-high four touchdown passes and the Miami Dolphins ended their three-game losing streak by dominating the short-handed Atlanta Falcons. The Dolphins (2-6) held the Falcons (3-4) to 213 yards. Tagovailoa completed 20 of 26 passes for 205 yards with scoring passes to De’Von Achane, Malik Washington, Jaylen Waddle and Ollie Gordon II. The Falcons were without quarterback Michael Penix Jr, top wide receiver Drake London and sacks leader Zach Harrison, among others, due to injuries. Atlanta veteran quarterback Kirk Cousins made his first start of the season. Bijan Robinson was held to 25 rushing yards. San Francisco 49ers 15-26 Houston Texans CJ Stroud threw for a season-high 318 yards with two touchdowns and the Houston Texans got off to a quick start and held on for victory over the San Francisco 49ers. Stroud completed passes to nine different players with star receiver Nico Collins out after sustaining a concussion Monday night. Xavier Hutchinson led the group with 69 yards receiving and a score to help the 3-4 Texans bounce back after a loss to Seattle. Mac Jones had trouble getting San Francisco’s offense going. He threw for 193 yards and two touchdowns in his fourth straight game and sixth this season filling in for the injured Brock Purdy. The Niners fell to 5-3.",
            "media_url": "https://i.guim.co.uk/img/media/86dde75bc79b0941bc6903abb2604e68a594590a/200_0_3105_2484/master/3105.jpg?width=140&quality=85&auto=format&fit=max&s=2967e68fbc6b77f16c6d367a6aa6ee9c",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Joshua A Bickel/AP",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.066,
                "neg": 0.053,
                "neu": 0.881
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0caef111-0c4d-4a00-a04c-0f0f774f1956",
            "title": "Burevestnik Nuclear Missile Tests Successful, Russia Says",
            "source_title": "The New York Times",
            "source_link": "https://www.nytimes.com",
            "article_link": "https://www.nytimes.com/2025/10/26/world/europe/russia-burevestnik-missile.html",
            "keywords": [
                "Burevestnik",
                "russia",
                "nuclear missile",
                "airframe",
                "power source"
            ],
            "topics": [
                "technology",
                "military",
                "defense"
            ],
            "description": "Because of its power source, the Burevestnik can remain airborne far longer than other nuclear-armed missiles.",
            "pub_date": "2025-10-26T20:22:44",
            "creator": "Valerie Hopkins",
            "content": null,
            "media_url": "https://static01.nyt.com/images/2025/10/26/multimedia/26int-russia-missile-chgw/26int-russia-missile-chgw-mediumSquareAt3X.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "the-new-york-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "3900bd10-8038-417b-9804-b20b9aff0498",
            "title": "Tua Tagovailoa throws 4 TD passes as Dolphins overwhelm Falcons 34-10 to end 3-game losing streak",
            "source_title": "WSVN 7News",
            "source_link": "https://wsvn.com",
            "article_link": "https://wsvn.com/sports/miami-dolphins/tua-tagovailoa-throws-4-td-passes-as-dolphins-overwhelm-falcons-34-10-to-end-3-game-losing-streak/",
            "keywords": [
                "tua tagovailoa",
                "atlanta falcons",
                "interceptions",
                "redistributed",
                "questionable",
                "short-handed atlanta falcons",
                "atlanta veteran quarterback",
                "without quarterback michael"
            ],
            "topics": [
                "sports",
                "football"
            ],
            "description": "ATLANTA (AP) Tua Tagovailoa threw a season-high four touchdown passes and the Miami Dolphins ended their three-game losing streak by dominating the short-handed Atlanta.",
            "pub_date": "2025-10-26T20:18:31",
            "creator": "Steven Cejas",
            "content": "ATLANTA (AP) Tua Tagovailoa threw a season-high four touchdown passes and the Miami Dolphins ended their three-game losing streak by dominating the short-handed Atlanta Falcons 34-10 on Sunday. The Dolphins (2-6) outgained the Falcons (3-4) 338-213. Tagovailoa, who threw three interceptions in each of his last two games, was added to the injury report before the game with an illness but showed no signs of being limited. Tagovailoa completed 20 of 26 passes for 205 yards with scoring passes to De’Von Achane, Malik Washington, Jaylen Waddle and Ollie Gordon II. The Falcons were without quarterback Michael Penix Jr., top wide receiver Drake London and sacks leader Zach Harrison, among others, due to injuries. Atlanta veteran quarterback Kirk Cousins made his first start since a Dec. 16, 2024, win at Las Vegas. Cousins, who appeared in only one game this season in a backup role, couldn’t rescue the offense against a Miami defense determined to contain running back Bijan Robinson. The Dolphins kept the Falcons out of the end zone until Tyler Allgeier’s 6-yard scoring run with 5: 01 remaining. Robinson was held to 25 rushing yards and lost a fumble inside the Miami 20 in the third quarter. The crucial turnover came on a rare strong possession for Atlanta, which was stopped without a first down on four of its first five possessions. Dolphins coach Mike McDaniel was rewarded for sticking with Tagovailoa this week after the quarterback was pulled in the fourth quarter of last week’s 31-6 loss at Cleveland. Tagovailoa entered Sunday’s game tied for the NFL lead with 10 interceptions. The Dolphins had no turnovers against the Falcons. Penix was held out with a bone bruise on his left knee after being listed as questionable. Injuries Dolphins: CB Storm Duck left the game with a knee injury. WR Dee Eskridge (shoulder) and S Ashtyn Davis (quad) were listed as questionable to return after leaving in the first half. Falcons: S Jessie Bates III was ruled out after leaving the game with an ankle injury in the third quarter. London was inactive after he was added to the injury report on Saturday with a hip injury. Harrison (knee), rookie edge rusher Jalon Walker (groin) and cornerback Billy Bowman Jr. (hamstring) also did not play. The team placed inside linebacker Divine Deablo (forearm) on the reserve/injured list on Saturday. Up next Dolphins: Miami has a short rest before playing a home game against Baltimore on Thursday night. Falcons: Atlanta visits New England next Sunday. Copyright.",
            "media_url": "https://wsvn.com/wp-content/uploads/sites/2/2025/10/251015-Tua-Tagovailoa-apologizes.jpg?quality=60&strip=color",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://wsvn.com/wp-content/uploads/sites/2/2025/10/251015-Tua-Tagovailoa-apologizes.jpg?quality=60&strip=color",
            "language": "en",
            "sentiment": {
                "pos": 0.069,
                "neg": 0.103,
                "neu": 0.828
            },
            "source": {
                "id": "wsvn-7news",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "233da779-cc6d-4d06-9a39-1992d693c420",
            "title": "Two suspects arrested in connection to Louvre precious jewels heist",
            "source_title": "One America News Network",
            "source_link": "https://www.oann.com",
            "article_link": "https://www.oann.com/newsroom/two-suspects-arrested-in-connection-to-louvre-precious-jewels-heist/",
            "keywords": [
                "katherine mosack",
                "louvre museum",
                "seine-saint-denis",
                "high-visibility",
                "jewel-encrusted",
                "and from seine-saint-denis",
                "interior minister laurent",
                "large jewel-encrusted bow"
            ],
            "topics": [
                "crime",
                "theft",
                "museum"
            ],
            "description": "Two suspects have been taken into custody following a daylight theft of crown jewels valued at €88 million (over $102 million) from the famous Louvre Museum in Paris, France.",
            "pub_date": "2025-10-26T20:16:33",
            "creator": "Katherine Mosack",
            "content": "OAN Staff Katherine Mosack 1: 15 PM Sunday, October 26, 2025 Two suspects have been taken into custody following a daylight theft of crown jewels valued at €88 million (over $102 million) from the famous Louvre Museum in Paris, France. The theft occurred last Sunday at the Louvre, the most visited museum, where four thieves used power tools and a mechanical lift to break into the Galerie d’Apollon (Gallery of Apollo) shortly after the museum opened. They threatened the guards, who evacuated, and shattered two glass display cases holding precious jewels. The thieves were only inside for about four minutes before escaping on scooters. The museum director told French senators that the only camera monitoring the wall of the Louvre where they broke in was pointing away from the balcony that led to the Gallery of Apollo. France’s justice minister said that security protocols “failed,” contributing to a “terrible image” for the country. The French media announced the arrests of two suspects, which the Paris prosecutor’s office said took place on Saturday evening. Police sources said that one of the suspects was at the airport on his way to Algeria, while the other was headed to Mali. Both men, in their thirties and from Seine-Saint-Denis, face charges of organized gang robbery and conspiracy to commit a crime. Police suggested they were professionals who acted on commission. More than 150 samples taken from DNA evidence left at the scene, such as gloves and a high-visibility jacket, led to the identification of the two alleged thieves. The items stolen included a tiara, a 94-diamond brooch and a large jewel-encrusted bow that belonged to Napoleon III’s wife, Empress Eugenie. Also taken was a set of a crown, necklace and pair of earrings made of sapphires set in white gold, which were worn by Queen Marie-Amelie. Napoleon’s second wife, Marie Louise, also had an emerald necklace with matching earrings that were reportedly stolen. Empress Eugenie’s emerald and diamond crown was found damaged outside the museum. Laurence des Cars, the president and director of the Louvre, said it had been “crushed.” “It appears that repairing it will be delicate but possible,” des Cars said. French Interior Minister Laurent Nunez praised “the investigators who have worked tirelessly, just as I asked them to, and who have always had my full confidence.” The Louvre reopened earlier this week, with tourists drawn to the now-famous balcony where the heist took place. Stay informed! Receive breaking news blasts directly to your inbox for free. Subscribe here. What do YOU think? Click here to jump to the comments! Sponsored Content Below Share this post!.",
            "media_url": "https://www.oann.com/wp-content/uploads/2025/10/GettyImages-2242193471-e1761509705916.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.064,
                "neg": 0.075,
                "neu": 0.862
            },
            "source": {
                "id": "one-america-news-network",
                "country": "US",
                "political_leaning": "far_right",
                "reliability_score": 4.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "eb9e06da-ac69-4410-81fd-05d827477d10",
            "title": "State Department thought Putin had no interest in ending the war in Ukraine: report",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-putin-state-department-cia-russia-b2852567.html",
            "keywords": [
                "vladimir putin",
                "trump",
                "decision-makers",
                "administration",
                "russia-eurasia",
                "prize-worthy peacemaker president",
                "administration were reportedly",
                "drawing increasing irritation"
            ],
            "topics": [
                "politics",
                "international",
                "government"
            ],
            "description": "Trump has grown vocally frustrated with Putin in recent days, launching sanctions against Russian oil producers and calling off a potential summit.",
            "pub_date": "2025-10-26T20:02:18",
            "creator": "Josh Marcus",
            "content": "Intelligence analysts inside the Trump administration were reportedly divided over whether Vladimir Putin was sincerely interested in negotiating an end to the Ukraine war. Ahead of a controversial August summit in Alaska between Trump and Putin, the State Department’s internal intelligence agency took a more dim view of the question than other sectors of the administration, warning the president of Putin’s reluctance to end the conflict in assessments and presidential briefings, The Wall Street Journal reports. “We kept standing firm,” John Williams, who resigned earlier this year from his post as director of the State Department’s Russia-Eurasia analysis in the intelligence bureau, told the paper. “We didn’t see that [Putin] had incentive to negotiate an end to the war.” “In the Intelligence Community, differing perspectives aren’t just normal-they’re necessary,” the office of the administration’s Director of National Intelligence said in a statement in response to the reporting. “That debate is how we ensure our decision-makers have the most accurate picture possible to protect the safety and freedom of the American people.” In the end, the August summit yielded no firm agreement, and progress on ending the war hasn’t moved much, drawing increasing irritation from Trump as he continues to publicly frame himself as a Nobel Prize-worthy peacemaker president. This month, hopes inside the White House briefly appeared high that some progress would be made, with the president describing a “productive” call with Putin and claiming he would sit down again with the Russian leader for talks in Budapest in November. The Trump administration has since called off those plans, claiming it does not want to have another “wasted meeting” with Putin. Trump then hit Russia with its toughest round of sanctions yet, targeting two top oil producers. Announcing the move, the president said he “just felt it was time” for action to push Russia towards a resolution. As the president headed to Asia to kick off this weekend’s diplomatic tour, he again turned the screws on Putin, claiming no further talks would take place until a deal seemed reachable.",
            "media_url": "https://static.independent.co.uk/2025/10/16/18/Trump_Russia_Ukraine_War_18340.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Copyright 2025 The Associated Press. All rights reserved",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.136,
                "neg": 0.08,
                "neu": 0.783
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "90846d19-7f9c-4bb5-aaaf-dc1f4c2c6164",
            "title": "Giants rookie running back Cam Skattebo suffers dislocated right ankle against Eagles",
            "source_title": "ABC7",
            "source_link": "https://abc7.com",
            "article_link": "https://abc7.com/post/giants-rookie-running-back-cam-skattebo-suffers-dislocated-ankle-eagles/18074338/",
            "keywords": [
                "cam skattebo",
                "skattebo",
                "philadelphia ",
                "appreciation",
                "organization",
                "rushing touchdowns against",
                "game against philadelphia",
                "against philadelphia with"
            ],
            "topics": [
                "sports"
            ],
            "description": "New York Giants running back Cam Skattebo left Sunday's game against Philadelphia with a dislocated right ankle that could cost him the rest of his rookie season.",
            "pub_date": "2025-10-26T20:01:18",
            "creator": "AP",
            "content": "PHILADELPHIA -- New York Giants running back Cam Skattebo left Sunday's game against Philadelphia with a dislocated right ankle that could cost him the rest of his rookie season. Skattebo needed to be carted off the field and was taken to a local hospital for further evaluation after he took a hard hit over the middle on a pass attempt in the second quarter. He went down in a heap and smacked his helmet in pain. Skattebo's foot appeared to be twisted as both Giants and Eagles players huddled around the breakout rookie standout until he could be helped off the field. The video featured in the media player above is the ABC7 Los Angeles 24/7 streaming channel The 23-year-old Skattebo, a fourth-round pick out of Arizona State in the 2025 draft, already had an air cast on his lower right leg when he was driven off the field. He raised his right arm in appreciation of the ovation from the Eagles crowd. He was ruled out for the rest of the game. He had three rushing touchdowns against the Eagles earlier this month and had already caught an 18-yard touchdown pass from Jaxson Dart in Sunday's game. Giants players were distraught at the gruesome sight of Skattebo's ankle bent the other way and many turned away from the scene. Dart turned away and barked profanities before he took a knee and buried his head in his hand. The Giants entered Sunday just 2-5 but Dart and Skattebo's play had infused the organization with needed optimism. Skattebo ran for three touchdowns, Dart had one rushing and another passing and the Giants beat the Eagles 34-17 earlier this month. Skattebo entered Sunday with 398 yards rushing and five touchdowns.",
            "media_url": "https://cdn.abcotvs.com/dip/images/18074359_102625-AP-cam-skattebo-injury-clean-TN-img.jpg?w=1600",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.041,
                "neg": 0.025,
                "neu": 0.934
            },
            "source": {
                "id": "abc7",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "ccfc1701-4857-420e-90e1-cba5a492fd9b",
            "title": "Thomas Frank plays down title hopes after Tottenham move third",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/thomas-frank-everton-david-moyes-arsenal-london-b2852575.html",
            "keywords": [
                "thomas frank",
                "pape sarr",
                "transformative",
                "responsibility",
                "uncomfortable",
                "goalkeeper guglielmo vicario",
                "top-four contenders chelsea",
                "without necessarily playing"
            ],
            "topics": [
                "football",
                "sports"
            ],
            "description": "Thomas Frank plays down title hopes after Tottenham move third",
            "pub_date": "2025-10-26T20:00:32",
            "creator": "Carl Markham",
            "content": "Tottenham head coach Thomas Frank does not consider his team to be title contenders despite a 3-0 victory at Everton lifting them into third. Two first-half headers from Micky van der Ven were followed by Pape Sarr also nodding home late on to make it 13 points from a possible 15 away from home. They sit just five points behind leaders and north London rivals Arsenal and November could be a transformative month for them as they face fellow top-four contenders Chelsea and Manchester United both below them in the table before heading to the Emirates Stadium. But when asked whether Spurs could enter the title race Frank said: “No, I think there are a few teams ahead of us.” However, if they can improve their home form while continuing to eke out wins on the road without necessarily playing well they could make life uncomfortable for their rivals. Van der Ven’s prowess at set-pieces will certainly help in that regard, as he took his tally to five for the season. “Top scorer? Not bad. I said you are a centre-back, you need to score more, and he attacked the ball and got in there where it hurts,” added Frank. “I think he is really growing and taking some big steps, taking more leadership, defending better and better, using his pace and more clever positions than at the start of the season.” Everton fans were hugely aggrieved Jake O’Brien’s potential equaliser was ruled out after VAR spotted Iliman Ndiaye and Jack Grealish in offside positions either side of goalkeeper Guglielmo Vicario but manager David Moyes had no complaints. “I think the goal we got chalked off for offside was the correct decision,” he said. “At the time from the touchline it looked okay but I have just looked at it and I can’t argue with it.” Everton conceded their first goals of the season from corners and that frustrated Moyes more than the performance. “We actually played well. We have been undone by set-pieces, we are not happy about it but the other parts of the game there were lots of good things,” he added. “The players will always take responsibility and I will, we have been very good at set-pieces in the main but Thomas’ teams have always been good. They got their head on them and we didn’t. “I am disappointed, I really am. There are a couple of things we could have done better.”.",
            "media_url": "https://static.independent.co.uk/2025/10/26/20/2f0663aa936a0d75eefe9deef2b8cc70Y29udGVudHNlYXJjaGFwaSwxNzYxNTk0ODEx-2.82164632.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.117,
                "neg": 0.079,
                "neu": 0.804
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0f2f2dd1-1b40-4bd5-8556-3d782a17bbb2",
            "title": "This Sleeping Retail Giant Has a ‘Conbini’ Killer",
            "source_title": "Bloomberg",
            "source_link": "https://bloomberg.com",
            "article_link": "https://www.bloomberg.com/opinion/articles/2025-10-26/japan-s-sleeping-retail-giant-aeon-has-a-conbini-killer",
            "keywords": [
                "conbini",
                "japan",
                "retail",
                "sleeping giant"
            ],
            "topics": [
                "business",
                "culture",
                "media"
            ],
            "description": "Everyone who comes to Japan inevitably falls in love with the conbini.",
            "pub_date": "2025-10-26T20:00:07",
            "creator": "Gearoid Reidy",
            "content": null,
            "media_url": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iVZzD9WMcf9k/v1/1200x-1.jpg",
            "media_type": "image/jpeg",
            "media_description": "The Aeon Co. logo is displayed on a shopping basket at the retailer's mall in the Long Bien district of Hanoi, Vietnam, on Thursday, July 21, 2016. With a young population, an expanding middle class and one of Southeast Asia's fastest-growing economies, Vietnam is an alluring market for Aeon. The reason: China is slowing and growth is flat-lining at home.",
            "media_credit": null,
            "media_thumbnail": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iVZzD9WMcf9k/v1/1200x-1.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "bloomberg",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "ea17df95-8b6a-48f7-bd9e-918822d34ac3",
            "title": "Why Micky van de Ven is the embodiment of Thomas Frank’s new Tottenham",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/micky-van-de-ven-tottenham-everton-goals-b2852572.html",
            "keywords": [
                "harry",
                "jimmy greaves",
                "training-ground",
                "distinguished",
                "compensating",
                "territory previously occupied",
                "training-ground work yielded",
                "dead-ball specialists their"
            ],
            "topics": [
                "sports"
            ],
            "description": "Everton 0-3 Tottenham Hotspur: Two headed goals by the flying Dutchman helped his side become the first visiting team to win in the Merseyside club's new stadium.",
            "pub_date": "2025-10-26T19:58:22",
            "creator": "Richard Jolly",
            "content": "Harry Kane and Jimmy Greaves, Gary Lineker and Gareth Bale, Chris Waddle and Glenn Hoddle, Jurgen Klinsmann and Paul Gascoigne. And now Micky van de Ven. The list of Tottenham’s top scorers in seasons is distinguished indeed but there is an anomaly at the moment, a Dutch defender in the territory previously occupied by Teddy Sheringham, Dimitar Berbatov, Robbie Keane, Clive Allen, Martin Chivers, Bobby Smith and Heung-Min Son. Van de Ven may be an intrepid interloper in the scoring charts, but he was also a fearless traveller: to the Hill Dickinson Stadium, as Tottenham became the first visitors to win, and to the Everton penalty box to score twice. The Dutchman surprised even himself. “It’s crazy, I never score two goals in one game,” he said. “It always goes through your head that I might get a hat-trick.” That may not be a phrase he has uttered before his brace, along with a Pape Matar Sarr clincher, earned a victory that made the Hill Dickinson look less like a fortress by the Mersey and Tottenham more like a Thomas Frank team. A triumph built on a clean sheet and two goals from corners? It was scarcely Angeball. But then Ange Postecoglou took Tottenham to 17th in the Premier League. These are early days, but his successor’s side are third. Postecoglou could seem to have disdain for set-pieces. Frank doesn’t. Brentford were such dead-ball specialists their set-piece coach became Frank’s replacement as manager. And Van de Ven may be the face of this Spurs. Promoted from the ranks, he is captaining them while Cristian Romero is out. Newly prolific, he is compensating for the absence of more obvious scorers like Dominic Solanke, Dejan Kulusevski and James Maddison; after only finding the net seven times in his club career, he now has five goals this campaign. Whereas Postecoglou’s teams were porous, Frank’s Spurs have a defensive record bettered only by Arsenal. It may help, too, that Van de Ven’s hamstrings are put under less stress, with Frank’s defensive line set deeper than Postecoglou’s. There was a pragmatic feel to this but pragmatism is no longer a dirty word for Tottenham. Their xG from open play was just 0. 78 but Romero’s understudy Kevin Danso amassed 18 clearances and, with his long throw, added to their set-piece armoury. “We have a clean-sheet mentality,” said Frank. It may be something he has brought. “The second half was a dogfight,” he added. It was earthy and gritty but Tottenham showed why they possess the Premier League’s only unbeaten record on the road. They may not have an excess of creativity at home but they were solid and streetwise and that can be a fine basis. “Set pieces are so crucial,” Frank said. “Right now, Arsenal is on track for the title from set pieces.” Spurs are on course for a fine season themselves and Daivd Moyes noted: “We don't concede a lot from corners and I have to praise Tottenham. Thomas Frank works a lot on it.” That training-ground work yielded two goals. Van de Ven’s first was a well-worked set-piece, the centre-back running from behind the far post to the goal-line, Rodrigo Bentancur circling around to appear on the turf he vacated and meeting Mohammed Kudus’ deep corner with a header across the box for the Dutchman to nod in. His second seemed simpler, Van de Ven just outjumping Jordan Pickford to head in Pedro Porro’s corner. “Micky again,” chorused the travelling fans. “At the start of the season, I said, ‘you are a centre back and you need to score more,’” said Frank. Van de Ven responded. “The way he attacked the ball and got in there where it hurts” impressed his manager. Perhaps at fault for Van de Ven’s second, Pickford went on to make a fine save from his former teammate Richarlison: Everton may have been relieved a player who tended to score on his returns to Goodison Park was only a substitute. Richarlison instead recorded an assist, setting up his fellow substitute Sarr. It was the cue for the Hill Dickinson to empty. Everton could reflect on two moments when it might have been different. Porro made a brilliant block on the goal-line in the third minute to thwart Jack Grealish. Everton celebrated an equaliser from another corner, Jake O’Brien heading in. But replays showed Iliman Ndiaye and Grealish offside and around Guglielmo Vicario. “I think it was the right decision,” said an admirably honest Moyes. Vicario, carrying on where he left off in Monaco, made a terrific save from James Garner and a still better one to repel Beto’s overhead kick. He did well to keep out Ndiaye’s deflected effort. Another shutout owed much to the goalkeeper. “He was man of the match in Monaco,” said Frank. “Micky was man of the match today. And we shouldn’t forget Kevin Danso, who has done very well to step in.” So has Frank since his appointment. The good news for Tottenham is they are third. The bad news, of course, is that Arsenal are first.",
            "media_url": "https://static.independent.co.uk/2025/10/26/18/59/Everton-v-Tottenham-Hotspur-Premier-League-tmu4ce1p.jpeg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.106,
                "neg": 0.039,
                "neu": 0.855
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "608baf89-60a6-4faa-b824-e020d6af9fbc",
            "title": "Federal food aid will not go out starting Nov. 1, USDA website alert says",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/federal-food-aid-govenrment-shutdown/",
            "keywords": [
                "hakeem jeffries",
                "margaret brennan",
                "administration",
                "second-longest",
                "supplemental",
                "supplemental nutrition assistance program",
                "administration blames democrats",
                "connecticut accused republicans"
            ],
            "topics": [
                "economy",
                "government",
                "finance",
                "social"
            ],
            "description": "The USDA notice comes after the Trump administration said it would not tap roughly $5 billion in contingency funds to keep benefits through SNAP.",
            "pub_date": "2025-10-26T19:47:36",
            "creator": "CBS News",
            "content": "The U. S. Department of Agriculture has posted a notice on its website saying federal food aid will not go out on Nov. 1, raising the stakes for families nationwide as the government shutdown drags on. The new notice comes after the Trump administration said it would not tap roughly $5 billion in contingency funds to keep benefits through the Supplemental Nutrition Assistance Program, commonly referred to as SNAP, flowing into November. That program helps about 1 in 8 Americans buy groceries. \"Bottom line, the well has run dry,\" the USDA notice says. \"At this time, there will be no benefits issued November 01. We are approaching an inflection point for Senate Democrats.\" The shutdown, which began on Oct. 1, is now the second-longest on record. While the Republican administration took steps leading up to the shutdown to ensure SNAP benefits were paid this month, the cutoff would expand the impact of the impasse to a wider swath of Americans and some of those most in need unless a political resolution is found in just a few days. The administration blames Democrats, who say they will not agree to reopen the government until Republicans negotiate with them on extending expiring subsidies under the Affordable Care Act. Republicans say Democrats must first agree to reopen the government before negotiations. \"There is an urgent need to reopen the government, which is why we continue to demand that Republicans sit at the negotiating table so we can enact a spending agreement that's bipartisan in nature,\" House Minority Leader Hakeem Jeffries said on \"Face the Nation with Margaret Brennan\" on Sunday. Democratic lawmakers have written to Agriculture Secretary Brooke Rollins requesting that she use contingency funds to cover the bulk of next month's benefits. But a USDA memo that surfaced Friday says \"contingency funds are not legally available to cover regular benefits.\" The document says the money is reserved for such things as helping people in disaster areas. The memo cited Hurricane Melissa, which has strengthened into a major hurricane, as an example of why it's important to have the money available to mobilize quickly in the event of a disaster. The prospect of families not receiving food aid has deeply concerned states run by both parties. Some states have pledged to keep SNAP benefits flowing even if the federal program halts payments, but there are questions about whether U. S. government directives may allow that to happen. The USDA memo also says states would not be reimbursed for temporarily picking up the cost. Other states are telling SNAP recipients to be ready for the benefits to stop. Arkansas and Oklahoma, for example, are advising recipients to identify food pantries and other groups that help with food. Democratic Sen. Chris Murphy of Connecticut accused Republicans and President Trump of not agreeing to negotiate. \"The reality is, if they sat down to try to negotiate, we could probably come up with something pretty quickly,\" Murphy said Sunday on CNN's \"State of the Union. We could open up the government on Tuesday or Wednesday, and there wouldn't be any crisis in the food stamp program.\".",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/1e8bffc7-8324-4c58-a309-4665c49bcc84/thumbnail/1200x630/924d7980dda8d5c957d49dc2f34f18d4/ap25289506125167.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.104,
                "neg": 0.057,
                "neu": 0.839
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "8b4030fd-6217-481e-86c1-b5856a8c648d",
            "title": "US airports report over 20 air traffic controller shortage triggers in one day",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/us-news/2025/oct/26/air-traffic-controller-shortages-shutdown",
            "keywords": [
                "sean duffy",
                "duffy",
                "administration",
                "transportation",
                "international",
                "national air traffic controllers association",
                "transportation security administration",
                "federal aviation administration"
            ],
            "topics": [
                "economy",
                "government",
                "transportation",
                "media"
            ],
            "description": "Transportation secretary says figure is ‘one of the highest we’ve seen’ since 1 October as shutdown drags onUS airports have reported more than 20 incidents of air traffic controller shortages on Saturday, said Sean Duffy, transportation secretary, in the latest sign of the government shutdown’s impact. A ground stop was issued by the agency at Los Angeles international airport due to the air traffic controller staffing shortages at around 11. 30am ET (15. 30 GMT). The restriction covered most of the southern California region and delays are likely when flights resume.",
            "pub_date": "2025-10-26T19:42:15",
            "creator": "Michael Sainato and agencies",
            "content": "US airports have reported more than 20 incidents of air traffic controller shortages on Saturday, said Sean Duffy, transportation secretary, in the latest sign of the government shutdown’s impact. A ground stop was issued by the agency at Los Angeles international airport due to the air traffic controller staffing shortages at around 11. 30am ET (15. 30 GMT). The restriction covered most of the southern California region and delays are likely when flights resume. By noon ET on Sunday, the agency had recorded shortfalls in air traffic controllers at six US airports. The Trump administration warned flight disruptions are expected to increase as the shutdown drags on. He said that figure was “one of the highest that we’ve seen in the system” since 1 October. “That’s a sign that the controllers are wearing thin,” Duffy said. According to FlightAware, a flight tracking website, there were more than 5, 300 US flight delays on Saturday and more than 2, 500 by 12pm ET on Sunday. Since the shutdown began, delays have often been above average. According to the FAA, air traffic control staffing issues had already been reported on Sunday for Chicago and Newark flights. Through the shutdown of the federal government, around 13, 000 air traffic controllers and about 50, 000 Transportation Security Administration (TSA) officers must work without pay during the shutdown, as Republicans and Democrats remain deadlocked over passing a federal budget. “This shutdown has real consequences for these hard-working American patriots,” said Nick Daniels, President of the National Air Traffic Controllers Association (NATCA), in a statement last week. “With each passing day, controllers become more distracted by the risk of receiving a zero-dollar paycheck on 28 October, despite working 40 hours per week and, in many cases, mandatory overtime due to the controller staffing shortage.” Air traffic controllers received a paycheck two weeks ago at around 90% of their regular pay, but Tuesday will mark their first fully unpaid pay period for work in October. Duffy noted air traffic controllers have been taking on second jobs to try to supplement the lost income. “They’re taking second jobs, they’re out there looking,” he said. The FAA is around 3, 500 air traffic controllers short of targeted staffing levels, which had many to work mandatory overtime and six-day weeks before the shutdown began. The shutdown also forced employees in training at the FAA Academy in Oklahoma to be sent home on 3 October. “Any lapse in training can push the clock back, as it did during the academy’s closure during the pandemic. “The furloughed employees want to be back on the job, all of the employees need to be paid and they want to start actively contributing to the modernization of the air traffic control system. We call on Congress to open the government as soon as possible.”.",
            "media_url": "https://i.guim.co.uk/img/media/5069ab5e9144e2766fb0cf770f388fd0b98fd352/417_0_4167_3333/master/4167.jpg?width=140&quality=85&auto=format&fit=max&s=6a48f589641ca074870e0252d7336df2",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: David Dee Delgado/Reuters",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.032,
                "neg": 0.046,
                "neu": 0.922
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "306b39b4-e050-4e32-8f33-633e2966a524",
            "title": "Four arrested in connection to a gang-related drive-by shooting in Madera County, police say",
            "source_title": "ABC30",
            "source_link": "https://abc30.com",
            "article_link": "https://abc30.com/post/arrested-connection-gang-related-drive-shooting-madera-county-police-say/18074279/",
            "keywords": [
                "chowchilla",
                "edgar ventura",
                "27-year-old",
                "18-year-old",
                "20-year-old",
                "18-year-old christian estrada",
                "20-year-old alexis palacios",
                "chowchilla police officers"
            ],
            "topics": [
                "crime"
            ],
            "description": "Three people, including a teenager, are in custody after being connected to a drive-by shooting in Madera County.",
            "pub_date": "2025-10-26T19:34:09",
            "creator": "KFSN",
            "content": "COWCHILLA, Calif. (KFSN) -- Three people, including a teenager, are in custody after being connected to a drive-by shooting in Madera County. Chowchilla Police officers responded to the gunfire on First Street and Humboldt Avenue. The victim was driven to the police department, then rushed to a hospital. Officers were able to track down the suspect vehicle after being alerted by the Madera County Sheriff's Office. Deputies stopped the vehicle in Fairmead and found guns and drugs. 27-year-old Edgar Ventura, 18-year-old Christian Estrada, 20-year-old Alexis Palacios and a juvenile were booked on several charges.",
            "media_url": "https://vcl.abcotv.net/video/kfsn/102625-kfsn-8a-chowchilla-drive-by-shooting-vid.mp4",
            "media_type": "video/mp4",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://cdn.abcotvs.com/dip/images/18074303_102625-kfsn-8a-chowchilla-drive-by-shooting-vid.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.088,
                "neu": 0.912
            },
            "source": {
                "id": "abc30",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "1a8d3c99-df16-4279-9faf-4a84708f4aef",
            "title": "NCAA ordered to pay $18M to former football player in concussion lawsuit",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/ncaa-south-carolina-state-football-robert-geathers-cte-concussion-lawsuit/",
            "keywords": [
                "orangeburg county",
                "robert geathers",
                "representatives",
                "encephalopathy",
                "dementia-like",
                "chronic traumatic encephalopathy",
                "influence dementia-like symptoms",
                "that influence dementia-like"
            ],
            "topics": [
                "lawsuit",
                "economy",
                "sports"
            ],
            "description": "Robert Geathers, who played at South Carolina State University from 1977 to 1980, was awarded $10 million. His wife, Debra, was awarded $8 million.",
            "pub_date": "2025-10-26T19:32:26",
            "creator": "CBS News",
            "content": "The NCAA owes a former college football player and his wife $18 million, a South Carolina jury decided while finding college sports' major governing body negligent in failing to warn the player about the long-term effects of concussions. Following a civil trial that wrapped up late last week, Orangeburg County jurors awarded $10 million to 68-year-old Robert Geathers, who played at South Carolina State University from 1977 to 1980 as a defensive end. His wife, Debra, was awarded $8 million, according to a court document. A physician diagnosed Robert Geathers with dementia several years ago, The Times and Democrat newspaper in Orangeburg reported. Now he has trouble with day-to-day tasks such as dressing himself and helping make meals. Other physicians who testified at the trial said Geathers displays symptoms of chronic traumatic encephalopathy, a degenerative brain disease found in former football players who received repeated blows to their heads while playing. CTE can be diagnosed only posthumously. The couple's attorneys argued to jurors that blows Geathers took during practices and games for the historically Black school in Orangeburg caused trauma that didn't show up until decades later, the newspaper reported. Geathers' attorney, Bakari Sellers, alleged the NCAA knew about concussion risks since the 1930s and when Robert Geathers' college career ended but didn't tell coaches or players about those risks until later. \"All of the information they knew, they withheld,\" Sellers told jurors, adding that \"their job was to keep the boys safe.\" The verdict can be appealed. NCAA spokesperson Greg Johnson said Saturday in an email that the organization disagreed with the verdict and that it \"was prepared to pursue our rights on post-trial motions and on appeal, if necessary.\" Johnson said the \"NCAA has prevailed in every other jury trial around the country on these issues\" and that the South Carolina State team standards \"followed the knowledge that existed at the time, and college football did not cause Mr. Geathers' lifelong health problems.\" NCAA trial attorney Andy Fletcher said at the trial that Robert Geathers has several health conditions that influence dementia-like symptoms, and that the NCAA's football rules committee is composed of representatives of member schools who could propose rules. \"There's going to be head-hits. That's inherent to the game. You can't take head-hits out of football,\" Fletcher said in closing arguments. According to the newspaper, the jury determined the NCAA \"unreasonably increased the risk of harm of head impacts to Robert Geathers over and above the risks inherent to playing football.\" And it also determined the NCAA \"voluntarily assumed duties to protect the health and safety of Robert Geathers\" and that the NCAA \"negligently breached their duties\" to him. After the trial, Sellers said the result provided justice: \"I felt good to hug Debra Geathers. She gets to go home and tell her husband some good news.\".",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/591c1294-7335-437f-9069-09e1e3e937cf/thumbnail/1200x630/05f272e38d5cf5123adc91e0fea7605f/gettyimages-1354908291.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.098,
                "neg": 0.062,
                "neu": 0.84
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "1ca116d8-4c0c-4376-8282-d3b0b4e3eba6",
            "title": "Boeing defense workers on strike in the Midwest reject the company's latest contract offer",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/news/boeing-midwest-illinois-missouri-b2852568.html",
            "keywords": [
                "boeing",
                "brian bryant",
                "international",
                "third-quarter",
                "improvements",
                "scheduling provision affecting",
                "assemble commercial jetliners",
                "the international association"
            ],
            "topics": [
                "strike",
                "economy",
                "labor",
                "government",
                "business"
            ],
            "description": "Boeing workers at three Midwest plants where military aircraft and weapons are developed have voted to reject the company’s latest contract offer and to continue a strike that started almost three months ago.",
            "pub_date": "2025-10-26T19:32:25",
            "creator": "Rio Yamat",
            "content": "Boeing workers at three Midwest plants where military aircraft and weapons are developed voted Sunday to reject the company’s latest contract offer and to continue a strike that started almost three months ago. The strike by about 3, 200 machinists at the plants in the Missouri cities of St. Louis and St. Charles, and in Mascoutah, Illinois, is smaller in scale than a walkout last year by 33, 000 Boeing workers who assemble commercial jetliners but threatens to complicate the aerospace company’s progress in regaining its financial footing. “Boeing claimed they listened to their employees the result of today’s vote proves they have not,” Brian Bryant, president of the International Association of Machinists union, said in a statement. Union leaders say talks have stalled over issues such as wages and retirement benefits, while Boeing has argued that workers’ demands exceed the cost of living in the Midwest. Ahead of Sunday’s vote, the union told its members that it did not recommend approval of the company’s latest offer, which it said “had no meaningful improvements” to retirement benefits and wage increases for workers with more seniority. Negotiations escalated over the summer in the days leading up to the strike, with the workers rejecting an earlier proposed agreement that included a 20% wage hike over the life of the five-year contract. Boeing quickly countered with a modified agreement that didn’t boost the proposed pay raises but did remove a scheduling provision affecting the workers’ ability to earn overtime pay. Workers rejected that offer, too, and went on strike the next morning. The company has said that it was prepared for a strike, with a contingency plan in place “to ensure our non-striking workforce can continue supporting our customers.\" Boeing’s Defense, Space & Security business accounts for more than one-third of the company’s revenue. Boeing is set to report its third-quarter earnings on Wednesday.",
            "media_url": "https://static.independent.co.uk/2025/10/26/19/Boeing_Strike_Midwest_27357.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Copyright 2024 The Associated Press. All rights reserved.",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.121,
                "neg": 0.12,
                "neu": 0.759
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "e361245c-5278-42e5-b142-6c39caebbeaf",
            "title": "Saracens’ Noah Caluori called up by England for autumn internationals",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/2025/oct/26/noah-caluori-called-up-to-england-squad-for-autumn-internationals",
            "keywords": [
                "noah caluori",
                "steve borthwick",
                "cunningham-south",
                "internationals",
                "rehabilitation",
                "forward chandler cunningham-south",
                "by table-topping northampton",
                "table-topping northampton on"
            ],
            "topics": [
                "sports",
                "international"
            ],
            "description": "19-year-old wing scored five tries on first Prem startBorthwick has picked 36-player squad for four matchesNoah Caluori, the 19-year-old Saracens wing, has been named in England’s autumn internationals squad by Steve Borthwick. Caluori burst on to the Prem scene by scoring five tries against Sale on 18 October and, as England gear up for a busy November featuring four Tests, Borthwick has called up the uncapped youngster after initially inviting him to a training camp last week. The 36-player squad, including 19 forwards and 17 backs, gathered at Pennyhill Park in Surrey on Sunday night.",
            "pub_date": "2025-10-26T19:30:54",
            "creator": "Luke McLaughlin",
            "content": "Noah Caluori, the 19-year-old Saracens wing, has been named in England’s autumn internationals squad by Steve Borthwick. Caluori burst on to the Prem scene by scoring five tries against Sale on 18 October and, as England gear up for a busy November featuring four Tests, Borthwick has called up the uncapped youngster after initially inviting him to a training camp last week. The 36-player squad, including 19 forwards and 17 backs, gathered at Pennyhill Park in Surrey on Sunday night. Caluori made his second Prem start for Saracens in the defeat by table-topping Northampton on Friday. He had a considerably quieter night than the phenomenal display against Sale, and was given a severe defensive test by the Saints’ all-court attacking game. However, his remarkable aerial ability was in evidence at Franklin’s Gardens and, by turning to Caluori for his autumn squad, Borthwick has signalled that he sees potential for him to play at the 2027 Rugby World Cup in Australia. The head coach found no place for Adam Radwan of Leicester, who shone in the Tigers’ win over Sale on Saturday and was chosen in Borthwick’s training squad last week. Radwan’s 23-year-old club colleague Emeka Ilione misses out because of a shoulder problem. The Sale flanker Tom Curry returns, having had surgery on a wrist ligament problem after the British & Irish Lions tour in the summer, and his scrum-half clubmate Raffi Quirke is also back from injury. There is good news for the Harlequins forward Chandler Cunningham-South, who takes his place in the squad despite a recent ankle injury, while Elliot Daly of Saracens and Leicester’s George Martin and Jack van Poortvliet will join the squad to work on injury rehabilitation. “Our focus is on making the most of the time we have together as we approach what will be a fiercely competitive series,” Borthwick said. “Facing Australia in the opening match will be a great test against a team that has been training and playing together for some time and is one of the in-form teams in the world.” The uncapped Caluori will be pitched into an fierce battle for starting spots in the back line: Tommy Freeman scored four tries in Northampton’s win against Saracens, and while the 24-year-old may be switching to outside-centre, there are several other world-class wing options available to Borthwick. Immanuel Feyi-Waboso notched his seventh try of the Prem season in Exeter’s victory against Gloucester on Saturday and leads the try-scoring charts, with Sale’s Tom Roebuck on five and Henry Arundell of Bath on four. Feyi-Waboso’s Exeter colleague Henry Slade, meanwhile, has scored a league-leading 70 points in five Prem rounds, roaring back into top form at 32. Slade has started the past two matches in the centres alongside the Chiefs’ new signing Len Ikitau of Australia, and they may now face each other at Twickenham on Saturday. The fly-half shirt could provide intrigue after George Ford enjoyed an outstanding summer tour with Borthwick’s team, playing in two wins against Argentina and one against the USA. Fin Smith, who stylishly pulled the strings for Northampton on Friday, was on Lions duty in Australia and the stock of the 32-year-old Ford rose in his absence. Tom Willis of Saracens is left out, as expected, after announcing his decision to return to France having established himself as Borthwick’s first-choice No 8. The 20-year-old Henry Pollock, another player who starred for the Saints on Friday, will be an option for the No 8 jersey leading into the World Cup. Australia defeated Japan 19-15 in Tokyo on Saturday to begin their autumn schedule but after the forwards Lukhan Salakaia-Loto and Josh Canham were injured, Joe Schmidt said he may be forced to call up reinforcements, with the second row being an area of concern. “With England’s strong pack, it just means that we are light in the second row, and we may need to get some reserves dug out from Australia,” the Australia head coach said. “That’s probably our first thought.” Australia’s visit to Twickenham on Saturday is followed by fixtures for England against Fiji a week later, the All Blacks on 15 November, and Argentina on 23 November.",
            "media_url": "https://i.guim.co.uk/img/media/cd3260da5dc1480f844a0757c70cbed4d00dae62/292_0_2917_2333/master/2917.jpg?width=140&quality=85&auto=format&fit=max&s=4ec309310d243ff8ae987fd4260c30d7",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Gaspafotos/MB Media/Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.083,
                "neg": 0.058,
                "neu": 0.859
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "50f8fdff-b70b-43ef-8aa2-7f5cae4944aa",
            "title": "Two killed in Cameroon protests ahead of election results, opposition says",
            "source_title": "Al Jazeera America",
            "source_link": "https://www.aljazeera.com",
            "article_link": "https://www.aljazeera.com/news/2025/10/26/two-killed-in-cameroon-protests-ahead-of-election-results-opposition-says?traffic_source=rss",
            "keywords": [
                "issa tchiroma",
                "douala",
                "demonstrations",
                "irregularities",
                "insurrectional",
                "rejected opposition accusations",
                "electoral commission announced",
                "presidential election results"
            ],
            "topics": [
                "protest",
                "politics",
                "government"
            ],
            "description": "Hundreds of supporters of opposition presidential candidate Issa Tchiroma accuse Paul Biya gov't of seeking to rig vote.",
            "pub_date": "2025-10-26T19:28:31",
            "creator": "Al Jazeera America",
            "content": "At least two people have been killed by gunfire in Cameroon, as protesters rallied a day before the announcement of presidential election results, the opposition campaign has said. Hundreds of supporters of opposition candidate Issa Tchiroma barricaded roads and burned tyres in Cameroon’s commercial capital Douala on Sunday. Police fired tear gas and water cannon to break up the crowds. A police car was also burned. Recommended Stories list of 3 items list 1 of 3Cameroon votes in presidential election as Paul Biya, 92, seeks eighth term list 2 of 3Cameroon’s Issa Tchiroma Bakary claims presidential election victory list 3 of 3Video: Opposition candidate declares victory in Cameroon election end of list The protesters say Tchiroma beat veteran leader Paul Biya, 92, in the October 12 polls and have accused authorities of preparing to rig the election. Protests have flared in several cities, including the capital Yaounde, Tchiroma’s hometown Garoua, as well as Maroua, Meiganga, Bafang, Bertoua, Kousseri, Yagoua, Kaele, and Bafoussam. The demonstrations came after partial results reported by local media showed that Biya was on course to win an eighth term in office. During the counting process, according to the figures, Tchiroma was declared the winner. But during the national count, the electoral commission announced that Biya would be the winner, which Tchiroma disputes. He claims that he has won the elections and that he has evidence to prove it, which led to a call for national demonstrations to demand the truth about the ballot boxes. ‘We want Tchiroma’ “We want Tchiroma, we want Tchiroma!” the protesters chanted in Douala’s New Bell neighbourhood. They blocked roads with debris and threw rocks and other projectiles at security forces. Reuters news agency reporters saw police detain at least four protesters on Sunday. Cameroon’s government has rejected opposition accusations of irregularities and urged people to wait for the election result, due on Monday. Earlier on Sunday, Tchiroma’s campaign manager said authorities had detained about 30 politicians and activists who had supported his candidacy, heightening tensions. Among those he said were detained were Anicet Ekane, leader of the MANIDEM party, and Djeukam Tchameni, a prominent figure in the Union for Change movement. Cameroon’s Interior Minister Paul Atanga Nji said on Saturday that arrests had been made in connection with what he described as an “insurrectional movement,” though he did not say who or how many had been detained. Biya is the world’s oldest serving ruler and has been in power in Cameroon since 1982. Another seven-year term could keep him in power until he is nearly 100. Tchiroma, a former minister and one-time Biya ally, has said that he won and that he will not accept any other result.",
            "media_url": "https://www.aljazeera.com/wp-content/uploads/2025/10/afp_68fe6fdb78cf-1761505243.jpg?resize=1920%2C1440",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.089,
                "neg": 0.112,
                "neu": 0.799
            },
            "source": {
                "id": "al-jazeera-america",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "150a9771-e701-4519-929c-f47311a5d885",
            "title": "Mikel Arteta hails Eberechi Eze as star haunts former club Crystal Palace",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/mikel-arteta-crystal-palace-eberechi-eze-england-bournemouth-b2852522.html",
            "keywords": [
                "mikel",
                "arteta",
                "international",
                "second-placed",
                "competitions",
                "defending champions liverpool",
                "spectacular performance from",
                "of second-placed bournemouth"
            ],
            "topics": [
                "sports",
                "entertainment"
            ],
            "description": "Mikel Arteta hails Eberechi Eze as star haunts former club Crystal Palace",
            "pub_date": "2025-10-26T19:23:28",
            "creator": "Philip Duncan",
            "content": "Mikel Arteta hailed Eberechi Eze for repaying a chunk of his £67. 5million transfer fee following his winning strike in Arsenal’s 1-0 victory over Crystal Palace. Eze fired home against his old club with a sumptuous finish six minutes prior to the interval as Arsenal saw out their seventh consecutive victory across all competitions. It was a far from a spectacular performance from Mikel Arteta’s men at the Emirates, but the triumph takes Arsenal four points clear of second-placed Bournemouth in the table, and six ahead of Manchester City following their 1-0 defeat at Aston Villa. Defending champions Liverpool are a point further back. There was only a muted celebration from Eze following his goal against the club he served for five years. But it marked a much-needed first league strike in seven attempts for the England international since his big-money switch. And Arteta, when asked if Eze’s goal provided the kind of “magic moment” he was signed for, the Spaniard, replied: “Yes, 100 per cent. “That’s what big players do and he’s certainly a big player and hopefully that’s going to give him a big boost and confidence to generate many more moments like this because that’s the moment that sometimes defines a season. “I didn’t see any difference with him before the game. He is always super relaxed and always has a big smile on his face. It might have been inside him because he was at Palace for a long time, and he has such strong feelings and gratitude for that club. Today was a very special game for him.” Arsenal took just one point in their away fixtures at Newcastle and Fulham, and at home to West Ham and Crystal Palace last season. This time around they have registered 12 points from 12, and Arteta continued: “I just told the boys that I value this victory more than any other victory this season because we knew the difficulty of it. “We are where we are (in the league) and it is a credit to us because we’ve been very, very consistent, but it really doesn’t mean anything other than let’s keep doing a lot of things that we’re doing really well. There are things to improve as well to give us better margins.” The only sour notes for Arsenal in their pursuit of a first league title in 22 years came with injuries to William Saliba, Declan Rice and Riccardo Calafiori. The former did not emerge after the interval while Rice and Calafiori were replaced in the second half. A cryptic Arteta added: “On William there were two things related to his substitution, and with Declan I don’t really know because it was a knock. I don’t know if it was his calf or Achilles. Tomorrow we will have more news.” Palace have now lost three of their last four games across all competitions and manager Oliver Glasner said: “When you give Eze a free shot inside the box it is very often a goal. “We benefitted on many occasions last season but today we suffered. He scored the winning goal like this in the FA Cup final. Then I was pleased, but today I was the opposite. I was sad.”.",
            "media_url": "https://static.independent.co.uk/2025/10/26/17/28fbe81697b7e20ec4f4b407e4120e48Y29udGVudHNlYXJjaGFwaSwxNzYxNTg0OTgz-2.82161514.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.17,
                "neg": 0.033,
                "neu": 0.797
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "8cd97fd3-c9d9-4817-be45-eed63de718c5",
            "title": "U.S. warship docks in Trinidad and Tobago amid tensions with Venezuela",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/us-warship-docks-trinidad-and-tobago-venezuela/",
            "keywords": [
                "tobago",
                "venezuela",
                "non-international",
                "persad-bissessar",
                "administration",
                "non-international armed conflict",
                "potential military operations",
                "operations against venezuela"
            ],
            "topics": [
                "international",
                "politics"
            ],
            "description": "In an interview aired Sunday Lindsey Graham said land strikes in Venezuela are a \"real possibility\" amid rising tensions.",
            "pub_date": "2025-10-26T19:21:57",
            "creator": "CBS News",
            "content": "A U. S. warship docked in Trinidad and Tobago's capital on Sunday as the Trump administration boosts its military pressure on neighboring Venezuela and President Nicolás Maduro. The arrival of the USS Gravely, a guided missile destroyer, in the capital of the Caribbean nation joins the aircraft carrier USS Gerald R. Ford, which is moving closer to Venezuela. Maduro criticized the movement of the carrier as an attempt by the U. S government to fabricate \"a new eternal war\" against his country. President Trump has accused Maduro, without providing evidence, of being the leader of the organized crime gang Tren de Aragua. Government officials from the twin-island nation and the U. S. said the massive warship will remain in Trinidad until Thursday so both countries can carry out training exercises. A senior military official in Trinidad and Tobago told The Associated Press that the move was only recently scheduled. The official spoke under the condition of anonymity due to a lack of authorization to discuss the matter publicly. Kamla Persad-Bissessar, the prime minister of Trinidad and Tobago, has been a vocal supporter of the U. S. military presence and the deadly strikes on suspected drug boats in waters off Venezuela. The Trump administration has said the U. S. is in a \"non-international armed conflict\" with drug cartels, arguing that the narcotics they smuggle kill tens of thousands of Americans every year, constituting an \"armed attack.\" The wife of Alejandro Carranza, one of the more than 30 people killed in the strikes, claimed he left home on Colombia's Caribbean coast to fish in open waters and denied he had any link to drug trafficking. In an interview aired Sunday Lindsey Graham said land strikes in Venezuela are a \"real possibility\" amid rising tensions. \"I think President Trump's made a decision that Maduro, the leader of Venezuela, is an indicted drug trafficker, that it's time for him to go. That Venezuela and Colombia have been safe havens for narco terrorists for too long,\" the Republican senator told Margaret Brennan. \"And President Trump told me yesterday that he plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia.\" U. S. Embassy Chargé d'Affaires Jenifer Neidhart de Ortiz said in a statement that the exercises seek to \"address shared threats like transnational crime and build resilience through training, humanitarian missions, and security efforts.\" The visit comes one week after the U. S. Embassy in Trinidad and Tobago warned Americans to stay away from U. S. government facilities there. Local authorities said a reported threat against Americans prompted the warning. People in Trinidad and Tobago have criticize the warship's docking in town at a recent demonstration outside the U. S. Embassy. David Abdulah, the leader of the Movement for Social Justice political party, said Trinidad and Tobago should not have allowed the warship into its waters. \"This is a warship in Trinidad, which will be anchored here for several days just miles off Venezuela when there's a threat of war,\" said Abdulah, who is also the leader of the Movement for Social Justice political party. \"That's an abomination.\" Caricom, a regional trade bloc made up of 15 Caribbean countries, has called for dialogue. Trinidad and Tobago is a member of the group, but Persad-Bissessar has said the region is not a zone of peace, citing the number of murders and other violent crimes.",
            "media_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/10/26/a71ea015-fe80-4d07-8d6f-9c8e5e3ea987/thumbnail/1200x630/43cc70f700d5b938ac9f0344558e9831/ap25299602827484.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.044,
                "neg": 0.149,
                "neu": 0.807
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "81e61666-248e-4c0c-ac9e-25e73fa28b15",
            "title": "Tuberculosis cases are surging in the UK: Symptoms and advice you need to know",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/news/health/tuberculosis-symptoms-uk-cases-rising-b2852534.html",
            "keywords": [
                "world health",
                "yorkshire",
                "mycobacterium",
                "notifications",
                "predominantly",
                "mycobacterium tuberculosis complex",
                "the mycobacterium tuberculosis",
                "predominantly through coughing"
            ],
            "topics": [
                "health",
                "medicine"
            ],
            "description": "Tuberculosis cases are surging in the UK: Symptoms and advice you need to know",
            "pub_date": "2025-10-26T19:21:37",
            "creator": "Amy-Clare Martin",
            "content": "Tuberculosis (TB) infections are surging in England, figures show, as officials urge healthcare providers to look out for symptoms. Cases of the infectious bacterial disease increased by almost 14 per cent year on year in 2024 the largest annual increase since national surveillance began. Officials recorded 5, 490 TB notifications, up from 4, 831 in 2023, according to the UK Health and Security Agency (UKHSA). Provisional data shows cases of the potentially fatal disease increased by a further 3. 9 per cent in the first half of 2025. It follows a 10. 6 per cent surge in cases in 2023, reversing a long-term downward trend in TB cases since previous highs in 2012. The figures mean England is not on track to meet World Health Organisation targets to mostly eliminate TB by 2035, which aim to reduce patients suffering from TB by 90 per cent. TB mainly affects the lungs, but it can affect any part of the body, including lymph nodes, bones and the brain, causing meningitis. It is spread when an infected person coughs or sneezes. Although it is a potentially deadly condition, it can be cured if it's diagnosed early and treated with the right combination of specific antibiotics. TB symptoms include a cough that lasts more than three weeks, high temperatures, drenching night sweats, loss of appetite and unexplained weight loss. It can sometimes be confused with flu or Covid-19. Although it is a potentially fatal condition in serious cases, it can be cured with antibiotics, but early detection is important. In a warning posted on their website earlier this year, the UKHSA urged healthcare providers to keep communities aware of key symptoms, including a cough with mucus which lasts several weeks. Tuberculosis (TB) is caused by bacteria of the Mycobacterium tuberculosis complex. It is spread predominantly through coughing and sneezing. It remains most common in urban areas, including London. However, the fast increases were also seen in the West Midlands, Yorkshire and the Humber and the south west. Individuals born outside of the UK accounted for eight in ten TB notifications in England last year, figures show. There is also a clear link with social deprivation and inequality, with those who experience homelessness, drug and alcohol dependence or in contact with the criminal justice system at higher risk. Those living in the most deprived areas of England experienced five times the rate of infections of those the most affluent regions, UKHSA figures show.",
            "media_url": "https://static.independent.co.uk/2025/03/25/13/25123208-9723bd0e-cefb-4a4c-8425-58146065cbd4.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Alamy/PA",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.038,
                "neg": 0.105,
                "neu": 0.857
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "3a3d2256-506e-4064-bd8b-4d27093d65d8",
            "title": "Arrests made in Louvre crown jewel heist, Paris prosecutor says",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/arrests-made-in-louvre-crown-jewel-heist-paris-prosecutor-says/",
            "keywords": [
                "charles de gaulle airport",
                "prosecutor",
                "connection",
                "allegedly",
                "brazen daytime robbery",
                "the paris prosecutor",
                "prosecutor 's office"
            ],
            "topics": [
                "crime",
                "theft",
                "international"
            ],
            "description": "The Paris prosecutor's office said Sunday that arrests had been made in connection to the brazen crown jewel heist at the Louvre, with one suspect arrested at Charles De Gaulle Airport as he allegedly tried to flee the country. Thieves stole an estimated $100 million worth of jewels and gems during a brazen daytime robbery that took less than eight minutes.",
            "pub_date": "2025-10-26T19:21:00",
            "creator": "CBS News",
            "content": "The Paris prosecutor's office said Sunday that arrests had been made in connection to the brazen crown jewel heist at the Louvre, with one suspect arrested at Charles De Gaulle Airport as he allegedly tried to flee the country. Thieves stole an estimated $100 million worth of jewels and gems during a brazen daytime robbery that took less than eight minutes.",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/45fb5da0-d77b-47c1-9b8e-67093ced7e77/thumbnail/1200x630/9837b1a4e7429f7f3b41ac46b75c072c/102625-ftn-paris.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.103,
                "neg": 0.16,
                "neu": 0.737
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "e9f040eb-d63b-47ba-884a-ef302f2b8a36",
            "title": "'People are afraid' - why 'juggernaut' Arsenal are team to beat",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/sport/football/articles/cn40lxq2j39o?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "fulham",
                "liverpool",
                "misconceptions",
                "bournemouth",
                "traditional",
                "results against newcastle",
                "interesting because there",
                "impressive about arsenal"
            ],
            "topics": [
                "sports"
            ],
            "description": "As Arsenal moved four points clear at the top of the Premier League, BBC Sport looks at why teams are 'afraid' of them.",
            "pub_date": "2025-10-26T19:20:37",
            "creator": "BBC News",
            "content": "It is not hard to see why Arsenal are now many people's favourites to win the Premier League this season. Take their results against Newcastle, West Ham, Fulham and Crystal Palace compared to those matches in the previous campaign. The Gunners have beaten all of them this time around, but dropped 10 points across those games as they fell away in the title race last season. A draw at Fulham, another at home to Palace, while they lost at Newcastle and were beaten at home by West Ham. It meant the Gunners finished second for a second successive season, this time with a 10-point deficit to champions Liverpool, showing just how crucial such results are to the final outcome. What is even more impressive about Arsenal's start to the campaign is they have also played Manchester United, Liverpool and Newcastle United away from home and Manchester City at home and are still four points clear at the top from Bournemouth. While they keep winning, their traditional rivals aren't faring so well. In fact, is is the first time at this stage of this season since 1992 that none of Manchester City and United, Liverpool or Chelsea are in the Premier League top four. \"It is interesting because there are some misconceptions we have and that is true with Arsenal. People call them set-piece FC and all that,\" former City defender Nedum Onouha told BBC Radio 5 Live. \"But they are up there with teams with the most shots in the Premier League and had the fewest goals conceded, conceded the fewest chances and the fewest shots. \"They are brilliant. They sit top of the league and they deserve to be there.\" The pressure was on boss Mikel Arteta at the start, having spent around £250m on eight summer signings in search of that elusive first title since 2004. But the business has so far paid off in style, with his side second top scorers in the league and having the tightest defence, despite a number of injuries. \"Arsenal can do a bit of everything now. The whole team has a fear factor.\" former Gunners striker Theo Walcott added on BBC Sport. \"People are just afraid of them and it is great to see. \"It's starting to now be normal that they don't concede goals. They will have a bad patch and last year it was too many draws, but I don't think that's going to happen this year. There is belief in the whole club now.\" Ex-Arsenal and England striker Ellen White described Arteta's men as a \"juggernaut, looking difficult to stop\". Arsenal's defensive solidity is a key reason why they are looking well positioned to finally fulfil their title target. Arteta himself said he valued the win over Palace more \"than any other victory this season\", and with Liverpool, Chelsea and Manchester City losing, Arsenal had \"a big opportunity as well with the things that happened during this weekendWe are where we are [in the league] and it is a credit to us because we've been very, very consistent, but it really doesn't mean anything other than let's keep doing a lot of things that we're doing really well,\" he added. \"There are things to improve as well to give us better margins.\" Defensively, his side rank top in the league for clean sheets (6), goals conceded (3), shots faced (72), shots on target faced (19) and expected goals against (xGA 5. 3). They restricted Palace to just one shot on target and even that opportunity was when the ball flicked off of Eddie Nketiah's head and into keeper David Raya's hands. The central defensive pairing of Gabriel and William Saliba is arguably the best in the league and Arsenal have kept a clean sheet in six of their first nine games, more than any other team this season. There is a slight worry over Saliba's fitness as he was withdrawn at half-time, but when summer arrival Cristhian Mosquera has stepped into the team, the 21-year-old has looked an elite centre-back. Arsenal have kept a clean sheet in each of their last three games in the Premier League, a run of 385 minutes without conceding, and have only let in three goals in 12 games in all competitions this season. \"The pattern for Arsenal is that they can play anyone and get results. The champions of old don't concede many goals and Arsenal have belief they'll make a chance and they'll take it.\" said Walcott. \"It's been a weekend of poor results for teams you'd expect to win. \"Arsenal's bad spell this year have been not playing well but still getting results. I think that's down to Mikel [Arteta] he's really trying to get the level 100% focused throughout the game.\" Their threat from set-pieces is well known, but opposition teams still don't know how to contain the Gunners from the opportunities they get. They have scored crucial goals in matches against Manchester United, Newcastle, Fulham and Atletico Madrid from set-pieces and those goals have seen them pick up vital wins, or Gabriel opened the scoring against Atletico when it looked like there was no way through. Opposing managers have highlighted Arsenal's quality from corners and free-kicks and, in Bukayo Saka and Declan Rice, they have two of the best takers in the league. They have scored 11 times from set-pieces in the league, two more than any other side (Chelsea, 9) and 69% (11/16) of their goals in 2025-26 have come from them too. Arsenal will hope to score.",
            "media_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e268/live/eaa6ba90-b292-11f0-ac49-67a9e9deace7.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e268/live/eaa6ba90-b292-11f0-ac49-67a9e9deace7.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.163,
                "neg": 0.053,
                "neu": 0.784
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "26504843-59d5-40d1-87ef-977218b5a596",
            "title": "How Canada Is Dealing With Its Latest Tussle With President Trump",
            "source_title": "The New York Times",
            "source_link": "https://www.nytimes.com",
            "article_link": "https://www.nytimes.com/2025/10/26/us/politics/canada-tariffs-trump-carney.html",
            "keywords": [
                "canada",
                "prime minister",
                "mark carney",
                "president trump",
                "asia"
            ],
            "topics": [
                "economy",
                "politics"
            ],
            "description": "Prime Minister Mark Carney is focusing on what the country can control, including looking for economic partnerships abroad, especially in Asia.",
            "pub_date": "2025-10-26T19:17:05",
            "creator": "Vjosa Isai",
            "content": null,
            "media_url": "https://static01.nyt.com/images/2025/10/26/multimedia/26trump-news-canada-trade-qkmc/26trump-news-canada-trade-qkmc-mediumSquareAt3X.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "the-new-york-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "d4deebea-add1-4cab-bd01-3215f51581b6",
            "title": "How Canada Is Dealing With Its Latest Tussle With President Trump",
            "source_title": "The New York Times",
            "source_link": "https://www.nytimes.com",
            "article_link": "https://www.nytimes.com/2025/10/26/us/politics/how-canada-is-dealing-with-its-latest-tussle-with-president-trump.html",
            "keywords": [
                "canada",
                "prime minister",
                "mark carney",
                "president trump",
                "asia"
            ],
            "topics": [
                "economy",
                "politics"
            ],
            "description": "Prime Minister Mark Carney is focusing on what the country can control, including looking for economic partnerships abroad, especially in Asia.",
            "pub_date": "2025-10-26T19:17:04",
            "creator": "Vjosa Isai",
            "content": null,
            "media_url": "https://static01.nyt.com/images/2025/10/26/multimedia/26trump-news-canada-trade-qkmc/26trump-news-canada-trade-qkmc-mediumSquareAt3X.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "the-new-york-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "557a1adb-9518-49f1-a2b0-2f810d31e069",
            "title": "Mexican Grand Prix: Formula One – live updates",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/live/2025/oct/26/mexican-grand-prix-formula-one-live-updates",
            "keywords": [
                "lando norris",
                "oscar piastri",
                "opportunity",
                "performance",
                "significant",
                "significant advantage over",
                "performance in qualifying",
                "qualifying yesterday has"
            ],
            "topics": [
                "sports",
                "racing"
            ],
            "description": "Live updates from the Autodromo Hermanos RodríguezEpic three-way title in Mexico . in 1964 | Email Billy1) Lando Norris (McLaren) 2) Charles Leclerc (Ferrari)3) Lewis Hamilton (Ferrari) 4) George Russell (Mercedes).",
            "pub_date": "2025-10-26T19:10:07",
            "creator": "Billy Munday",
            "content": "Preamble Well, what an opportunity for Lando Norris in Mexico City. His performance in qualifying yesterday has given him a significant advantage over his title rivals in a race that gets under way in an hour’s time. The McLaren driver starts on pole, with his teammate and overall leader Oscar Piastri only 7th and Max Verstappen in 5th. Completing the front row is Charles Leclerc, with Lewis Hamilton in 3rd and George Russell 4th. I’ll be bringing you lap-by-lap updates when the grand prix gets started at 8pm (GMT). With only five races of the season remaining and just 40 points between the top three drivers in the standings, it’s sure to be pivotal in the destination of the title. ¡Vamos!.",
            "media_url": "https://i.guim.co.uk/img/media/75cc6d75248c8c0694dc93c1afb52fd22321be48/1140_191_3499_2800/master/3499.jpg?width=140&quality=85&auto=format&fit=max&s=045e2b3d3e05614ed41ce68b900ba834",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Bryn Lennon/Formula 1/Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.126,
                "neg": 0.0,
                "neu": 0.874
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "41a4f7cb-29c2-497f-907f-9e6f2baf44ca",
            "title": "PKL 12: Super 10s From Bharat, Vijay Help Telugu Titans Clinch Mini-Qualifier vs Bengaluru Bulls; Reach Eliminator 3",
            "source_title": "Zee News",
            "source_link": "https://zeenews.india.com",
            "article_link": "https://zeenews.india.com/other-sports/pkl-12-super-10s-from-bharat-vijay-help-telugu-titans-clinch-mini-qualifier-vs-bengaluru-bulls-reach-eliminator-3-2976605.html",
            "keywords": [
                "bengaluru bulls",
                "bharat hooda",
                "mini-qualifier",
                "action-packed",
                "contributing",
                "bharat hooda contributing",
                "pirates continue fine run",
                "sankar exchanging tackles"
            ],
            "topics": [
                "sports",
                "entertainment",
                "competition",
                "league",
                "india"
            ],
            "description": "Super 10’s from Bharat Hooda and Vijay Malik ensured that Telugu Titans booked their place in the Eliminator 3. Meanwhile, Alireza Mirzaian’s Super 10 wasn’t enough for the Bulls but they will get another chance to progress when they take on the in-form Patna Pirates in the Eliminator 2.",
            "pub_date": "2025-10-26T19:09:00",
            "creator": "Zee News",
            "content": "Telugu Titans secured a hard-fought 37-32 win against their southern rivals, Bengaluru Bulls, in the Mini-Qualifier of Pro Kabaddi League (PKL) 2025 at the Thyagaraj Indoor Stadium on Sunday. Super 10’s from Bharat Hooda and Vijay Malik ensured that their side booked their place in the Eliminator 3. Meanwhile, Alireza Mirzaian’s Super 10 wasn’t enough for the Bulls, but they will get another chance to progress when they take on the in-form Patna Pirates in the Eliminator 2 on Monday. It was an action-packed start with Vijay Malik and Alireza setting the tone, before Bharat Hooda’s two-point raid gave the Titans a slender lead. The defenders also made their mark with Shubham Shinde and Deepak Sankar exchanging tackles. The Bulls got back on level terms with the score at 6-6 courtesy a tackle from Satyappa Matti and Akash Shinde getting himself on the board. On a Do-Or-Die Raid, Chetan Sahu managed a two-point raid to regain his team’s advantage, keeping them in a 10-8 lead after the first quarter. Bharat Hooda and Aman extended that lead to four points, before Akash registered a couple of raids, including a Do-Or-Die Raid, to make it a one-point game. The Titans ensured they kept their narrow four-point lead with Chetan Sahu and Bharat Hooda contributing, while Aman also secured a couple of tackles. However, Akash Shinde and Satyappa Matti ended the half strongly for the Bulls, concluding an engaging first half with the score at 16-14. ALSO READ: PKL 12: Patna Pirates Continue Fine Run, Reach Eliminator 2 After Ayan's 20-Point Masterclass And Navdeep's High Five The second half began in a sedate manner with the defenders making the first move. Ajit Pawar bagged a tackle for his side, while Sanjay did the same. Bengaluru Bulls upped the ante slightly with Aashish Malik’s two-point raid, and they eventually got their noses in front as Satyappa Matti’s tackle helped them execute their first ALL OUT. With a two-point raid, Alireza ensured that his team keeps the lead with the score at 24-21. Bharat responded for the Titans, scoring a two-point raid of his own, before a tackle from Ajit Pawar got them back on level terms at 24-24 with ten minutes to go in the match. With the game going down to the wire, the Titans began to take charge once more. Bharat Hooda completed his Super 10, while Shankar Gadai’s tackle inflicted an ALL OUT on the Bulls, giving them a 31-28 lead with under six minutes to go. Vijay Malik stepped up at a crucial stage for the Titans, chipping away on the raiding end to ensure his team hold on to their four-point lead with two minutes to go. Alireza completed his Super 10 on the night, keeping his team alive in the dying embers of the game. However, Vijay Malik sealed the deal for his side, completing a Super 10 of his own to give his side the bragging rights in the Southern Derby, winning 37-32, and also confirming their place in the Eliminator 3.",
            "media_url": "https://english.cdn.zeenews.com/sites/default/files/2025/10/27/1852119-super-10s-from-bharat-vijay-help-telugu-titans-clinch-mini-qualifier-vs-bengaluru-bulls-reach-eliminator-3.jpg?im=FitAndFill=(1200,900)",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.127,
                "neg": 0.0,
                "neu": 0.873
            },
            "source": {
                "id": "zee-news",
                "country": "IN",
                "political_leaning": "right",
                "reliability_score": 6.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "ba9d9881-100d-4a19-b1fd-af8dbd4041b6",
            "title": "Trump guilty of ordering ‘extrajudicial killings’ with strikes on alleged drug boats, Republican senator says",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/news/world/americas/us-politics/rand-paul-trump-caribbean-boats-b2852547.html",
            "keywords": [
                "paul",
                "fox news",
                "narco-traffickers",
                "constitutionally",
                "administration",
                "without congressional authorization",
                "constitutionally required approval",
                "without constitutionally required"
            ],
            "topics": [
                "politics",
                "government",
                "international"
            ],
            "description": "Just two Republican senators stand opposed to Trump’s killings of dozens of alleged drug traffickers, despite drone opposition under Obama.",
            "pub_date": "2025-10-26T19:08:54",
            "creator": "John Bowden",
            "content": "A Republican senator has escalated his opposition to the Trump administration’s war on alleged narcotics traffickers in the Caribbean Sea, which it is pursuing without congressional authorization. Sen. Rand Paul was He also described them as “wrong”. \"I would call them extrajudicial killings. This is akin to what China does, what Iran does with drug dealers,” the senator claimed. “They summarily execute people without presenting evidence to the public. So it's wrong.\" Paul went on to point out that the Trump administration was, without constitutionally required approval from the Legislative Branch, changing the terms of engagement for narco-traffickers. What was previously a matter of law enforcement where deadly strikes on vessels without warning would be completely prohibited the White House was now treating the situation as a military matter, where the senator noted that people are often killed without due process of a trial and sentencing. “The drug war, or the-- crime war, has been typically something we do through law enforcement. And so far they have alleged that these people are drug dealers, [but] no one has said their name, no one said what evidence [they have], no one said whether they’re armed,” said Paul. The U. S. military announced its latest public strike in the continuing campaign early Friday, bringing the total acknowledged death toll to 43. Two survivors were repatriated to their respective home countries instead of being brought to the U. S. for trial after their capture by military forces. In his interview, the senator exclaimed that the Trump administration’s strategy “didn’t make sense”. Apart from Paul, only one other Republican senator, Lisa Murkowski, has come out against the strikes being carried out without congressional approval. The president, at a meeting of his advisers on Thursday, told reporters: “I don’t think we’re necessarily going to ask for a declaration of war. I think we’re just gonna kill people that are bringing drugs into our country. We’re going to kill them. They’re going to be, like, dead.” “While I commend the administration’s concerted efforts to address the devastation of drug trafficking on communities across the country, I do not believe the information I have received justifies this interpretation of the President’s Article II powers,” Murkowski said this past week. “I take very seriously my Article I responsibility when it comes to Congress’s power to declare war. I don’t think that full information on the legal and factual justification for armed attacks on suspected drug traffickers is too much to ask,” the senator continued. Democrats are increasingly vocalizing their own resistance, though they lack the numbers to use legislative means to block the White House. The party also remains deadlocked with the administration and their Republican counterparts over a government shutdown, which is now in its 25th day. “It’s very simple,” Sen. Ruben Gallego said Sunday on Meet the Press on NBC. “If this president feels that they’re doing something illegally, then he should be using the Coast Guard. If there’s an act of war, then you use our military, and then you come and talk to us first. But this is murder.” Paul is the Senate’s strongest libertarian voice and was a top opponent of former President Barack Obama’s drone campaign. He led a Senate filibuster against an Obama nominee in 2013, demanding a promise from the administration that it would not authorize deadly force against an American on U. S. soil without due process. During the Obama administration, four American citizens were killed in targeted drone strikes overseas during the War on Terror, with just one being an intended target of the strikes. At the time, Paul had many supposed allies in the Senate GOP caucus, like Ted Cruz, who did not accept a vow from Attorney General Eric Holder to use law enforcement means instead of military strikes when the former is deemed capable of handling a terrorist threat. Now, that same justification is being used by the Trump administration to extend a military campaign in the Americas, as it has reclassified drug cartels as terrorist groups and sought to instigate regime change in Venezuela, which it alleges is controlled by a cartel. And as Paul pointed out, the identities of the 43 people killed in U. S. strikes over the past several weeks have not been released to Congress or the public, making it unclear if any Americans were among the targets. Republicans in the House and Senate, with few exceptions, are in lockstep with the president. “You continue to ship substances up here that are killing Americans, we're going to deal with it as a national security threat,” Senate Majority Leader John Thune said in September.",
            "media_url": "https://static.independent.co.uk/2025/10/26/18/16/rand_paul_1025_fox.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "X - Fox News Sunday",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.032,
                "neg": 0.16,
                "neu": 0.808
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "1ed2b003-e31a-441c-8337-36e9a97a9828",
            "title": "Former LAPD officer charged with murder in fatal 2015 shooting of homeless man in Venice",
            "source_title": "ABC7",
            "source_link": "https://abc7.com",
            "article_link": "https://abc7.com/post/former-lapd-officer-clifford-proctor-charged-murder-2015-venice-shooting-unarmed-homeless-man-brendan-glenn/18074223/",
            "keywords": [
                "clifford proctor",
                "brendan glenn",
                "wrongful-death",
                "investigators",
                "second-degree",
                "reexamined four use-of-force",
                "use-of-force cases involving",
                "wrongful-death lawsuit that"
            ],
            "topics": [
                "murder",
                "law",
                "crime",
                "justice"
            ],
            "description": "Former LAPD officer charged with murder in fatal 2015 shooting of homeless man in Venice",
            "pub_date": "2025-10-26T19:07:45",
            "creator": "AP",
            "content": "LOS ANGELES -- A grand jury indictment was unsealed Friday charging a former Los Angeles police officer in the May 2015 shooting death of an unarmed homeless man in Venice, the Los Angeles District Attorney's Office said. Clifford Proctor pleaded not guilty to a charge of second-degree murder. Brendan Glenn, 29, was killed during a struggle with officers outside a bar where he had fought with a bouncer, and his name became a rallying cry against police shootings in Los Angeles. Both Glenn and Proctor are Black. The office of current LA District Attorney Nathan Hochman said in a statement that the indictment comes after the previous district attorney, George Gascón, reexamined four use-of-force cases involving law enforcement officers, including Proctor's case. Hochman, who ousted Gascón in November's election, will review the case and decide whether to proceed with the prosecution, the statement said. Proctor's lawyer, Anthony \"Tony\" Garcia, questioned the timing of the charges and noted that prosecutors declined to charge his client in 2018, according to the Times. In 2018, LA District Attorney Jackie Lacey declined to press charges, saying there was insufficient evidence to prove Proctor acted unlawfully when he used deadly force. Glenn was on his stomach and trying to push himself up when Proctor shot him in the back, according to police. He wasn't trying to take a gun from Proctor or his partner when he was shot, and Proctor's partner told investigators that he didn't know why the officer opened fire, police have said. Proctor resigned from the Los Angeles Police Department in 2017. The city paid $4 million to settle a wrongful-death lawsuit that was brought by Glenn's relatives. Proctor, 60, remains in jail. His next court date is Nov. 3.",
            "media_url": "https://cdn.abcotvs.com/dip/images/18074241_102425-kabc-6pm-venice-OIS-STRINGER-vid.jpg?w=1600",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.017,
                "neg": 0.125,
                "neu": 0.857
            },
            "source": {
                "id": "abc7",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "3616e132-d994-48a3-95f9-3c8b7208401d",
            "title": "Woman raped in racially aggravated attack, say police",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/news/articles/c77zvj267yko?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "det supt ronan tyrer",
                "phil dolby",
                "investigating",
                "suspiciously",
                "neighbouring",
                "absolutely appalling attack",
                "racially aggravated attack",
                "said specialist officers"
            ],
            "topics": [
                "crime",
                "violence",
                "assault",
                "racism"
            ],
            "description": "Woman raped in racially aggravated attack, say police",
            "pub_date": "2025-10-26T19:05:54",
            "creator": "BBC News",
            "content": "A woman in her 20s has been raped in what police have called a racially aggravated attack. West Midlands Police were called to the Park Hall area of Walsall at about 19: 15 BST on Saturday, and said the woman had been attacked at a nearby property by a man she did not know. The attacker is described as white, in his 30s, with short hair and dark clothing, and officers have released CCTV of the suspect. The force said specialist officers had been working since the attack to recover video, speak to witnesses and identify the suspect. Det Supt Ronan Tyrer described it as \"an absolutely appalling attack on a young woman\", and said police were doing all they could to arrest the man responsible. \"While we are following multiple lines of enquiry right now, it's vital that we get to hear from anyone who saw a man acting suspiciously in the area at the time,\" he added. Separately, the force is also investigating the rape of a Sikh woman in neighbouring Sandwell. Police said they were not linking the latest attack to other offences. Ch Supt Phil Dolby, of Walsall Police, said: \"Walsall is a diverse area, and we know the fear and concern that this awful attack will cause in our communities.\" Officers have appealed for witnesses and those with information to get in touch.",
            "media_url": "https://ichef.bbci.co.uk/news/1024/branded_news/fc01/live/3ccd1c10-b29d-11f0-9168-63ff16bdf551.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fc01/live/3ccd1c10-b29d-11f0-9168-63ff16bdf551.png",
            "language": "en",
            "sentiment": {
                "pos": 0.029,
                "neg": 0.201,
                "neu": 0.77
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "7d99c1d1-15ec-46f8-bbc3-037997d54f43",
            "title": "Sid Davis, Reporter Who Witnessed Johnson’s Swearing-In, Dies at 97",
            "source_title": "The New York Times",
            "source_link": "https://www.nytimes.com",
            "article_link": "https://www.nytimes.com/2025/10/26/obituaries/sid-davis-dead.html",
            "keywords": [
                "sid davis",
                "john f kennedy",
                "air force one",
                "president",
                "journalism",
                "assassination"
            ],
            "topics": [
                "politics",
                "media"
            ],
            "description": "A veteran journalist, he covered the assassination of President John F. Kennedy and provided the pool report on the ceremony aboard Air Force One.",
            "pub_date": "2025-10-26T18:59:28",
            "creator": "Robert D. McFadden",
            "content": null,
            "media_url": "https://static01.nyt.com/images/2022/03/01/obituaries/00davis_sid/00davis_sid-mediumSquareAt3X.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "the-new-york-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "01124dc8-f3cd-42b6-8110-dac5c5d5cd51",
            "title": "What are the challenges in forming a stabilisation force in Gaza?",
            "source_title": "Al Jazeera America",
            "source_link": "https://www.aljazeera.com",
            "article_link": "https://www.aljazeera.com/video/inside-story/2025/10/26/what-are-the-challenges-in-forming-a-stabilisation-force-in-gaza?traffic_source=rss",
            "keywords": [
                "donald trump",
                "benjamin netanyahu",
                "stabilisation",
                "international",
                "co-ordinator",
                "international stabilisation force",
                "graduate studies tahani mustafa",
                "foreign relations mehmet celik"
            ],
            "topics": [
                "government",
                "international"
            ],
            "description": "What are the challenges in forming a stabilisation force in Gaza?",
            "pub_date": "2025-10-26T18:58:31",
            "creator": "Al Jazeera America",
            "content": "United States President Donald Trump has said that an international stabilisation force will operate in Gaza soon. But not long after, Israeli Prime Minister Benjamin Netanyahu said Israel can veto which countries take part. So what are the challenges in forming and maintaining such a force? Presenter: Adrian Finighan Guests: Tamer Qarmout Associate professor of public policy at the Doha Institute for Graduate Studies Tahani Mustafa Visiting fellow at the European Council on Foreign Relations Mehmet Celik Editorial co-ordinator at the Daily Sabah newspaper.",
            "media_url": "https://www.aljazeera.com/wp-content/uploads/2025/10/image-1761501627.jpg?resize=1920%2C1061&quality=80",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.04,
                "neg": 0.0,
                "neu": 0.96
            },
            "source": {
                "id": "al-jazeera-america",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "f8586fe0-75f5-474b-9878-0c1021f9cc30",
            "title": "PKL 12: Patna Pirates Continue Fine Run, Reach Eliminator 2 After Ayan's 20-Point Masterclass And Navdeep's High Five",
            "source_title": "Zee News",
            "source_link": "https://zeenews.india.com",
            "article_link": "https://zeenews.india.com/other-sports/pkl-12-patna-pirates-continue-fine-run-reach-eliminator-2-after-ayans-20-point-masterclass-and-navdeeps-high-five-2976603.html",
            "keywords": [
                "patna",
                "pirates",
                "double-digit",
                "twenty-point",
                "registering",
                "continued their sensational",
                "regain their double-digit",
                "thyagaraj indoor stadium"
            ],
            "topics": [
                "sports",
                "entertainment"
            ],
            "description": "Ayan Lohchab led the way yet again with his fifth 20+ points game while Navdeep delivered a High Five for Patna Pirates. For the Pink Panthers, Ali Samadi registered a Super 10 that went down in vain.",
            "pub_date": "2025-10-26T18:58:00",
            "creator": "Zee News",
            "content": "Patna Pirates continued their sensational form with a commanding 48-32 win over Jaipur Pink Panthers in the Eliminator 1 of the Pro Kabaddi League (PKL) 2025 at the Thyagaraj Indoor Stadium on Sunday. Ayan Lohchab led the way yet again with his fifth 20+ points game a feat only Pardeep Narwal and Devank Dalal have achieved in PKL history while Navdeep delivered a High Five. For the Pink Panthers, Ali Samadi registered a Super 10 that went down in vain. While Ayan opened his team’s account, Jaipur Pink Panthers sprung a surprise with Parvinder being sent in for their first raid. Ali Samadi also wasted no time to make his presence felt, but that was before a tackle from Ankit Jaglan gave the Pirates an opening. Ayan followed that up with a two-point raid, and it only took his side five minutes to inflict their first ALL OUT. With a seven-point deficit, tackles from Vinay and Reza Mirbagheri along with Ali Samadi’s raid helped the Pink Panthers stay in the game. However, Ayan and Milan Dahiya kept the scoreboard ticking with Ankit Jaglan also registering his second tackle, keeping the Pirates in a 13-6 lead after the first ten minutes. They further asserted their dominance with a second ALL OUT in fourteen minutes, courtesy a tackle from Navdeep. To make matters worse for the two-time champions, the Pirates raiders also piled on the pressure with Ayan completing his Super 10 and Milan Dahiya inflicting a third ALL OUT at the stroke of half time, giving their team a massive 17-point lead (30-13) at the break. ALSO READ: Abhishek Nayar To Stephen Fleming: Head Coaches Of RCB, CSK, MI, KKR, PBKS, GT, LSG, DC, RR, SRH Ahead Of IPL 2026 Auction Check In Pics Jaipur Pink Panthers came flying off the blocks at the start of the second half. Ali Samadi found his groove, while their defence stepped up with Deepanshu Khatri and Aryan Kumar taking the score to 30-18. They contributed with a couple of tackles, while Vinay also chipped in to bring the deficit down to ten points heading into the final quarter. Aryan Kumar’s third tackle of the night brought the deficit down to eight points, before a tackle from Navdeep helped the Pirates regain their double-digit lead. The defender also completed his High Five, ensuring that his team stayed in the driver’s seat. However, Ali Samadi continued to fight for the Pink Panthers, keeping them in the game with the score at 39-28. With less than four minutes to go, Ayan delivered the decisive blow on a Do-Or-Die Raid, getting two-points to establish a 41-29 advantage. He also climbed to the top of the charts for the most raid points in PKL 12 (275), registering his fifth twenty-point game of PKL 12 and helping the Pirates execute a fourth ALL OUT to complete a thumping 47-32 victory.",
            "media_url": "https://english.cdn.zeenews.com/sites/default/files/2025/10/27/1852117-patna-pirates-continue-fine-run-reach-eliminator-2.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.09,
                "neg": 0.057,
                "neu": 0.853
            },
            "source": {
                "id": "zee-news",
                "country": "IN",
                "political_leaning": "right",
                "reliability_score": 6.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "80633806-32f7-4be6-ba8b-9561c8332247",
            "title": "Labour must counter ‘growing sense of despair’, Streeting warns after Welsh defeat",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/politics/2025/oct/26/labour-growing-sense-of-despair-wes-streeting",
            "keywords": [
                "wes streeting",
                "labour",
                "disillusionment",
                "demonstrating",
                "intervention",
                "widespread disillusionment within",
                "privately described streeting",
                "to widespread disillusionment"
            ],
            "topics": [
                "politics",
                "economy",
                "government"
            ],
            "description": "Health secretary urges party to take Caerphilly result to heart as Lucy Powell gets to work as deputy leaderSenior Labour figures including Wes Streeting have said the government must project optimism and delivery after losing a Welsh Senedd byelection amid rising concern about midterm fatigue and a loss of momentum. The health secretary warned that the party must counter a “growing sense of despair” and show voters tangible proof of change after its defeat last week in Caerphilly, a town that had been Labour for more than 100 years.",
            "pub_date": "2025-10-26T18:54:49",
            "creator": "Aletha Adu and Geraldine McKelvie",
            "content": "Senior Labour figures including Wes Streeting have said the government must project optimism and delivery after losing a Welsh Senedd byelection amid rising concern about midterm fatigue and a loss of momentum. The health secretary warned that the party must counter a “growing sense of despair” and show voters tangible proof of change after its defeat last week in Caerphilly, a town that had been Labour for more than 100 years. Streeting’s intervention comes as Labour’s new deputy leader, Lucy Powell, begins her first week in the role. Powell has promised to give members a stronger voice inside government after a low-turnout contest that followed the departure of Angela Rayner. Powell said the government must listen to its members instead of being guided by a “narrow group of voices” as it battles to stave off electoral disaster in next May’s local elections. Powell defeated the education secretary, Bridget Phillipson, in the deputy leadership contest, which concluded on Saturday. She said she had been given “a clear mandate that members want their voice to be heard at the top of the party”. The Manchester Central MP won 54% of the vote, polling 87, 407 votes, while Phillipson received 73, 536. Turnout was just 16. 6%, which some Labour insiders say points to widespread disillusionment within the party. While Powell’s allies have repeatedly said she intends to focus on connecting the party’s grassroots to its delivery agenda, several MPs have questioned how much authority she can hold in practice. Party insiders say Powell’s job should be to “complement the leader, not compete with him, but still be a voice for members and the wider movement”, a plan that echoes Alan Johnson’s recent remarks that the deputy must balance loyalty with authenticity. In Caerphilly, Labour finished third behind Plaid Cymru and Reform, receiving just 11% of the vote in seat it had held since the creation of the Welsh Senedd in 1999. Streeting said on Sunday that the result should be treated like the 2021 Hartlepool byelection, urging colleagues to “take the result on the chin and take it to heart” while demonstrating the same urgency in office as Keir Starmer had displayed when rebuilding Labour in opposition. “The worst thing you can do after a result like this is pretend the voters were sending a different message,” he told the BBC. “We’ve got to tell a more compelling story about who we are, who we’re for and what it is we’re driving to do.” Streeting said that while the government had achieved some successes on NHS waiting times, childcare and falling interest rates, “people are not yet feeling the change”. He said Labour had to “rebuild trust in politics” by showing the same “pace and scale of ambition that meant we were able to win a general election that no one thought we could win”. Several Labour MPs privately described Streeting’s language as “pointed”, saying it reflected the first public signs of anxiety about Starmer’s political direction. One said: “It’s loyalty with a warning label Wes is saying get a grip.” Other Labour figures privately echoed his warning, describing the Caerphilly result as a signal that the party’s coalition of voters was beginning to fray. “There’s a danger in learning the wrong lessons,” one said. “We need to speak better to our values with positive, progressive messaging that plays up the good things we’re doing.” A Labour source noted: “The rightward part of our voter coalition can’t be squeezed either we have to do more on cost of living and reassure people on borders.” Another senior figure said Labour’s challenge was not ideological but almost emotional. “We’ve stopped sounding like a party that means change,” they said. “We can’t look tired this early, people need to feel hope again.” The comments reflect growing unease about the pace of delivery just 15 months into power, with ministers aware that economic pressures and rising household costs have dampened public confidence in the party’s promise of renewal. One long-serving MP said: “Caerphilly’s not a crisis . yet. But if we shrug it off, it will be.” Powell, who was sacked as Commons leader by Starmer in September, said she would get to work straight away to shore up Labour’s support before local elections next May. She said the party needed to be clearer about its successes in office. She said: “I’m not writing off any elections next year. These are important elections in Wales, in Scotland, in London and right around the country.” Powell said party members had not felt as included and connected as they should have in recent months and that she was aiming to change that. “I’m going to really help to do that, to re-engage with the party and make them feel part of the conversation again. I’ll do that through working with Keir, working with government, working right across the party in the leadership roles that I will have.”.",
            "media_url": "https://i.guim.co.uk/img/media/f90363eefea93cc821543d1360778e8f9b10652a/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=1e5c907801dedc79cb18451a836e407a",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Jordan Pettitt/PA",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.102,
                "neg": 0.063,
                "neu": 0.835
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "330b629b-e4e9-4c02-8a54-a25085d4ba7a",
            "title": "Graham says land strikes in Venezuela are a \"real possibility\"",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/lindsey-graham-venezuela-land-strikes-face-the-nation/",
            "keywords": [
                "venezuelan",
                "pacific ocean",
                "commander-in-chief",
                "narco-terrorists",
                "administration",
                "receive congressional approval",
                "potential military operations",
                "airstrikes against venezuelan"
            ],
            "topics": [
                "politics",
                "international",
                "government",
                "military"
            ],
            "description": "The U. S. has carried out several air strikes on Venezuelan vessels that the Trump administration has accused of carrying drugs and cartel members.",
            "pub_date": "2025-10-26T18:49:36",
            "creator": "CBS News",
            "content": "As the U. S. has been carrying out airstrikes against Venezuelan and Colombian vessels in the Caribbean and Pacific Ocean that the Trump administration has accused of carrying drugs and cartel members, Republican Sen. Lindsey Graham said Sunday that land strikes in Venezuela a significant escalation are a \"real possibility. I think President Trump's made a decision that [Nicolas] Maduro, the leader of Venezuela, is an indicted drug, drug trafficker, that it's time for him to go, that Venezuela and Colombia have been safe havens for narco-terrorists for too long, and President Trump told me yesterday that he plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia,\" Graham said Sunday on \"Face the Nation with Margaret Brennan.\" Mr. Trump suggested last week that land strikes are \"going to be next,\" saying on Thursday that \"the drugs coming in by sea are like 5% of what they were a year ago\" due to the strikes. Mr. Trump did not offer any evidence to back up this claim, and members of Congress have also said the administration hasn't provided sufficient evidence that the targeted vessels are carrying drugs. As of Friday, at least 43 people have been killed in the U. S. strikes in the Caribbean and eastern Pacific that have occurred on 10 vessels since Sept. 2. Last week, the Colombian government called on the U. S. \"to respect the norms dictated by international law\" and cease the strikes. Graham on Sunday said there will be a Congressional briefing on land strikes, not an invasion, although he also called for the removal of Venezuelan leader Nicolas Maduro. Graham repeatedly cited former President George H. W. Bush's invasion of Panama in 1989, saying the Bush administration didn't receive Congressional approval for that mission. \"Bush 41 went into Panama to replace the leadership there, because the Panama leadership, Panamanian leadership, were working with drug cartels to threaten our country,\" Graham said. Although the U. S. Constitution grants Congress the sole authority to declare war, Graham repeatedly said he is confident the Trump administration has the authority to carry out the strikes. Democrats and even some Republicans have criticized the White House's action. \"To the other senators, you deserve more information, and you're going to get more information, but there is no requirement for Congress to declare war before the commander-in-chief can use force,\" Graham said. \"Panama and Grenada are two examples in our backyard, where Republican presidents chose to go after countries and leaders that were threatening our people.\" Democratic Sen. Ruben Gallego of Arizona said Sunday on NBC's \"Meet the Press\" that the Trump administration's actions in the Caribbean are \"murder. If this president feels that they're doing something illegally, then he should be using the Coast Guard,\" Gallego said. \"If it's an act of war, then you use our military, and then you come and talk to us first. But this is murder. It's sanctioned murder that he is doing.\" Graham pushed back against Gallego's remarks, saying on Sunday that \"this is not murder. This is protecting America from being poisoned by narco-terrorists coming from Venezuela and Colombia.\".",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/042a0e35-1cf6-4705-b51b-223fe23dded8/thumbnail/1200x630/8efde0393c437c5ebfde795a4f031a5b/1761495726600.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.026,
                "neg": 0.084,
                "neu": 0.89
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "6d817674-8a15-4543-a479-e11979de9afc",
            "title": "Pep Guardiola refuses to panic after Arsenal open up six-point lead",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/football/2025/oct/26/pep-guardiola-refuses-to-panic-after-arsenal-open-up-six-point-lead",
            "keywords": [
                "pep",
                "guardiola",
                "congratulations",
                "international",
                "unfortunately",
                "test against bournemouth",
                "international break when",
                "third successive season"
            ],
            "topics": [
                "football",
                "economy",
                "business",
                "sports"
            ],
            "description": "Manager says City are in title hunt despite Villa defeatErling Haaland’s injury not expected to be seriousPep Guardiola said it was too early for Manchester City to fret about Arsenal’s superb start to the Premier League season, and that his team were alive in their pursuit of reclaiming the title despite a 1-0 defeat at Aston Villa on Sunday. City trail Arsenal by six points after nine games but Guardiola is relaxed about the gap. “We have to try to close [it], Arsenal have been solid for many years, this time the concern is how we can improve better, better, better and to be close,” the City manager said.",
            "pub_date": "2025-10-26T18:48:17",
            "creator": "Ben Fisher at Villa Park",
            "content": "Pep Guardiola said it was too early for Manchester City to fret about Arsenal’s superb start to the Premier League season, and that his team were alive in their pursuit of reclaiming the title despite a 1-0 defeat at Aston Villa on Sunday. City trail Arsenal by six points after nine games but Guardiola is relaxed about the gap. “We have to try to close [it], Arsenal have been solid for many years, this time the concern is how we can improve better, better, better and to be close,” the City manager said. “From my experience it [the season] is so long. So long. This is my experience. There are many teams there and we have a good test against Bournemouth [next weekend], who are doing very well. We will try to do our game. “I was worried before the [September] international break when we were 14th in the table and they were seven or eight points in front. Our job is not to look at the table. If they win all their games and win the Premier League, congratulations to them, that’s all we can do. But I have the feeling the team is alive, the team is good.” Guardiola, whose side travel to Swansea in the Carabao Cup fourth round on Wednesday night, added: “I don’t know how many teams can come here and play the way we played, with the courage, possession and chances. We have to be stable with that. I don’t live in October and November thinking: ‘Oh what is going to happen if we don’t win the Premier League?’ So it’s game by game now.” City lost at Villa for the third successive season as Erling Haaland, who has 11 league goals this season, failed to score for the first time in 13 matches. Guardiola pointed to the quality of Unai Emery’s side. “They are a Champions League team unfortunately they are not there this season but they are a top, top team and compete very well,” he said. “I admire them.” Haaland, who has 24 goals for club and country this season, clattered a post as he converted Omar Marmoush’s cross with a minute of normal time remaining but was offside. The Norway striker played on and Guardiola played down fears over a potential injury. “Hopefully he’s fine,” the manager said. “I didn’t speak with him.”.",
            "media_url": "https://i.guim.co.uk/img/media/f0bc2e5bd93530026801f826dcd0f2d2826a2055/293_0_3008_2406/master/3008.jpg?width=140&quality=85&auto=format&fit=max&s=f87a27619926c4fdc4a82a7d5526cec1",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Adam Vaughan/EPA",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.21,
                "neg": 0.044,
                "neu": 0.746
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "8426567f-2d52-423a-ba37-7050ed734853",
            "title": "Micky van de Ven at the double as Tottenham end Everton’s unbeaten home record",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/micky-van-de-ven-everton-thomas-frank-randal-kolo-muani-paris-st-germain-b2852552.html",
            "keywords": [
                "micky",
                "ven",
                "uncharacteristically",
                "miscontrolled",
                "centre-backs",
                "were uncharacteristically undone",
                "positions sandwiching guglielmo",
                "uncharacteristically undone at"
            ],
            "topics": [
                "sports",
                "football"
            ],
            "description": "Micky van de Ven at the double as Tottenham end Everton’s unbeaten home record",
            "pub_date": "2025-10-26T18:46:52",
            "creator": "Carl Markham",
            "content": "Captain Micky van de Ven led from the front with two headers to inflict Everton’s first defeat at their new stadium as Tottenham moved into third with a 3-0 victory. David Moyes’ side went from conceding no league goals from corners to two in the first half as the visitors profited firstly from a good set-piece routine and then from woeful marking. Spurs boss Thomas Frank handed on-loan Paris St Germain striker Randal Kolo Muani his first start but Van de Ven provided the biggest threat with his double putting him out in front as the team’s top scorer with five, having failed to score at all last season. Those goals plus another late header from Pape Sarr secured a 13th point from a possible 15 on the road, form which has provided the platform for their rise to within five points of leaders and north London rivals Arsenal. It was a strange performance from Tottenham as after taking a 19th-minute lead they went into their shell and barely suggested they would threaten again until their captain struck once more in first-half added time. But while Spurs made the most of their chances the home side did not despite having plenty of creativity on either wing from Iliman Ndiaye, comfortably their best player, and the returning Jack Grealish. Both players found themselves facing two opponents whenever they got the ball and while Ndiaye’s pace saw him get in behind a couple of times, there was little in the way of danger in the middle. The closest they came was when striker Beto miscontrolled Ndiaye’s cross to Grealish, whose goalbound shot was blocked almost on the line by Pedro Porro in just the third minute. A team who have scored nine league goals this season need those chances to go in and when they do not it makes winning games that much more difficult. They were uncharacteristically undone at a corner when Mohammed Kudus’ cross to the far post was diverted back across goal by Rodrigo Bentancur’s shoulder and Van de Ven nodded in from close range. Everton proceeded to dominate and were denied an equaliser when Jake O’Brien’s near-post header was ruled out after VAR suggested Ndiaye and Grealish, both in offside positions sandwiching Guglielmo Vicario, were interfering with the goalkeeper and referee Craig Pawson agreed after reviewing the footage. Despite creating little from open play Spurs continued to look dangerous at set-pieces and after Bentancur headed over one corner, Van de Ven made no mistake from another after finding himself unmarked between Everton’s two centre-backs. Everton had conceded as many in 52 minutes after seven added on as they had in their previous five matches at Hill Dickinson Stadium and their goalscoring record suggested the game was as good as done. Ndiaye did his best to not make it a formality, flicking one shot wide and having another deflected effort tipped around a post either side of crossing for Beto’s overhead kick to be clawed out by the impressive Vicario. Jordan Pickford saved well from former Everton forward Richarlison, on for Kolo Muani, in a rare Spurs foray but faced with an attack now being led by 23-year-old Thierno Barry yet to open his account since his £27million move from Villarreal scoring further goals was not a concern for the visitors. But Sarr hastened the emptying of seats by nodding home after being teed up by Richarlison in the 89th minute.",
            "media_url": "https://static.independent.co.uk/2025/10/26/18/d8c359e530f94c38a69f077c98617f6dY29udGVudHNlYXJjaGFwaSwxNzYxNTg5ODQx-2.82163797.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.093,
                "neg": 0.097,
                "neu": 0.809
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "e0fb37c4-c811-4f59-9041-a1eafa860a97",
            "title": "ICC Women's ODI World Cup 2025: India, Bangladesh Share Points After Rain Plays Spoilsport",
            "source_title": "Zee News",
            "source_link": "https://zeenews.india.com",
            "article_link": "https://zeenews.india.com/cricket/icc-womens-odi-world-cup-2025-india-bangladesh-share-points-after-rain-plays-spoilsport-2976602.html",
            "keywords": [
                "bangladesh",
                "patil sports stadium",
                "breakthroughs",
                "bottom-placed",
                "table-toppers",
                "pratika rawal suffers ankle injury ahead",
                "bottom-placed pakistan despite",
                "bangladesh eventually posted"
            ],
            "topics": [
                "sports",
                "weather"
            ],
            "description": "India's match against Bangladesh had to be called off due to rain. Hosts will now take on table-toppers Australia in the second semi-final on October 30.",
            "pub_date": "2025-10-26T18:46:00",
            "creator": "Zee News",
            "content": "India's ICC Women's ODI World Cup clash against Bangladesh ended without a result after rain forced an end at the Dr DY Patil Sports Stadium in Navi Mumbai on Sunday. The result meant that India finished their campaign in fourth position with seven points in as many games while Bangladesh finished above bottom-placed Pakistan despite being tied on points. With the group stage wrapped up, attention now turns to the semi-finals where England face South Africa on October 29 in Guwahati while India take on table-toppers Australia in the second semi-final on October 30 in Navi Mumbai. Chasing a revised DLS target of 126 in 27 overs, India were comfortably placed before the weather intervened once again. Smriti Mandhana, opening with Amanjot Kaur gave India a strong start, putting on 57/0 in 8. 4 overs during the chase before rain returned to wash out the game. ALSO READ: Big Blow To India ! Pratika Rawal Suffers Ankle Injury Ahead Of ICC Women's ODI World Cup 2025 Semi-Final Against Australia Earlier, after Harmanpreet Kaur chose to bowl first, a delay caused by rain reduced the match to 43 overs per side. The visitors never quite recovered and when another downpour hit midway through their innings, the game was further shortened to 27 overs a side. Bangladesh eventually posted 119/9 but regular wickets kept them in check as India’s bowlers produced a fine performance. The standout performer with the ball for India was Radha Yadav, who made an immediate impact in her first match of the tournament, finishing with three wickets (3/30) while Sree Charani (2/23) while Deepti Sharma, Renuka Thakur, Amanjot Kaur chipped in crucial wickets. Sharmin Akter (36) top-scored for the visitors while Sobhana Mostary (26) offered some resistance but the rest of the lineup struggled as India kept applying pressure with regular breakthroughs. After Nigar Sultana Joty’s dismissal, Bangladesh looked to rebuild through a 38-run stand between Sharmin Akter and Mostary which steadied the innings. However, once that partnership was broken, India ran through the middle and lower order, reducing Bangladesh from 91/3 to 117/9 in no time with Yadav playing a big part in the collapse. India, however, suffered an injury scare when Pratika Rawal twisted her ankle while fielding in the deep. The opener had to be helped off the field. India Playing XI: Pratika Rawal, Smriti Mandhana, Harleen Deol, Jemimah Rodrigues, Harmanpreet Kaur (c), Deepti Sharma, Uma Chetry (wk), Amanjot Kaur, Radha Yadav, Shree Charani, Renuka Singh Thakur.",
            "media_url": "https://english.cdn.zeenews.com/sites/default/files/2025/10/27/1852108-india-bangladesh-share-points-after-rain-plays-spoilsport.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.025,
                "neg": 0.093,
                "neu": 0.883
            },
            "source": {
                "id": "zee-news",
                "country": "IN",
                "political_leaning": "right",
                "reliability_score": 6.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "af9fa3da-0248-4e2d-84b3-b70ba5969485",
            "title": "Jon Bon Jovi returns to stage after career-threatening vocal injury",
            "source_title": "Channel 4 News",
            "source_link": "https://www.channel4.com",
            "article_link": "https://www.channel4.com/news/jon-bon-jovi-returns-to-stage-after-career-threatening-vocal-injury",
            "keywords": [
                "jon bon jovi",
                "increasingly",
                "diagnosed",
                "extensive",
                "increasingly polarised america",
                "an increasingly polarised",
                "and extensive recovery",
                "after major surgery"
            ],
            "topics": [
                "music",
                "entertainment",
                "health",
                "medical"
            ],
            "description": "Just three years ago the rock legend Jon Bon Jovi was diagnosed with a vocal chord injury which could have ended his career. But after major surgery, and extensive recovery he's back with a tour planned for 2026.",
            "pub_date": "2025-10-26T18:45:05",
            "creator": "Amelia Jenne",
            "content": "Just three years ago the rock legend Jon Bon Jovi was diagnosed with a vocal chord injury which could have ended his career. But after major surgery, and extensive recovery he’s back with a tour planned for 2026. His 40 year career has taken him from his working class home in New Jersey to global superstar. We spoke to him about the politics of class and identity in an increasingly polarised America and what it’s like to be back on stage.",
            "media_url": "https://fournews-assets-prod-s3-ew1-nmprod.s3.amazonaws.com/media/2025/10/Screenshot-2025-10-26-184044-1540x861.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.04,
                "neg": 0.023,
                "neu": 0.937
            },
            "source": {
                "id": "channel-4-news",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "62c5194a-fce2-4d6f-89d1-eec63831329d",
            "title": "Van de Ven at the double as Tottenham cruise to victory against Everton",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/football/2025/oct/26/everton-tottenham-premier-league-match-report",
            "keywords": [
                "tottenham",
                "thomas frank",
                "centre-forward",
                "dewsbury-hall",
                "enterprising",
                "hapless centre-forward failed",
                "brought everton plummeting",
                "another close-range header"
            ],
            "topics": [
                "sports",
                "football"
            ],
            "description": "Tottenham’s aerial prowess under Thomas Frank brought Everton plummeting back to earth at Hill Dickinson Stadium. Spurs inflicted Everton’s first defeat at their new home courtesy of three headed goals, two from the outstanding Micky van de Ven, to rise to third in the Premier League and maintain their dominant form on the road. The disconnect at the Tottenham Hotspur Stadium stands in stark contrast to the ruthless efficiency of Frank’s team away from home. Van de Ven converted two corners before substitute Pape Matar Sarr banished any prospect of an Everton recovery with another close-range header in the 89th minute. Given the glaring absence of a quality striker in David Moyes’ squad, the prospect of an Everton comeback was always remote despite the probings of Iliman Ndiaye, James Garner, Kiernan Dewsbury-Hall and Jack Grealish. It is now 13 points from a possible 15 for Frank’s side on their travels this season.",
            "pub_date": "2025-10-26T18:44:55",
            "creator": "Andy Hunter at Hill Dickinson Stadium",
            "content": "Tottenham’s aerial prowess under Thomas Frank brought Everton plummeting back to earth at Hill Dickinson Stadium. Spurs inflicted Everton’s first defeat at their new home courtesy of three headed goals, two from the outstanding Micky van de Ven, to rise to third in the Premier League and maintain their dominant form on the road. The disconnect at the Tottenham Hotspur Stadium stands in stark contrast to the ruthless efficiency of Frank’s team away from home. Van de Ven converted two corners before substitute Pape Matar Sarr banished any prospect of an Everton recovery with another close-range header in the 89th minute. Given the glaring absence of a quality striker in David Moyes’ squad, the prospect of an Everton comeback was always remote despite the probings of Iliman Ndiaye, James Garner, Kiernan Dewsbury-Hall and Jack Grealish. It is now 13 points from a possible 15 for Frank’s side on their travels this season. The contest was shaped by corners and Van de Ven’s domineering presence at both ends of the pitch. Everton matched Spurs for enterprising approach work but had no answer to the quality of the visitors’ set-piece delivery or their captain’s aerial strength. The boos that greeted the half-time whistle were aimed squarely at referee Craig Pawson, however. Grealish almost started where he left off last time out at Hill Dickinson Stadium by putting Everton ahead from close range. The superb Ndiaye scorched past Djed Spence to set up Beto but, after the hapless centre-forward failed to connect, Grealish arrived at the back post and saw a goal-bound drive blocked in front of the line by Pedro Porro. Dewsbury-Hall sliced the loose ball high and wide. Rodrigo Bentancur and Xavi Simons both troubled the Everton defence as an open, flowing game allowed the respective midfields to impress. But it was a central defender who took centre stage. From a Mohammed Kudus corner swept high to the back post, Bentancur directed the ball back across goal with his shoulder for Van de Ven to nod in from a yard out. It was the first goal Everton have conceded from a set piece all season and Spurs’ first attempt on target. It became two set-piece goals conceded in first-half stoppage time when the visitors’ accuracy under Frank punished Moyes’ team again. Porro was the provider, this time from the left with a brilliant, vicious corner that demanded a finish. Van de Ven applied it once the inswinging delivery sailed over James Tarkowski and before Jordan Pickford’s fists could connect. The defender’s two first-half headers must have come from a combined distance of two yards out. Spurs’ second arrived during seven minutes of time added on mainly for the decision to disallow a towering header by Jake O’Brien moments after Van de Ven’s opener. The Everton defender thought he had equalised from another fine corner, taken by Dewsbury-Hall, and a header that gave Guglielmo Vicario no chance in the Spurs’ goal. Everton celebrations were diluted when the video assistant referee advised Pawson to inspect the pitch-side monitor. They were spoiled completely when the match official deemed that Ndiaye and Grealish were both offside and interfering with Vicario. The pair were clearly in an offside position when O’Brien connected but the extent to which they interfered with the goalkeeper was highly debatable. Pawson’s on-field explanation was inaudible amid the jeers that drowned him out. Everton responded well to the blows, particularly after the restart. Beto, who failed to read an inviting cross across the face of goal from Ndiaye in the first half, almost atoned with an overhead kick from the Senegal international’s cross. Vicario produced an excellent reflex save to deny the No 9. Spurs’ commitment to a clean sheet was exemplified by João Palhinha throwing himself in the way of Idrissa Gueye’s volley late on. Richarlison should have extended the visitors’ lead when a long ball caught out Tarkowski and left him through on goal, but Pickford spread himself well to thwart the former Everton striker. Richarlison was heavily involved in Spurs’ third, however, cushioning a header from another accurate Porro centre back across goal for Sarr to head beyond Pickford.",
            "media_url": "https://i.guim.co.uk/img/media/c9322baa49763e1ee9bbfc652262eed0ee6fa828/506_0_3483_2786/master/3483.jpg?width=140&quality=85&auto=format&fit=max&s=93e52ec252748e0e72922d18f891de72",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Paul Currie/Tottenham Hotspur FC/Shutterstock",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.086,
                "neg": 0.064,
                "neu": 0.85
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "184bbe00-c39d-4927-9bfa-e8696ac7352d",
            "title": "Pereira understands Wolves fans&#8217; 'frustration' after angry confrontation",
            "source_title": "Sky News",
            "source_link": "https://news.sky.com",
            "article_link": "https://news.sky.com/story/vitor-pereira-wolves-boss-understands-fans8217-8216frustration8217-after-angry-confrontation-following-burnley-defeat-13458395",
            "keywords": [
                "Wolves",
                "Vitor Pereira",
                "fans",
                "confrontation",
                "defeat",
                "Burnley"
            ],
            "topics": [
                "sports",
                "frustration",
                "fans",
                "conflict",
                "team"
            ],
            "description": "Vitor Pereira implored Wolves fans to stay behind the team after he clashed with supporters following their 3-2 defeat to Burnley.",
            "pub_date": "2025-10-26T18:43:00",
            "creator": "Sky News",
            "content": null,
            "media_url": "https://e3.365dm.com/25/10/1920x1080/skysports-vitor-pereira-wolves_7062960.jpg?20251026164308",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://e3.365dm.com/25/10/1920x1080/skysports-vitor-pereira-wolves_7062960.jpg?20251026164308",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "sky-news",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "31161159-7a42-443b-a591-a83027777d04",
            "title": "US captain Tyler Adams on diversity, politics and a home World Cup",
            "source_title": "Channel 4 News",
            "source_link": "https://www.channel4.com",
            "article_link": "https://www.channel4.com/news/us-captain-tyler-adams-on-diversity-politics-and-a-home-world-cup",
            "keywords": [
                "captain tyler adams",
                "captaining",
                "politics",
                "football",
                "adams about politics",
                "and what captaining",
                "captaining a world"
            ],
            "topics": [
                "politics",
                "worldcup",
                "captain",
                "home"
            ],
            "description": "It's just eight months until the FIFA World Cup is held across the United States, Canada and Mexico, and the US Men's Captain Tyler Adams is focused on the prize.",
            "pub_date": "2025-10-26T18:41:45",
            "creator": "Jordan Jarrett-Bryan",
            "content": "It’s just eight months until the FIFA World Cup is held across the United States, Canada and Mexico, and the US Men’s Captain Tyler Adams is focused on the prize. We spoke to Adams about politics as well as football and what captaining a World Cup on home soil means to him.",
            "media_url": "https://fournews-assets-prod-s3-ew1-nmprod.s3.amazonaws.com/media/2025/10/Screenshot-2025-10-26-183307-1539x868.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.187,
                "neg": 0.0,
                "neu": 0.813
            },
            "source": {
                "id": "channel-4-news",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "a501d097-c6be-4bb4-a346-9cdda19d6d29",
            "title": "Shaquille O'Neal's custom Range Rover stolen while being shipped to Louisiana",
            "source_title": "ABC11",
            "source_link": "https://abc11.com",
            "article_link": "https://abc7chicago.com/post/shaquille-oneals-custom-range-rover-stolen-being-transported-southern-california-louisiana/18073983/",
            "keywords": [
                "range rover",
                "shipping",
                "louisiana"
            ],
            "topics": [
                "crime",
                "theft"
            ],
            "description": "A $180,000 Range Rover belonging to Shaquille O'Neal was reportedly stolen while it was being transported.",
            "pub_date": "2025-10-26T18:38:41",
            "creator": "KABC",
            "content": "LOS ANGELES -- A $180,000 Range Rover belonging to Shaquille O'Neal was reportedly stolen while it was being transported from Southern California to Louisiana. Authorities said the 2025 Land Rover Range Rover was being sent to Baton Rouge, Louisiana, when it was stolen. The SUV was sold to the former Lakers star at Effortless Motors in Riverside. The auto transportation company says it was hit by a \"sophisticated cyber-attack.\" The Range Rover never arrived at its destination, according to reports. Effortless Motors is offering a $10,000 reward for information leading to the recovery of the vehicle.",
            "media_url": "https://vcl.abcotv.net/video/kabc/102625-kabc-5a-shaq-SUV-stolen-vid.mp4",
            "media_type": "video/mp4",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://cdn.abcotvs.com/dip/images/18073532_102625-kabc-shaq-generic-clean-AP-TN-img.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.071,
                "neg": 0.062,
                "neu": 0.867
            },
            "source": {
                "id": "abc11",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "06a885bf-5995-45e7-9dda-b44371efce36",
            "title": "Trump administration posts notice that no federal food aid will go out Nov. 1",
            "source_title": "ABC News",
            "source_link": "https://abcnews.go.com",
            "article_link": "https://abcnews.go.com/US/wireStory/trump-administration-posts-notice-federal-food-aid-nov-126880427",
            "keywords": [
                "federal food aid",
                "government shutdown",
                "november 1st"
            ],
            "topics": [
                "government",
                "economy",
                "shutdown",
                "food",
                "aid"
            ],
            "description": "The U.S. Department of Agriculture has posted a notice on its website saying federal food aid will not go out Nov. 1 as the government shutdown drags on",
            "pub_date": "2025-10-26T18:37:54",
            "creator": "ABC News",
            "content": null,
            "media_url": "https://i.abcnewsfe.com/a/f11a5569-f6f3-4faf-94f6-cbcfa6a0fb0c/wirestory_8a52a63b26a707ea676962226b090bb1_16x9.jpg?w=1600",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://s.abcnews.com/images/US/wirestory_8a52a63b26a707ea676962226b090bb1_4x3_384.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "abc-news",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0351f143-3130-43e7-920f-2164cd910572",
            "title": "Full transcript of \"Face the Nation with Margaret Brennan,\" Oct. 26, 2025",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-10-26-2025/",
            "keywords": [
                "margaret brennan",
                "international",
                "economically",
                "congressman",
                "scott bessent house minority leader hakeem jeffries",
                "democratic leader hakeem jeffries",
                "strategic competition between"
            ],
            "topics": [
                "government",
                "media",
                "economy"
            ],
            "description": "On this \"Face the Nation with Margaret Brennan\" broadcast, Treasury Secretary Scott Bessent and House Minority Hakeem Jeffries join Margaret Brennan.",
            "pub_date": "2025-10-26T18:36:50",
            "creator": "CBS News",
            "content": "On this \"Face the Nation with Margaret Brennan\" broadcast, moderated by Margaret Brennan: Treasury Secretary Scott Bessent House Minority Leader Hakeem Jeffries, Democrat of New York Sen. Lindsey Graham, Republican of South Carolina Rep. John Moolenaar, Republican of Michigan Click here to browse full transcripts from 2025 of \"Face the Nation with Margaret Brennan.\" MARGARET BRENNAN: I'm Margaret Brennan in Washington. And this week on Face the Nation: President Trump travels to Asia, hoping to make trade deals with foreign friends and adversaries alike. Treasury Secretary Scott Bessent will be here with breaking news in advance of the much anticipated Trump-Xi meeting. MARGARET BRENNAN: That's it for us today. Thank you all for watching. Until next week. For \"FACE THE NATION,\" I'm Margaret Brennan. (ANNOUNCEMENTS).",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/11116160-d5b8-4a10-b8db-589588fbc654/thumbnail/1200x630/6b7afccb4e5382af71eec42fc4dc797a/1761493365453.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.148,
                "neg": 0.015,
                "neu": 0.837
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "6ebdaf05-0633-4f47-b6e0-9a9814e0ed61",
            "title": "Jorgen Strand Larsen and Vitor Pereira clash with Wolves fans in heated exchange after Burnley defeat",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/jorgen-strand-larsen-wolves-vitor-pereira-fans-b2852544.html",
            "keywords": [
                "vitor pereira",
                "burnley",
                "disappointment",
                "championship",
                "back-to-back",
                "understands the frustration",
                "understand the frustration",
                "disappointment a half-time"
            ],
            "topics": [
                "sports"
            ],
            "description": "Jorgen Strand Larsen and Vitor Pereira clash with Wolves fans in heated exchange after Burnley defeat",
            "pub_date": "2025-10-26T18:36:02",
            "creator": "Sunny Badwal",
            "content": "Wolves boss Vitor Pereira admitted he “understands the frustration” of supporters as they turned on the manager and players after his side suffered a last-minute 3-2 Premier League defeat to Burnley at Molineux. The visitors took a deserved two-goal lead on the half-hour mark, courtesy of a pair of one-touch strikes from Zian Flemming, both assisted by Quilindschy Hartman. Wolves fought back to make it a level game before the break, through Jorgen Strand Larsen’s penalty for his first of the season before Marshall Munetsi nodded in the equaliser. It looked like both sides would take a share of the spoils until Lyle Foster scored in the fifth minute of added time to hand Burnley a first win on the road this season. Molineux turned toxic after the whistle and Pereira went to the fans along with Strand Larsen and exchanged in heated discussions in front of the South Bank, which ended with the Wolves fans chanting “sacked in the morning” at their manager. Pereira said: “What I said is, we worked a lot and need to fight together. The team gave everything on the pitch to win. “We understand the frustration of the people and supporters but what I must say, if we fight united with them, we can win games and compete and achieve our targets without them, it is impossible. “If we win two or three games in a row, things will change. Two months ago they sing my name, because together with the work we did last season, we are competing in the Premier League and not Championship. “Now they sing my name to sack me. If I was a supporter, I feel proud of my team because they worked and showed the spirit, mentality and ambition to win the game, even losing 2-0 (after 30 minutes).” It is the fourth game Wolves have conceded in the late stages and are now rock-bottom of the table with just two points from nine matches. Pereira believes his side’s fortunes can change with just one win though. He added: “Today is a day like in life. Sometimes we have moments, very difficult moments that we need to suffer and what I saw in the dressing room is a team suffering because they did everything to get more. “We need to suffer but tomorrow we need to rise again ready for a fight and this is the mentality of this group. “I believe a win can change everything and feel today was the day but in the end, it was not. We must be ready to fight again and need our supporters again.” Scott Parker saw his side pick up back-to-back wins for the first time this campaign but was not getting ahead of himself. He said: “There was real disappointment a half-time but we reacted in the right way and came out with the three points, which were huge for us. “Back to back wins, we have ticked that box and got a win away from home against a good side, they are a really good side. We can take momentum and confidence from this result. “(There’s a) long way for this season to go and this is just the early stages. “We have been hugely competitive. We earned that today. Old Trafford (against Manchester United), we are in the game. Liverpool at home seconds on the clock coming out with a point. “We have been on the end of little bits and these games are the ones you look at to get points, not to say you look at the other ones not getting points.”.",
            "media_url": "https://static.independent.co.uk/2025/10/26/18/54/Wolverhampton-Wanderers-v-Burnley-Premier-League-Molineux-Stadium-4rs6h6bf.jpeg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Jacob King/PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.161,
                "neg": 0.088,
                "neu": 0.751
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "dce95c50-7b5a-4719-bb00-964925a258ca",
            "title": "Bellingham scores El Clasico winner",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/sport/football/videos/cj0emrp5gv1o?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "video",
                "hearts",
                "administration",
                "eight-point",
                "challenge",
                "reacts to administration",
                "to administration 'take",
                "administration 'take it"
            ],
            "topics": [
                "sports",
                "entertainment",
                "media",
                "global"
            ],
            "description": "Jude Bellingham assists the first goal and scores the second for Real Madrid as they beat Barcelona 2-1 in the first Clasico of the La Liga season.",
            "pub_date": "2025-10-26T18:34:03",
            "creator": "BBC News",
            "content": "Up Next. Why Real Madrid season could be seen as 'big failure' Video, 00: 01: 13Why Real Madrid season could be seen as 'big failure' 'We're not home and hosed' McInnes on Hearts' title challenge. Video, 00: 01: 06'We're not home and hosed' McInnes on Hearts' title challenge 'We've still got 29 games left' Rodgers on Celtic's eight-point deficit. Video, 00: 00: 54'We've still got 29 games left' Rodgers on Celtic's eight-point deficit 'I can take my kids again' Sheff Wed fan reacts to administration. Video, 00: 00: 38'I can take my kids again' Sheff Wed fan reacts to administration 'Take it in and put it in the memory' Dyche on first Forest game. Video, 00: 00: 54'Take it in and put it in the memory' Dyche on first Forest game.",
            "media_url": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/2203/live/2c1e5b20-b29a-11f0-ba75-093eca1ac29b.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2203/live/2c1e5b20-b29a-11f0-ba75-093eca1ac29b.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.054,
                "neg": 0.091,
                "neu": 0.855
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        }
    ]
}