{
    "next_cursor": "MC4wLDE3NjE0OTQ4NDgwMDAsMjU0MTE5ODA5",
    "total_results": 2640,
    "per_page": 50,
    "data": [
        {
            "id": "d4fb0284-d5f9-4c95-bf78-25dc9834f49f",
            "title": "Russia tested a new nuclear-capable missile, Putin says",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/russia-tested-new-nuclear-capable-missile-putin/",
            "keywords": [
                "vladimir putin",
                "putin",
                "state-of-the-nation",
                "intercontinental",
                "nuclear-capable",
                "including intercontinental ballistic",
                "intercontinental ballistic missiles",
                "2018 state-of-the-nation address"
            ],
            "topics": [
                "international",
                "politics"
            ],
            "description": "The announcement comes as part of nuclear messaging from the Kremlin, which has resisted Western pressure for a ceasefire in Ukraine.",
            "pub_date": "2025-10-26T17:06:37",
            "creator": "CBS News",
            "content": "Russia tested a new nuclear-capable and powered cruise missile fit to confound existing defenses, inching closer to deploying it to its military, President Vladimir Putin said in remarks released on Sunday. The announcement, which followed years of tests of the Burevestnik missile, comes as part of nuclear messaging from the Kremlin, which has resisted Western pressure for a ceasefire in Ukraine and strongly warned the U. S. and other NATO allies against sanctioning strikes deep inside Russia with longer-range Western weapons. A video released by the Kremlin showed Putin, dressed in camouflage fatigues, receiving a report from Gen. Valery Gerasimov, Russia's chief of general staff, who told the Russian leader that the Burevestnik covered 14, 000 kilometers (8, 700 miles) in a key test Tuesday. Gerasimov said the Burevestnik, or storm petrel in Russian, spent 15 hours in the air, adding \"that's not the limit.\" Little is known about the Burevestnik, which was code-named Skyfall by NATO, and many Western experts have been skeptical about it, noting that a nuclear engine could be highly unreliable. When Putin first revealed that Russia was working on the weapon in his 2018 state-of-the-nation address, he claimed it would have an unlimited range, allowing it to circle the globe undetected by missile defense systems. Many observers argue that such a missile could be difficult to handle and pose an environmental threat. The U. S. and the Soviet Union worked on nuclear-powered missiles during the Cold War, but they eventually shelved the projects, considering them too hazardous. The Burevestnik reportedly suffered an explosion in August 2019 during tests at a navy range on the White Sea, killing five nuclear engineers and two service members and resulting in a brief spike in radioactivity that fueled fears in a nearby city. Russian officials never identified the weapon involved, but the U. S. said it was the Burevestnik. \"We need to determine the possible uses and begin preparing the infrastructure for deploying these weapons to our armed forces,\" Putin told Gerasimov. The Russian leader also claimed it was invulnerable to current and future missile defenses, due to its almost unlimited range and unpredictable flight path. Kirill Dmitriev, a top Putin aide who was in the U. S. as the video surfaced, said his delegation informed U. S. colleagues of the \"successful testing\" of the Burevestnik, which he said was an \"absolutely new class\" of weapon. Earlier this week, Putin directed drills of Russia's strategic nuclear forces that featured practice missile launches. The exercise came as his planned summit on Ukraine with U. S. President Trump was put on hold. The Kremlin said that the maneuvers involved all parts of Moscow's nuclear triad, including intercontinental ballistic missiles that were test-fired from launch facilities in northwestern Russia and a submarine in the Barents Sea. The drills also involved Tu-95 strategic bombers firing long-range cruise missiles. The exercise tested the skills of military command structures, the Kremlin said in a statement on Wednesday.",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/1d29c468-87fd-4d59-a70d-7dfac8a289ad/thumbnail/1200x630/38c94830587216bc663663f583370545/ap25299257583030.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.037,
                "neg": 0.095,
                "neu": 0.868
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "8dc1aa4c-1b6c-4ef6-8724-5714e6e11905",
            "title": "Highlights from Gavin Newsom's \"Sunday Morning\" interview: Proposition 50, opposing Trump, and 2028",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/highlights-from-gavin-newsoms-sunday-morning-interview-proposition-50-opposing-trump-and-2028/",
            "keywords": [
                "robert costa",
                "gavin newsom",
                "republican-controlled",
                "administration",
                "redistricting",
                "administration since inauguration",
                "popular sovereignty fundamentally",
                "constitution limiting presidents"
            ],
            "topics": [
                "politics",
                "government",
                "international"
            ],
            "description": "California's Democratic governor talked with \"CBS Sunday Morning\" about redistricting, the \"future of this republic,\" and his own plans for a presidential run.",
            "pub_date": "2025-10-26T17:03:53",
            "creator": "CBS News",
            "content": "In an exclusive interview with Robert Costa for \"CBS Sunday Morning,\" California Governor Gavin Newsom described the Democrats' redistricting in his state as an effort to ensure \"the future of this republic\" and a necessary measure to counter President Trump's push to expand Republican gains in the U. S. House and secure its narrow majority. The vote on Proposition 50 this November 4 was just one of the issues the Democrat discussed, including his own plans for the 2028 election. Proposition 50 Newsom has been stumping across his state advocating for redistricting, in response to President Trump's redistricting push in Republican-controlled states, like Texas. Rather than gerrymander districts in the state legislature, as Texas did, California is putting a ballot initiative, Proposition 50, before the voters on November 4 in order to allow for redistricting in next year's midterm election. If Proposition 50 succeeds next week, Democrats will change the boundaries of U. S. House districts in California, making it easier for their party to win up to five more seats. In fact, the state has filed 43 lawsuits against the Trump administration since Inauguration Day. Costa asked, \"What's it's like being the governor of the state of California, and not knowing, day-to-day, if the federal government's going to be sending agents or not to your state? It's a hell of a way to govern,\" Newsom replied. \"I mean, we're just governing just profound uncertainty, the sort of tectonic plates that we're familiar with out here on the West Coast, but on the nature of our politics. I've said this may not be a sort of prudent thing to say about a President of the United States but I mean, he's an invasive species. For California? For the country. For the world,\" Newsom said. \"He's a wrecking ball. Not just the symbolism and substance of the East Wing; he's wrecking alliances, truth, trust, tradition, institutions.\" He also rejected suggestions that ICE agents are needed in California because of what the White House called \"third-world insurrection riots on American soil. California cooperates as it relates to criminals,\" he said. \"We continue to cooperate out of our state penitentiary system hundreds of people every month that we coordinate with ICE to go after the 'worst of the worst.' That's not what this is about, and everybody knows it. You don't just randomly show up at a car wash and tell me it's about the 'worst of the worst.' You don't randomly show up at the showrooms or the parking lots of every Home Depot.\" Podcasting as a means to understand Trump supporters Newsom isn't just opposing Mr. Trump; he's also trying to understand the MAGA movement. His podcast, \"This Is Gavin Newsom,\" not only welcomes figures on his side of the political aisle, but also the president's allies, from Steve Bannon and Newt Gingrich to the late Charlie Kirk. Newsom said his own son has reminded him about paying attention to other voices. \"We've got a crisis in this country besides the crisis that we've discussed around the future of this republic,\" he said. \"We also have a crisis with masculinity and men. Men are struggling. I mean, suicide rates are off the chart, dropout rates, suspension rates, loneliness, despair, depths of despair. It's a serious crisis, what's going on in this country. \"Democrats haven't focused on that issue. And I'm very proud of the work, substantive work we're doing in this, but I've also been using the podcast to highlight that.\" Mocking Trump on social media The governor also uses satire to tweak the president, aping Mr. Trump's prolific use of social media. Newsom's communications team regularly parodies President Trump's use of all-caps and AI-generated images, even signing off, \"THANK YOU FOR YOUR ATTENTION TO THIS MATTER. GCN\" Newsom has said that his social-media posts are driven by both his desire to add a sense of humor to politics, and to challenge President Trump by using Trump-style tactics. 2028 plans This past July, \"Sunday Morning\" spent a day following Newsom across South Carolina, a key state in the 2028 presidential race. Newsom worked the crowds, shaking hands and even pulling espresso shots at a coffee bar. Newsom's visit sparked interest among those at his events and in political circles that he might be mulling his own White House bid. \"I'm looking forward to who presents themselves in 2028 and who meets that moment. And that's the question for the American people. They'll make that determination,\" Newsom said in the interview this past week. Costa asked, \"Is it fair to say after the 2026 midterms, you're going to give it serious thought? Yeah. I'd be lying otherwise. I'd just be lying. And I'm I can't do that.\" He said it would be important for a candidate to impart to voters exactly why they are running. \"Nietzsche said, 'If you have a compelling why, you can endure any how.' And so, I think the biggest challenge for anyone who runs for any office is people see right through you if you don't have that why. You're doing it for the wrong reasons. When I saw you slinging shots behind the coffee bar, I thought, 'This guy might run for president.'\" Costa said. Newsom, who as a child was diagnosed with dyslexia, said, \"The idea that a guy who got 960 on his SAT, that still struggles to read scripts, that was always in the back of the classroom the idea that you even throw that out is, in and of itself, extraordinary,\" he laughed. \"Who the hell knows?\" Story produced by Ed Forgotson and John Goodwin. Editor: Chad Cardin. See also:.",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/9b717ef7-68c2-4ef5-ba92-afbab3df103c/thumbnail/1200x630/624b6a874c61579338b4b104f06e47af/gavin-newson-e-1280.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.086,
                "neg": 0.054,
                "neu": 0.86
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "221db4fc-2d7b-4b1b-abaa-dbed3a9777dc",
            "title": "Jannik Sinner fights back to beat Alexander Zverev for Vienna Open title",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/tennis/jannik-sinner-alexander-zverev-vienna-open-b2852511.html",
            "keywords": [
                "jannik",
                "sinner",
                "rollercoaster",
                "all-important",
                "back-to-back",
                "alejandro davidovich fokina",
                "back-to-back seasons since",
                "clinched the all-important"
            ],
            "topics": [
                "sports",
                "entertainment"
            ],
            "description": "The Italian fell down a set and struggled physically but again proved his class over the German as he lifted his fourth ATP title of the season.",
            "pub_date": "2025-10-26T17:01:06",
            "creator": "Flo Clifford",
            "content": "Jannik Sinner fought back to seal his fourth ATP Tour title of the season by beating Alexander Zverev 3-6 6-3 7-5 in the Erste Bank Open final in Vienna. Sinner, who also won the tournament in 2023, clinched the all-important break in the 11th game of the deciding set and clinically served out for victory in two and a half hours, despite enduring some physical problems in the first and third sets. The world number two became the first man to reach eight ATP finals in back-to-back seasons since Novak Djokovic in 2015-16 after beating Alex de Minaur in the last four. “It feels amazing,” said Sinner after his 21st straight win on indoor hard courts. “It was such a difficult start in this final for me. I went a break down, had some chances in the first set but couldn’t use them. He was serving very well, but I just tried to stick there mentally and play my best tennis when it came. “The third set was a bit of a rollercoaster, but I was feeling the ball very well at times, so I tried to push and I’m very happy of course to win another title. It’s very special.” The Italian was broken for just the third time in the tournament as Zverev opened up a 5-1 lead in the opening set on his way to taking it 6-3 in 47 minutes. Sinner appeared to limp in between points, causing concern after he was forced to retire from a physical contest in Shanghai earlier this month after cramping up. But the four-time major winner recovered from the issue to hit straight back in the second set, breaking Zverev to move 3-0 up and going on to win it 6-3 and level the match. Zverev saved two break points in the fifth game in the decider to lead 3-2, and had a golden opportunity to forge ahead as Sinner began to struggle physically again. But Sinner upped his aggression, keeping the points short, and broke decisively in the 11th game to lead 6-5 before ruthlessly serving out for the title by winning his next service game to love. “The most important thing was to not give up and try to stay there,” he said of his physical issues. “Try to see what the situation was. I just tried to make the right choices at the right time, I think that was the key today. Serving well and saving energy in my service games was important too.” Elsewhere, Brazilian teenager Joao Fonseca maintained his rapid progress by winning his first ATP 500 title, beating Spain's Alejandro Davidovich Fokina 6-3 6-4 in the Swiss Indoor final in Basel. With PA.",
            "media_url": "https://static.independent.co.uk/2025/10/26/17/56/GettyImages-2243433264.jpeg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.169,
                "neg": 0.062,
                "neu": 0.769
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "08aaddf0-4560-45f6-878f-1f3a3c203c23",
            "title": "Latest news bulletin | October 26th, 2025 – Evening",
            "source_title": "Euronews",
            "source_link": "https://www.euronews.com",
            "article_link": "http://www.euronews.com/video/2025/10/26/latest-news-bulletin-october-26th-2025-evening",
            "keywords": [
                "europe",
                "business",
                "world",
                "bulletin",
                "october"
            ],
            "topics": [
                "business",
                "entertainment",
                "politics",
                "culture",
                "travel"
            ],
            "description": "Catch up with the most important stories from around Europe and beyond this October 26th, 2025 latest news, breaking news, World, Business, Entertainment, Politics, Culture, Travel.",
            "pub_date": "2025-10-26T17:00:29",
            "creator": "Euronews",
            "content": null,
            "media_url": "https://images.euronews.com/articles/stories/09/52/65/46/696x392_cmsv2_5226d780-657a-5158-acec-7d926bdc0a39-9526546.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 0.0
            },
            "source": {
                "id": "euronews",
                "country": "EU",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "40e46c07-bf54-454d-988b-e77f568c0a6f",
            "title": "US Reps. Banks, Carson react to drug boat strikes",
            "source_title": "WISH-TV",
            "source_link": "https://wishtv.com",
            "article_link": "https://www.wishtv.com/news/allindianapolitics/banks-carson-react-to-drug-boat-strikes/",
            "keywords": [
                "jim banks",
                "donald trump",
                "self-determination",
                "narcoterrorists",
                "administration",
                "seek congressional authorization",
                "senate armed services committee",
                "congressional authorization for"
            ],
            "topics": [
                "politics",
                "government",
                "international",
                "media"
            ],
            "description": "Sen. Jim Banks and Rep. Andre Carson discussed the Trump administration's recent strikes on suspected drug boats in the Caribbean and Pacific and the ongoing ceasefire in Gaza.",
            "pub_date": "2025-10-26T17:00:00",
            "creator": "Garrett Bergquist",
            "content": "INDIANAPOLIS (WISH) Two members of Indiana’s congressional delegation told News 8 illegal drug trafficking continues to pose a major national security threat. In separate interviews for Sunday’s “All INdiana Politics,” Sen. Jim Banks, a Republican who serves on the Senate Armed Services Committee, and Rep. André Carson, a Democrat who serves on the House Intelligence Committee, weighed in on the Trump administration’s recent strikes on suspected drug boats in the Caribbean and in the Pacific Ocean. Some members of Congress have said President Donald Trump should seek congressional authorization for the strikes. Banks said Trump has all the authority he needs under Article II of the U. S. Constitution. He said the death toll drugs take every year means smuggling them into the United States amounts to an act of war. “Fentanyl is the leading cause of death of Americans of working age in our country,” Banks said. “Even though we’ve largely secured the border, you have these drug cartels, narcoterrorists, Venezuela, Colombia, Central America, South America, that are flooding our country with more drugs.” Carson stopped short of criticizing the boat strikes, as some of his Democratic colleagues have, but said U. S. forces must take care to ensure it’s hitting the right targets. He said the U. S. should work with its partners in Central America and South America to rein in the epidemic. “What I don’t want to do is to use this as a political talking point where there isn’t any substantive change of moving the mark, as it were,” Carson said. “Our partners in the Global South must also be held accountable to make sure they’re weeding out corrupt elements in their administration and they’re not in the pocket of these cartels.” Trump has revealed the CIA is operating in Venezuela against that country’s dictator, Nicolas Maduro. Banks said he doesn’t believe that means the Trump administration is trying to topple the Maduro regime. Banks said the CIA operates all over the world, and could play a role in identifying where drugs being smuggled into the United States are coming from. News 8 also asked both Banks and Carson about the ongoing ceasefire in Gaza. Both said security for the region depends on the ceasefire holding. Banks said based on what he has been told, Hamas’ recent ceasefire violation was committed by people acting on their own, not as part of a concerted effort. He said the key to keeping the ceasefire deal in place is for Hamas to disarm and to relinquish control of the Gaza Strip. “If they don’t disarm themselves, then they will be disarmed and America will stand with Israel to do whatever it takes to keep Israel safe and protect themselves,” Banks said. Carson said he hopes the parties to the ceasefire can rein in extremist elements within both Gaza and Israel. “My hope is that we can uphold the terms of the agreement and establish a Palestinian state that is rooted in self-determination and an ability to care for its citizenry, to thrive, and to live securely,” Carson said. Both Banks and Carson said they did not have any new information the could share about the whereabouts of the remains of two American-Israelis still in Gaza, Itay Chen, and Omer Neutra. Both men were serving in the Israel Defense Forces and were killed during the Oct. 7, 2023 Hamas attack on Israel. Carson said he plans to raise the question again in his capacity as a member of the House Intelligence Committee. “All INdiana Politics” airs at 9: 30 a. m. Sundays on WISH-TV.",
            "media_url": "https://www.wishtv.com/wp-content/uploads/2025/10/18/US-releasing-survivors-of-Caribbean-drug-boat-strike-to-their-home-countries-scaled-e1760816462868.jpg?resize",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "The US Navy warship USS Sampson docks in Panama City on August 30, 2025, amid a broader US naval presence in Latin American and Caribbean waters. (Provided Photo/Martin Bernetti/AFP/Getty Images via CNN Newsource)",
            "media_thumbnail": "https://www.wishtv.com/wp-content/uploads/2025/10/18/US-releasing-survivors-of-Caribbean-drug-boat-strike-to-their-home-countries-scaled-e1760816462868.jpg?resize",
            "language": "en",
            "sentiment": {
                "pos": 0.115,
                "neg": 0.057,
                "neu": 0.828
            },
            "source": {
                "id": "wish-tv",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "e3bb20c9-11f4-45fd-9e2d-bb6b12e47ea3",
            "title": "Caluori selected in England squad for Autumn Nations Series",
            "source_title": "Sky News",
            "source_link": "https://news.sky.com",
            "article_link": "https://news.sky.com/story/noah-caluori-selected-in-england-squad-for-autumn-nations-series-ahead-of-saturdays-test-match-against-australia-13458235",
            "keywords": [
                "england",
                "autumn nations series",
                "noah caluori",
                "rugby union"
            ],
            "topics": [
                "sports"
            ],
            "description": "Teenage winger Noah Caluori has been selected in the England squad for the Autumn Nations Series.",
            "pub_date": "2025-10-26T17:00:00",
            "creator": "Sky News",
            "content": null,
            "media_url": "https://e3.365dm.com/25/10/1920x1080/skysports-noah-caluori-saracens_7062957.jpg?20251026164238",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://e3.365dm.com/25/10/1920x1080/skysports-noah-caluori-saracens_7062957.jpg?20251026164238",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "sky-news",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "e8a9e4bb-7b25-4575-88a8-c01deab543f8",
            "title": "‘No Idea How Long People Can Hold Out’: Federal Workers Feel Brunt of Shutdown",
            "source_title": "The New York Times",
            "source_link": "https://www.nytimes.com",
            "article_link": "https://www.nytimes.com/2025/10/26/us/politics/federal-workers-shutdown-pay.html",
            "keywords": [
                "federal workers",
                "shutdown",
                "government employees",
                "paychecks",
                "food banks"
            ],
            "topics": [
                "economy",
                "government"
            ],
            "description": "As more than one million government employees go without pay, many are turning to side jobs and food banks to make ends meet.",
            "pub_date": "2025-10-26T16:59:27",
            "creator": "Eileen Sullivan and Drew Atkins",
            "content": null,
            "media_url": "https://static01.nyt.com/images/2025/10/24/us/politics/dc-shutdown-feds-1/dc-shutdown-feds-1-mediumSquareAt3X.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "the-new-york-times",
                "country": "US",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "dbee9809-affc-4771-ab5c-66c372838249",
            "title": "Will the US plan for Gaza fail?",
            "source_title": "Al Jazeera America",
            "source_link": "https://www.aljazeera.com",
            "article_link": "https://www.aljazeera.com/video/the-bottom-line/2025/10/26/will-the-us-plan-for-gaza-fail?traffic_source=rss",
            "keywords": [
                "trump",
                "gaza",
                "palestinians",
                "implemented",
                "us-brokered",
                "officials visited israel",
                "israeli forces continued",
                "millions of palestinians"
            ],
            "topics": [
                "politics",
                "international"
            ],
            "description": "US journalist Chris Hedges argues that Trump’s plan won’t ‘thwart the genocidal project Israel intends to carry out’.",
            "pub_date": "2025-10-26T16:51:28",
            "creator": "Al Jazeera America",
            "content": "Trump’s Gaza plan is in danger of going the way of the Oslo Accords, argues US journalist Chris Hedges: Never to be implemented beyond the first phase. Hedges tells host Steve Clemons that there are no guarantees that the US-brokered deal “will actually thwart the genocidal project that Israel is intending to carry out in Gaza and . the West Bank”. While a parade of US officials visited Israel to signify commitment to the ceasefire, Israel continued to restrict food and medicine to millions of Palestinians, and Israeli forces continued to occupy more than half of the Gaza Strip.",
            "media_url": "https://www.aljazeera.com/wp-content/uploads/2025/10/image-1761497477.jpg?resize=1920%2C1080&quality=80",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.025,
                "neg": 0.102,
                "neu": 0.873
            },
            "source": {
                "id": "al-jazeera-america",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "c36b4994-94ed-414f-854b-6962a870bf0f",
            "title": "Arsenal 'suffer every week' to win matches - Arteta",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/sport/football/videos/cy8vg0gegx6o?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "madueke",
                "arsenal",
                "administration",
                "eight-point",
                "challenge",
                "reacts to administration",
                "to administration 'take",
                "administration 'take it"
            ],
            "topics": [
                "sports",
                "football",
                "business"
            ],
            "description": "Arsenal boss Mikel Arteta praises Eberechi Eze's \"unbelievable technique\"after he scored the only goal of a tight game against Crystal Palace to extend their lead at the top of the Premier League table.",
            "pub_date": "2025-10-26T16:51:16",
            "creator": "BBC News",
            "content": "Eze, Madueke and why Arsenal might win it all this year. Video, 00: 01: 06Eze, Madueke and why Arsenal might win it all this year Has Eze's role changed since his move to Arsenal? Video, 00: 01: 46Has Eze's role changed since his move to Arsenal? 'We're not home and hosed' McInnes on Hearts' title challenge. Video, 00: 01: 06'We're not home and hosed' McInnes on Hearts' title challenge 'We've still got 29 games left' Rodgers on Celtic's eight-point deficit. Video, 00: 00: 54'We've still got 29 games left' Rodgers on Celtic's eight-point deficit 'I can take my kids again' Sheff Wed fan reacts to administration. Video, 00: 00: 38'I can take my kids again' Sheff Wed fan reacts to administration 'Take it in and put it in the memory' Dyche on first Forest game. Video, 00: 00: 54'Take it in and put it in the memory' Dyche on first Forest game.",
            "media_url": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/0167/live/3b2b6a10-b289-11f0-ba75-093eca1ac29b.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0167/live/3b2b6a10-b289-11f0-ba75-093eca1ac29b.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.099,
                "neg": 0.035,
                "neu": 0.865
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "ab4b80ee-d262-4b45-9be1-606a8fb2fa71",
            "title": "Cyclone Montha triggers widespread 'college closures' in Andhra amid IMD's red alert",
            "source_title": "India TV",
            "source_link": "https://www.indiatvnews.com",
            "article_link": "https://www.indiatvnews.com/education/news/cyclone-montha-triggers-widespread-college-closures-in-andhra-amid-imd-s-red-alert-2025-10-26-1014492",
            "keywords": [
                "cyclone montha",
                "andhra pradesh",
                "college closures",
                "intermediate education"
            ],
            "topics": [
                "weather",
                "cyclone",
                "education",
                "government",
                "india"
            ],
            "description": "Amid a severe red alert issued by the India Meteorological Department (IMD) for Cyclone Montha, government and private colleges with Intermediate Education in several Andhra Pradesh districts have been ordered to close. Officials emphasised strict...",
            "pub_date": "2025-10-26T16:48:25",
            "creator": "India TV News Desk",
            "content": null,
            "media_url": "",
            "media_type": "",
            "media_description": "Amid a severe red alert issued by the India Meteorological Department (IMD) for Cyclone Montha, government and private colleges with Intermediate Education in several Andhra Pradesh districts have been ordered to close. Officials emphasised strict...",
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "india-tv-latest-news",
                "country": "IN",
                "political_leaning": "center",
                "reliability_score": 7.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "aac8c624-2a14-4492-bf92-7fe845511d41",
            "title": "Former Jets center Nick Mangold dies at 41, less than 2 weeks after announcing he had kidney disease",
            "source_title": "WPTV NewsChannel 5",
            "source_link": "https://www.wptv.com",
            "article_link": "https://www.wptv.com/sports/former-jets-center-nick-mangold-dies-at-41-less-than-2-weeks-after-announcing-he-had-kidney-disease",
            "keywords": [
                "nick mangold",
                "mangold",
                "complications",
                "communities",
                "researchers",
                "all-pro selection announced",
                "two-time all-pro selection",
                "teammate whose leadership"
            ],
            "topics": [
                "death",
                "illness",
                "sports"
            ],
            "description": "Former New York Jets center Nick Mangold, one of the franchise's most popular and decorated players who helped lead the team to the AFC championship game twice, has died. He was 41.",
            "pub_date": "2025-10-26T16:48:00",
            "creator": "AP via Scripps News Group",
            "content": "Former New York Jets center Nick Mangold, one of the franchise's most popular and decorated players, has died, the team announced Sunday. He was 41. The Jets said in a statement on social media that Mangold died Saturday night from complications of kidney disease. His death comes less than two weeks after the two-time All-Pro selection announced on social media that he had kidney disease and needed a transplant. He said he didn't have any relatives who were able to donate, so he went public with the request for a donor with type O blood. “I always knew this day would come, but I thought I would have had more time,” he wrote in a message directed to the Jets and Ohio State communities. “While this has been a tough stretch, I’m staying positive and focused on the path ahead. I’m looking forward to better days and getting back to full strength soon. I’ll see you all at MetLife Stadium & The Shoe very soon.” Mangold said he was diagnosed with a genetic defect in 2006 that led to chronic kidney disease. He was on dialysis while waiting for a transplant. FROM THE ARCHIVES | Researchers testing new bionic kidney for kidney disease patients “Nick was more than a legendary center,” Jets owner Woody Johnson said in a statement. “He was the heartbeat of our offensive line for a decade and a beloved teammate whose leadership and toughness defined an era of Jets football. Off the field, Nick’s wit, warmth, and unwavering loyalty made him a cherished member of our extended Jets family.” Mangold was a first-round draft pick of the Jets in 2006 out of Ohio State and was selected to the Pro Bowl seven times. He was enshrined in the Jets’ ring of honor in 2022. Mangold is survived by his wife, Jennifer, and their four children Matthew, Eloise, Thomas and Charlotte.",
            "media_url": "https://ewscripps.brightspotcdn.com/dims4/default/833e8cc/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F5b%2Ff1%2Ff2e37ade40ba932699177ada639a%2Fap25287760066656.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.132,
                "neg": 0.051,
                "neu": 0.817
            },
            "source": {
                "id": "wptv-west-palm-beach",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0c9a7db6-0685-443f-aa63-15180d4f169e",
            "title": "Bessent says additional 100% tariffs on China are \"effectively off the table\"",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/treasury-secretary-scott-bessent-additional-china-tariffs-face-the-nation/",
            "keywords": [
                "treasury",
                "scott bessent",
                "three-country",
                "third-largest",
                "effectively",
                "third-largest trading partner",
                "pacific economic cooperation",
                "economic cooperation summit"
            ],
            "topics": [
                "economy",
                "politics"
            ],
            "description": "Treasury Secretary Scott Bessent said 100% tariffs on China are \"effectively off the table\" after a \"very good two-day meeting\" between the U. S. and China.",
            "pub_date": "2025-10-26T16:47:49",
            "creator": "CBS News",
            "content": "Treasury Secretary Scott Bessent said Sunday that additional 100% tariffs on China are \"effectively off the table\" after a \"very good two-day meeting\" with Beijing's top trade negotiator. \"I'm not going to get ahead of the two leaders who will be meeting in Korea on Thursday, but I can tell you we had a very good two days,\" Bessent said of President Trump and Chinese President Xi Jinping. Bessent, who has been leading trade talks with China, appeared Sunday on \"Face the Nation with Margaret Brennan\" from Kuala Lumpur, Malaysia, where President Trump began a three-country visit to Asia. Mr. Trump is expected to meet with China's president at the Asia Pacific Economic Cooperation summit in South Korea on Thursday. China is the United States' third-largest trading partner after Mexico and Canada, and tariffs on Chinese imports currently stand at 30%. Earlier this month, President Trump threatened an additional 100% tariff on Chinese imports by early November in a significant escalation in the U. S.-China trade war. Mr. Trump warned that the tariffs would take effect if Beijing couldn't reach a deal with the U. S., citing new Chinese export controls. But after the meetings, Bessent said he expects \"the threat of the 100% has gone away, as has the threat of the immediate imposition of the Chinese initiating a worldwide export control regime.\" The treasury secretary praised Mr. Trump for giving him and his team an advantage, saying the threat of a 100% additional tariff \"did give us a great deal of leveragePresident Trump's very good at creating leverage for us,\" Bessent added.",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/5a30c379-0503-4256-909d-18e4e6041e19/thumbnail/1200x630/8ec1ca13934e8b8c81ca397db8c1614e/1761493217490.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.14,
                "neg": 0.089,
                "neu": 0.771
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0a8dc586-83de-4153-81cc-8a9da38deaaf",
            "title": "Prince Andrew could face parliamentary debate over conduct",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/uk-news/2025/oct/26/prince-andrew-could-face-parliamentary-debate-over-conduct-royal-lodge",
            "keywords": [
                "andrew",
                "grace-and-favour",
                "representatives",
                "accountability",
                "transparency and accountability",
                "and grace-and-favour residences",
                "finances and grace-and-favour"
            ],
            "topics": [
                "politics",
                "government"
            ],
            "description": "Liberal Democrats are exploring options while calling for crown estate and prince to give evidence under oathPrince Andrew could face a parliamentary debate on his conduct despite the government so far refusing to allocate time in the House of Commons, as the Liberal Democrats indicated they were exploring ways of raising the issue including in an opposition day debate. Andrew is reportedly in advanced talks with the king’s representatives over moving out of the 30-room Grade II-listed Royal Lodge at Windsor, despite his “cast-iron” lease running until 2078.",
            "pub_date": "2025-10-26T16:47:06",
            "creator": "Caroline Davies and Aletha Adu",
            "content": "Prince Andrew could face a parliamentary debate on his conduct despite the government so far refusing to allocate time in the House of Commons, as the Liberal Democrats indicated they were exploring ways of raising the issue including in an opposition day debate. Andrew is reportedly in advanced talks with the king’s representatives over moving out of the 30-room Grade II-listed Royal Lodge at Windsor, despite his “cast-iron” lease running until 2078. There have also been calls for his Duke of York title, which he has said he will no longer use, to be officially removed, which would require legislation. The government is unwilling to table a motion to discuss Andrew, saying the royal family wishes parliament to focus on “important issues”. However a Lib Dem source told the Guardian that the party was “exploring all options, including an opposition day debate, to ensure parliament can scrutinise this properly from Prince Andrew’s residence at Royal Lodge to his dukedom”. They added: “The first thing we need is proper transparency and accountability that’s why we’ve called for the crown estate and Prince Andrew to give evidence under oath in parliament.” While noting that the government controls the timing of such debates, the source said the Lib Dems hoped an eventual move by parliament would be “hand in hand with the palace” and in line with the king’s wishes. The comments signal that the Lib Dems want to frame any discussion of Andrew’s future as a matter of public accountability rather than of personal scandal, reflecting growing unease in Westminster about the lack of transparency around royal finances and grace-and-favour residences. Party figures have privately suggested the episode underlines the need for “modern standards of public scrutiny” to apply across all publicly funded estates, including those managed by the crown estate. Their intervention is likely to add to pressure on ministers and Buckingham Palace to clarify the duke’s future at Royal Lodge. Figures from other parties have noted that any Commons debate on the issue would be symbolically significant, breaking from decades of convention that MPs avoid direct criticism of the royal family. The ability of MPs to discuss matters relating to the royal family is constrained under the Commons’ procedures. The guide to the rules, known as Erskine May, states: “Unless the discussion is based upon a substantive motion, drawn in proper terms, reflections must not be cast in debate upon the conduct of the sovereign, the heir to the throne or other members of the royal family.” Andrew, 65, announced last week he would no longer use his titles and honours, after the continuing fallout over his links to the late financier Jeffrey Epstein, a convicted child sex offender. The terms of his residency at Royal Lodge dominated headlines after it was reported he paid £1m to the crown estate for the lease in 2003, and paid the required £7. 5m to refurbish the property, but has paid “one peppercorn (if demanded)” in rent a year since. Andrew’s announcement came days before the posthumous publication of the memoir of his sex assault accuser, Virginia Giuffre, who died by suicide in April aged 41. The prince has always strenuously denied her allegations that he had sex with her on three occasions while she was trafficked by Epstein.",
            "media_url": "https://i.guim.co.uk/img/media/f0985669f201c172b316e38a1b817229496ac291/325_0_1902_1522/master/1902.jpg?width=140&quality=85&auto=format&fit=max&s=37d2a62d960ebfe1e5fcfad1c854697a",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Victoria Jones/Shutterstock",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.05,
                "neg": 0.038,
                "neu": 0.912
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "d3a7894c-1aaa-4fd2-95d2-94f8f6bb212a",
            "title": "New York Jets legend Nick Mangold dies aged 41",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/us-sport/new-york-jets-nick-mangold-dies-b2852505.html",
            "keywords": [
                "nick mangold",
                "mangold",
                "complications",
                "determination",
                "contributions",
                "chairman christopher johnson",
                "undergoing kidney dialysis",
                "mangold announced earlier"
            ],
            "topics": [
                "sports",
                "death",
                "disease"
            ],
            "description": "The much-loved center has passed away less than two weeks after sharing the news of his battle with kidney disease.",
            "pub_date": "2025-10-26T16:46:01",
            "creator": "Flo Clifford",
            "content": "The New York Jets’ star center Nick Mangold has died at the age of 41, the team has announced. Mangold announced earlier this month that he had been diagnosed in 2006 with a rare genetic disorder and was undergoing kidney dialysis. In the statement on 14 October, addressed to “my NY Jets community”, he asked for help securing a kidney transplant, as no one in his family shared his blood type. The Jets confirmed his death, from complications of kidney disease, on Sunday, with owner Woody Johnson saying: “Nick was more than a legendary center. “He was the heartbeat of our offensive line for a decade and a beloved teammate whose leadership and toughness defined an era of Jets football. Off the field, Nick's wit, warmth, and unwavering loyalty made him a cherished member of our extended Jets family. “Nick Mangold will forever be a Jet.” Vice Chairman Christopher Johnson also paid tribute, writing: “Nick was the embodiment of consistency, strength, and leadership. “For over a decade, he anchored our offensive line with unmatched skill and determination, earning the respect of teammates, opponents, and fans alike. His contributions on the field were extraordinary but it was his character, humility, and humor off the field that made him unforgettable.” Mangold enjoyed an All-America career at Ohio State and was a first-round draft pick in 2006, joining forces with left tackle D’Brickashaw Ferguson. The pair became known as ‘Nick and Brick’ and led the Jets’ offensive line to three playoffs and four winning teams. Mangold was named first team All-Pro after 2009 and 2010, second team All-Pro in 2011, and made seven Pro Bowls. He started every Jets game from 2006 until early 2011 before an ankle injury ruled him out for a brief spell. In total he started 171 games before retiring in 2016 after 11 seasons, spurning interest from Baltimore Ravens after he was released by the Jets. “Being able to finish out my career here, being able to play for only one team is something really special to me,” he said last year. “It's a great team to be a part of. This fan base is as passionate as they come, loyal as all get-out.” He is among 52 candidates for the Hall of Fame class of 2026 and was inducted into the Jets’ Ring of Honor three years ago. “Absolutely gutted,\" former teammate, wide receiver David Nelson, wrote on social media. “One of the best guys I've ever met true legend on and off the field.”.",
            "media_url": "https://static.independent.co.uk/2025/10/15/15/51/GettyImages-1427316262.jpeg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.164,
                "neg": 0.047,
                "neu": 0.789
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "2ede88b1-1ec9-4a9f-8a64-32bba494d365",
            "title": "Epping migrant sex offender will be deported 'this week', says Justice Secretary Lammy",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/news/articles/cwyng49vv10o?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "thomas mackintosh",
                "euan",
                "investigation",
                "prison-issue",
                "independent",
                "prison-issue grey tracksuit",
                "numerous sexually explicit",
                "sexually explicit comments"
            ],
            "topics": [
                "justice",
                "deportation",
                "law",
                "government"
            ],
            "description": "Hadush Kebatu was arrested in north London, two days after being mistakenly released from an Essex jail.",
            "pub_date": "2025-10-26T16:44:50",
            "creator": "BBC News",
            "content": "7 minutes ago Thomas Mackintosh and Euan O'Byrne Mulligan A migrant who was mistakenly released from prison and then re-arrested will be deported \"this week\", David Lammy has said. Hadush Kebatu was arrested in the Finsbury Park area of north London at 08: 30 GMT on Sunday, bringing an end to a 48-hour manhunt that began after he was let go in error from HMP Chelmsford. Kebatu, who was sentenced last month for sexually assaulting a 14-year-old girl and a woman in Epping while living in a hotel, was due to be deported when he was mistakenly set free by prison staff. Justice Secretary Lammy said he would outline the terms of reference for a full independent inquiry into the release in Parliament on Monday. Earlier, Prime Minister Sir Keir Starmer said an investigation was already under way, adding: \"We must make sure this doesn't happen again.\" Kebatu's initial arrest in July sparked protests outside The Bell Hotel in Epping, where he had been living since arriving in the UK on a small boat. The Met Police said Kebatu was arrested on Sunday on suspicion of being unlawfully at large and would be taken to a London prison. One eyewitness said he was walking his dog in Finsbury Park when he spotted Kebatu being led away by a number of officers. Eyewitness Jack Neill-Hall, 40, told the PA news agency: \"I knew that he'd last been seen in the Hackney area and I thought 'oh, that looks awfully like that guy, he's not wearing the same clothes but it looks like him'. He wasn't struggling, he was walking quite calmly, a bit dejectedly, he was staring down, he had his hood up, but it was a calm situation,\" he added. \"It was a leisurely stroll out of the park with him with his hands cuffed but he wasn't trying to get away.\" The Met said a member of the public tipped off police that they had spotted a man they believed could be Kebatu at a bus stop near Finsbury Park station at 08: 03 on Sunday morning. Officers were sent to the area and found him 16 minutes later. Kebatu was seen being led away in handcuffs by police wearing different clothes to the prison-issue grey tracksuit he had last been spotted in on Friday evening. Essex Police were first made aware that Kebatu had been released in error on Friday at 12: 57 on Friday but Kebatu had already boarded a train to east London 16 minutes earlier. Kebatu was also was filmed in Chelmsford city centre speaking to members of the public shortly after he was released, and police confirmed he approached several people seeking assistance. The Met Police also established that Kebatu made a number of train journeys across the capital. Officers issued CCTV images of Kebatu at a library in the Dalston area on Friday evening. He was still wearing a prison-issue grey tracksuit and carrying a white bag with pictures of avocados on it. In September, Chelmsford Magistrates' Court heard Kebatu tried to kiss a teenage girl on a bench and made numerous sexually explicit comments. The following day, he encountered the same girl and tried to kiss her before sexually assaulting her. He also sexually assaulted a woman who had offered to help him draft a CV to find work. Kebatu gave his age as 38 during a court appearance, but a judge said he had been seen information indicating he was 41. He denied the charges against him but was found guilty of five offences last month and sentenced to 12 months in custody, including the time he had already time in jail awaiting his trial. In total, he spent 108 days in prison. Kebatu was also given a five-year sexual harm prevention order, which banned him from approaching or contacting any female, and ordered to sign the Sex Offenders Register for 10 years. Speaking from Wood Green police station in north London, Lammy said Kebatu's victims had been contacted by police liaison officers over the last 48 hours. During his trial, the court heard it was Kebatu's \"firm wish\" to be deported. Under the UK Borders Act 2007, a deportation order must be made where a foreign national has been convicted of an offence and has received a custodial sentence of at least 12 months. HM Prison Service has instructed governors in England and Wales to implement additional checks before inmates are released by Monday. A prison officer has been suspended pending investigation but a senior prison staffer told BBC News the release was \"down to a series of mistakes probably because staff are overworked and in short supply\". They continued: \"It's not just one prison office who's to blame. That would be unfair.\" A report from His Majesty's Prison and Probation Service said 262 prisoners in England and Wales were released in error between April 2024 and March 2025, up from 115 in the previous 12 months. Asked why figures for wrongful releases were rising, Lammy, who is also deputy prime minister, said the Labour government \"inherited a system that was collapsing [from the Conservatives]\". Health Secretary Wes Streeting told the BBC the arrest was a \"huge relief\" and said Kebatu will \"now be deported\". He continued: \"The justice secretary has ordered an investigation into how on earth it was that a dangerous man who was due for deportation was instead released onto our streets. \"That work is under way, we will be open and transparent with the public about what went wrong and what we're going to do about it.\" He had earlier said the Prison Service was under enormous pressure \"but even against that backdrop it doesn't explain or excuse the release of people on our streets who have no business being there\". Former Conservative Justice Secretary Alex Chalk said an inquiry was necessary in order \"to learn lessons\", and suggested the incident was symptomatic of wider problems with the prison system. He told BBC Breakfast: \"The entire annual budget of the Ministry of Justice is spent by the Department for Work and Pensions in two weeks. \"My constant plea is to try to ensure the prison service gets the resources it requires to ensure we are recruiting and retaining people with skills and experience to make sure these problems don't happen.\" The Liberal Democrat MP for Chelmsford, Marie Goldman, said Kebatu \"must now be deported\" and also pushed for a national inquiry. Earlier, Reform UK leader Nigel Farage said the incident showed that the UK's \"once-trusted institutions\", including the police and prisons, were \"disintegrating before our eyes\".",
            "media_url": "https://ichef.bbci.co.uk/news/1024/branded_news/2ed6/live/c792e810-b28a-11f0-aa13-0b0479f6f42a.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2ed6/live/c792e810-b28a-11f0-aa13-0b0479f6f42a.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.056,
                "neg": 0.057,
                "neu": 0.887
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "2e3b0ae7-cdc2-494b-aada-02ac6d26fa4c",
            "title": "Would a written constitution save Britain from the far right? | Letters",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/politics/2025/oct/26/would-a-written-constitution-save-britain-from-the-far-right",
            "keywords": [
                "george",
                "reform uk",
                "unconstitutional",
                "activist-minded",
                "participatory",
                "nathon raine bradford george monbiot",
                "greater manchester george monbiot",
                "suddenly discovering presidential"
            ],
            "topics": [
                "politics",
                "government",
                "media",
                "culture"
            ],
            "description": "Readers respond to George Monbiot’s article calling for a constitution to guard against the rise of Reform UK and autocracyGeorge Monbiot is right that having a written constitution would be better than not having one if the far right takes power (We must act now: without a written constitution, Reform UK will have carte blanche to toxify our nation, 23 October). But, as he points out, it’s not a guarantee of sane government. At least 75% of what Donald Trump is doing is unconstitutional, but it’s permitted by a compliant Congress and a rubber-stamp supreme court that is suddenly discovering presidential powers in the constitution that its framers never intended. The true problem is that a large proportion of the US electorate is content to let this happen. Marina Hyde noted the same trend here too many people are so dischuffed (some with good cause, some not) that they are willing to press the “F you” button and smash the system. In 1795, as the first US government was getting under way, the writer Samuel Miller commented that “political prosperity resides, not in the words and letters of the constitution; but in the temper, the habits, and the practices of the people”. With or without a constitution, there needs to be peaceful civic resistance to a future extremist regime until more people are persuaded that a humane and tolerant government is worth having. Peter Loschi Oldham, Greater Manchester.",
            "pub_date": "2025-10-26T16:44:30",
            "creator": "Guardian Staff",
            "content": "George Monbiot is right that having a written constitution would be better than not having one if the far right takes power (We must act now: without a written constitution, Reform UK will have carte blanche to toxify our nation, 23 October). But, as he points out, it’s not a guarantee of sane government. At least 75% of what Donald Trump is doing is unconstitutional, but it’s permitted by a compliant Congress and a rubber-stamp supreme court that is suddenly discovering presidential powers in the constitution that its framers never intended. The true problem is that a large proportion of the US electorate is content to let this happen. Marina Hyde noted the same trend here too many people are so dischuffed (some with good cause, some not) that they are willing to press the “F you” button and smash the system. In 1795, as the first US government was getting under way, the writer Samuel Miller commented that “political prosperity resides, not in the words and letters of the constitution; but in the temper, the habits, and the practices of the people”. With or without a constitution, there needs to be peaceful civic resistance to a future extremist regime until more people are persuaded that a humane and tolerant government is worth having. Peter Loschi Oldham, Greater Manchester George Monbiot advocates a written constitution to defend against the threat of Reform UK. Do we really believe that it will win 40%-plus of votes and a majority of seats in a general election? I know it may be dangerous to dismiss it as a protest vote, but I can’t believe that. I was reading an entry from Alan Bennett’s Writing Home recently, where he opined that if Labour fought an election on the state of the NHS alone it would surely win hands down. Still true. Yet it is desperate to engage Reform on its home ground. I can’t believe people think that migration and cutting public services are the country’s biggest priorities. Ray Flood Dundee George Monbiot calls for a written British constitution to be created through “a citizens’ constitutional convention”, with “participatory events all over the country”. But such events are likely to be dominated by people like him educated, activist-minded liberals whose values would then shape the constitution. Views that clash with theirs would be excluded by a process controlled by similar voices. In wanting to make his own values permanent, Monbiot shows an instinct not unlike Nigel Farage’s both seek to enshrine their worldviews as the national default. Nathon Raine Bradford George Monbiot says we urgently need constitutional change there is an immediate opportunity for citizens to contribute to this agenda. The public bill committee reviewing the English devolution and community empowerment bill is welcoming submissions right now. In the evidence I submitted, published on the parliamentary website, I point out how the rise of far-right extremist groups gives renewed urgency to the importance of providing constitutional protection for all elected local authorities in England. It is a simple step for such a clause to be added to the bill. I explain how countries that outperform the UK on economic, social and environmental indicators, for example, Sweden, already enjoy such protections. Robin Hambleton Emeritus professor, University of the West of England Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section.",
            "media_url": "https://i.guim.co.uk/img/media/b67fdf568334d73284958afb278bbb4e06f3bb6b/447_0_4560_3648/master/4560.jpg?width=140&quality=85&auto=format&fit=max&s=d9b24a13c13d1306cddfd0597d7f47c3",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Gina M Randazzo/ZUMA Press Wire/Shutterstock",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.119,
                "neg": 0.074,
                "neu": 0.808
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "dbe4d9b3-986d-4ac9-8862-e96dbd70e9db",
            "title": "Face the Nation: Jeffries, Graham, Moolenaar",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/face-the-nation-jeffries-graham-moolenaar/",
            "keywords": [
                "hakeem jeffries",
                "lindsey graham",
                "republican",
                "moolenaar",
                "jeffries",
                "moolenaar join margaret",
                "leader hakeem jeffries",
                "minority leader hakeem"
            ],
            "topics": [
                "politics",
                "government"
            ],
            "description": "Missed the second half of the show? House Minority Leader Hakeem Jeffries, Republican Sen. Lindsey Graham and Republican Rep. John Moolenaar join Margaret Brennan.",
            "pub_date": "2025-10-26T16:42:00",
            "creator": "CBS News",
            "content": "Missed the second half of the show? House Minority Leader Hakeem Jeffries, Republican Sen. Lindsey Graham and Republican Rep. John Moolenaar join Margaret Brennan.",
            "media_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/10/26/0ee6e28b-ec0e-471c-b440-f593ed91e0c0/thumbnail/1200x630/5f667eb340823066855ebf4a7354c267/102625-ftn-page2.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.083,
                "neg": 0.083,
                "neu": 0.833
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "f3c65936-f880-41c3-942e-030aacb6683c",
            "title": "No reason to abandon external wall insulation | Letter",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/environment/2025/oct/26/no-reason-to-abandon-external-wall-insulation",
            "keywords": [
                "tory",
                "true",
                "better-quality",
                "catastrophic",
                "poor-quality",
                "since poor-quality installs",
                "external insulation fitted",
                "high-risk retrofit measure"
            ],
            "topics": [
                "economy",
                "environment",
                "technology",
                "science"
            ],
            "description": "Jason Palmer says it is vital to meet climate targets and we need trained installersNegative coverage about solid wall insulation (SWI) risks deterring people from insulating the UK’s 8. 5m solid-wall homes, which we need to do to meet targets for reducing greenhouse gas emissions, and also to install heat pumps efficiently (Almost all external insulation fitted under Tory scheme needs repair or replacing, report finds, 14 October). True, SWI is a high-risk retrofit measure since poor-quality installs can have catastrophic outcomes, but we have known this for a decade at least we need better-quality SWI and better training for installers.",
            "pub_date": "2025-10-26T16:41:36",
            "creator": "Guardian Staff",
            "content": "Negative coverage about solid wall insulation (SWI) risks deterring people from insulating the UK’s 8. 5m solid-wall homes, which we need to do to meet targets for reducing greenhouse gas emissions, and also to install heat pumps efficiently (Almost all external insulation fitted under Tory scheme needs repair or replacing, report finds, 14 October). True, SWI is a high-risk retrofit measure since poor-quality installs can have catastrophic outcomes, but we have known this for a decade at least we need better-quality SWI and better training for installers. Your report says: “Almost all the external insulation fitted under the previous government’s energy efficiency scheme was installed so poorly it will have to be repaired or replaced.” But Ofgem and the Department for Energy Security and Net Zero know of 60, 000 SWI installs with government funding and wrote to all of them. However, only 5, 900 of them responded suggesting that only 10% thought that they had a problem. The article cites the National Audit Office report, which confuses failure to meet PAS 2035 (a very tough standard for retrofit measures) with “defects”. Other research also shows that SWI is often installed well. True, solid wall insulation can go very wrong. Like with roof repairs, poor workmanship or cutting corners can be very costly to correct. However, this is no reason to abandon solid wall insulation just as it is no reason to abandon roof repairs. Jason Palmer Senior research fellow, UCL Energy Institute Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section.",
            "media_url": "https://i.guim.co.uk/img/media/4081edf21b7f0b78c5e3e121965023e1874083a3/783_257_3316_2653/master/3316.jpg?width=140&quality=85&auto=format&fit=max&s=4dd12ec38ed24ec59ca944d93961b50b",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: David Gee 4/Alamy",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.125,
                "neg": 0.141,
                "neu": 0.734
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "48d05cd8-a360-419c-9cb6-4b7d82710ed1",
            "title": "The misery of our clocks going back | Brief letters",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/society/2025/oct/26/the-misery-of-our-clocks-going-back",
            "keywords": [
                "paul highfield sheffield all",
                "jonathan liew",
                "psychologically",
                "gloucestershire",
                "worcestershire",
                "gloucestershire re mondegreens",
                "andy coe norwich nuala young"
            ],
            "topics": [
                "politics"
            ],
            "description": "Darkened mood | Aston Villa-Maccabi Tel Aviv match | Homeless people | Misheard at a partyYour article (Looking forward to an extra hour in bed on Sunday? Time to thank a farsighted builder from Kent, 25 October) misses the main point for many people. The extra hour of darkness in the afternoons outweighs the extra morning hour of light. Psychologically, you can deal with darker mornings when you know it’s going to get light later, whereas those of us with seasonal affective disorder feel miserable at the prospect of endless hours of darkness from mid-afternoon onwards. Paul HighfieldSheffield• All praise to Jonathan Liew for the first sensible words about the Aston Villa-Maccabi Tel Aviv match (Standing with Maccabi’s football hooligans against local police is that what patriotism looks like now?, 21 October). It was never about antisemitism. Jewish Villa supporters will have no problem attending. It was about avoiding conflict and violence in a complex and politicised situation. Andy CoeNorwich.",
            "pub_date": "2025-10-26T16:40:05",
            "creator": "Guardian Staff",
            "content": "Your article (Looking forward to an extra hour in bed on Sunday? Time to thank a farsighted builder from Kent, 25 October) misses the main point for many people. The extra hour of darkness in the afternoons outweighs the extra morning hour of light. Psychologically, you can deal with darker mornings when you know it’s going to get light later, whereas those of us with seasonal affective disorder feel miserable at the prospect of endless hours of darkness from mid-afternoon onwards. Paul Highfield Sheffield All praise to Jonathan Liew for the first sensible words about the Aston Villa-Maccabi Tel Aviv match (Standing with Maccabi’s football hooligans against local police is that what patriotism looks like now?, 21 October). It was never about antisemitism. Jewish Villa supporters will have no problem attending. It was about avoiding conflict and violence in a complex and politicised situation. Andy Coe Norwich Nuala Young (Letters, 22 October) says that her children are homeless and living on narrowboats. I would think that most people who live on the streets, and who therefore actually are homeless, would consider her children to be very lucky indeed. John Kemp Cheltenham, Gloucestershire Re mondegreens and eggcorns (Letters, 12 October), at a friend’s party, my late wife, Margaret, asked a handsome young man what he did for a living. His response was: “I’m a heartbreaker.” “I bet you are,” was my wife’s reply to a surprised harp maker. John Bradley Kidderminster, Worcestershire Have an opinion on anything you’ve read in the Guardian today? Please email us your letter and it will be considered for publication in our letters section.",
            "media_url": "https://i.guim.co.uk/img/media/3e1a71448d0bcbf38436f927bbcccb22692446d6/0_0_3300_2640/master/3300.jpg?width=140&quality=85&auto=format&fit=max&s=84430a359413fcf71764987a53886369",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Richard Saker/The Observer",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.091,
                "neg": 0.096,
                "neu": 0.813
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "00675142-b3de-4b31-8c21-bfff0a2593bd",
            "title": "Rep. John Moolenaar says freeing the TikTok algorithm from China will be \"up to the experts\"",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/rep-john-moolenaar-says-freeing-the-tiktok-algorithm-from-china-will-be-up-to-the-experts/",
            "keywords": [
                "john moolenaar",
                "margaret brennan",
                "republican",
                "divestment",
                "completely",
                "that algorithm completely",
                "algorithm completely out",
                "chinese communist party"
            ],
            "topics": [
                "politics",
                "technology"
            ],
            "description": "Republican Rep. John Moolenaar, who is the chairman of the House select committee on the Chinese Communist Party, told \"Face the Nation with Margaret Brennan\" that with the TikTok deal set to be finalized this week that will require divestment of Chinese control of the algorithm, \"how you get that algorithm completely out of Chinese control is up to the experts.\".",
            "pub_date": "2025-10-26T16:39:00",
            "creator": "CBS News",
            "content": "Republican Rep. John Moolenaar, who is the chairman of the House select committee on the Chinese Communist Party, told \"Face the Nation with Margaret Brennan\" that with the TikTok deal set to be finalized this week that will require divestment of Chinese control of the algorithm, \"how you get that algorithm completely out of Chinese control is up to the experts.\".",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/637aa3e9-ff2e-4b93-9425-65bbd1ab2f8a/thumbnail/1200x630/6f795536e0c3ebdf15680b41a5e1fc13/102625-ftn-moolenaar.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.043,
                "neg": 0.0,
                "neu": 0.957
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "cfd8d836-5682-45b0-a578-27631cabb2e2",
            "title": "Watch live: Hurricane Melissa makes landfall in Jamaica as catastrophic flooding expected",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/news/hurricane-melissa-jamaica-flooding-livestream-b2852508.html",
            "keywords": [
                "elon musk",
                "investigating",
                "reproductive",
                "independent",
                "investigating the financials",
                "believe quality journalism",
                "fighting for reproductive",
                "entire political spectrum"
            ],
            "topics": [
                "politics",
                "technology"
            ],
            "description": "Watch live: Hurricane Melissa makes landfall in Jamaica as catastrophic flooding expected",
            "pub_date": "2025-10-26T16:37:10",
            "creator": "Lucy Leeson",
            "content": "From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground.",
            "media_url": "https://static.independent.co.uk/2025/10/22/13/20/AP25294565078216.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "NOAA via AP",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.05,
                "neg": 0.031,
                "neu": 0.919
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0df48162-c882-41fb-99db-232db316b646",
            "title": "Sen. Lindsey Graham says land strikes in Venezuela are a \"real possibility\"",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/sen-lindsey-graham-says-land-strikes-in-venezuela-are-a-real-possibility/",
            "keywords": [
                "lindsey graham",
                "margaret brennan",
                "administration",
                "possibility",
                "venezuelan",
                "potential military operations",
                "operations against venezuela",
                "military operations against"
            ],
            "topics": [
                "politics",
                "international"
            ],
            "description": "As the U. S. has conducted air strikes on Venezuelan boats the Trump administration has accused of carrying drugs and cartel members, Republican Sen. Lindsey Graham told \"Face the Nation with Margaret Brennan\" that land strikes in Venezuela are a \"real possibility,\" adding that \"President Trump told me yesterday that he plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia.\".",
            "pub_date": "2025-10-26T16:36:00",
            "creator": "CBS News",
            "content": "As the U. S. has conducted air strikes on Venezuelan boats the Trump administration has accused of carrying drugs and cartel members, Republican Sen. Lindsey Graham told \"Face the Nation with Margaret Brennan\" that land strikes in Venezuela are a \"real possibility,\" adding that \"President Trump told me yesterday that he plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia.\".",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/a0ea0a86-0080-460b-b96d-b8e6e77e2238/thumbnail/1200x630/6afa66b9cd32e1a5f5f6d1f79c650e31/102625-ftn-graham.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.097,
                "neu": 0.903
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "63b879c9-427d-4134-ab40-2afa7759a85e",
            "title": "‘Never worked harder’: Rodgers vows to end Celtic slump after Hearts defeat",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/football/2025/oct/26/brendan-rodgers-derek-mcinnes-hearts-celtic-scottish-premiership",
            "keywords": [
                "brendan",
                "rodgers",
                "disappointing",
                "performances",
                "championship",
                "minute including ourselves",
                "is obviously disappointing",
                "obviously disappointing in"
            ],
            "topics": [
                "sports",
                "football"
            ],
            "description": "‘We’ve just got to hang in there and find the results’Celtic eight points behind leaders Hearts after 3-1 defeatBrendan Rodgers insisted he has “never worked harder” to find on‑field answers after Celtic fell eight points behind Hearts in the Scottish Premiership with a 3-1 defeat in Edinburgh. The home team’s win means the champions have lost back‑to‑back league games and taken only 17 points from a possible 27 in their latest title defence. Rodgers denied he has lost appetite for the battle. “I’ve never worked harder in all my time here,” the Celtic manager said. “So the motivation is there to try and flip the levels that we’re at. It’s absolutely fine, it’s still so early. I think that’s the key point in it all.",
            "pub_date": "2025-10-26T16:35:51",
            "creator": "Ewan Murray at Tynecastle Park",
            "content": "Brendan Rodgers insisted he has “never worked harder” to find on‑field answers after Celtic fell eight points behind Hearts in the Scottish Premiership with a 3-1 defeat in Edinburgh. The home team’s win means the champions have lost back‑to‑back league games and taken only 17 points from a possible 27 in their latest title defence. Rodgers denied he has lost appetite for the battle. “I’ve never worked harder in all my time here,” the Celtic manager said. “So the motivation is there to try and flip the levels that we’re at. It’s absolutely fine, it’s still so early. I think that’s the key point in it all. “Hearts have made a fantastic start, got the points on the board, but there’s so much football to play. We’ve just got to hang in there at this moment, find those performances, find the results and hopefully our levels will improve as the season goes on.” Rodgers did admit he faced a challenge in changing the mentality of his squad. “We have to fill the players with confidence,” he said. “The context of today is obviously disappointing in the game and the result. But there are 29 games left.” Derek McInnes again played down the prospect of a first championship flag at Tynecastle since 1960. No team other than Celtic or Rangers has won the league since Alex Ferguson’s Aberdeen in 1985. “Celtic spend millions and they pay millions in wages, a lot more than we can ever do,” the Hearts manager said. “They, hands down, have got so many advantages over every other team in the league at the minute including ourselves. But we do feel as if there’s improvement in us. “There is a long way to go. If this was after the second round of games and we were sitting in the position then it might be a wee bit more difficult for me to sit here and say what I’m saying. But at the minute, it’s easy to say what I’m saying.”.",
            "media_url": "https://i.guim.co.uk/img/media/fad6d3c0e10d7e741d6692558bb98a6782b06f71/384_0_3824_3059/master/3824.jpg?width=140&quality=85&auto=format&fit=max&s=fd1290b021abe40705a82f445d82f196",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Steve Welsh/PA",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.14,
                "neg": 0.058,
                "neu": 0.802
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "4e393923-eb48-4128-ad20-83162c2e57e7",
            "title": "Labour failed to land message in by-election - deputy FM",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/news/articles/c6205gy757vo?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "wales",
                "huw",
                "irranca-davies",
                "excruciating",
                "disappointed",
                "prominent labour campaigner",
                "disappointed and thankfully",
                "defending against austerity"
            ],
            "topics": [
                "politics",
                "economy"
            ],
            "description": "Huw Irranca-Davies say Labour needs to review its style of campaigning and run a \"positive campaign\".",
            "pub_date": "2025-10-26T16:33:38",
            "creator": "BBC News",
            "content": "Labour \"failed to land message\" in Caerphilly by-election, according to Wales' deputy first minister. Huw Irranca-Davies told BBC Politics Wales that Labour needs to look at their style of campaigning and run a \"positive campaign\". Labour came third in Caerphilly, behind Plaid Cymru and Reform UK, with just 11% of the vote in a seat they'd held at every Senedd and Westminster election for a century. Owain Williams, a prominent Labour campaigner who has previously stood as a candidate for the party, said he believes the party should not be saying the \"country needs usI worry that people then think we take voters for granted,\" said Mr Williams. \"We should be looking at what's ahead and what we can offer people for the next five, 10, 20 years in Wales, not dwelling on the last 10, let alone the last 100 years.\" One Labour source described the campaign to me as \"excruciating\". Using a graphic which implied it was a two-horse race between themselves and Reform UK, when the polls suggested it was Plaid Cymru who was best placed to beat Reform was cited as one reason. Campaigning against the Labour council's plans to close libraries in the area raised eyebrows too. There were also legal letters sent to the party after they posted on social media an implication that Reform's candidate, Llŷr Powell, had links to Vladimir Putin an accusation the party firmly denies. They also referred to bribes taken by a former Reform leader. After the result, Powell said he had been subject to death threats and harassed during the campaign and he blamed Labour for that. \"I'm very disappointed and thankfully the voters had seen through their smear, fear,\" he said. \"They deserved to be in the gutter like their campaign belonged.\" Irranca-Davies said the party needed to run \"positive campaigns\" and they \"failed singularlyto talk about the investment in that constituency and in health\". He said of his party's candidate, Richard Tunnicliffe: \"I don't think Richard could have done any more, quite frankly. Labour got squeezed out of this contest. \"We weren't really in it, and it was from quite early on, when some of the early polling came out, people were making a really clear choice, saying, how do we stop Reform? \"I hope that what we do as we go forward now and into May is on a very positive footing about what the offer will be- what our record is, defending against austerity and what we've done over the last 12 months.\".",
            "media_url": "https://ichef.bbci.co.uk/news/1024/branded_news/edc6/live/98d25b90-b286-11f0-8aca-bd97d0c61a73.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/edc6/live/98d25b90-b286-11f0-8aca-bd97d0c61a73.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.094,
                "neg": 0.083,
                "neu": 0.823
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "651aecb9-8cb1-4787-8396-a2e07b9e7fd0",
            "title": "Kamala Harris hints at future presidential run, labels Trump a ‘tyrant’: ‘I am not done’",
            "source_title": "One America News Network",
            "source_link": "https://www.oann.com",
            "article_link": "https://www.oann.com/newsroom/kamala-harris-hints-at-future-presidential-run-labels-trump-a-tyrant-i-am-not-done/",
            "keywords": [
                "blake wolf",
                "kamala harris",
                "then-presidential",
                "unsuccessful",
                "additionally",
                "performance against then-presidential",
                "unsuccessful presidential campaigns",
                "against then-presidential candidate"
            ],
            "topics": [
                "politics",
                "media"
            ],
            "description": "Former Vice President Kamala Harris suggested that she is considering a third attempt to run for president, following two unsuccessful presidential campaigns.",
            "pub_date": "2025-10-26T16:33:07",
            "creator": "Blake Wolf",
            "content": "OAN Staff Blake Wolf 9: 33 AM Sunday, October 26, 2025 Former Vice President Kamala Harris suggested that she is considering a third attempt to run for president, following two unsuccessful presidential campaigns. In her first UK interview since her 2024 election defeat, Harris proclaimed that she is confident there will be a woman in the White House during her lifetime. In the BBC interview, Harris was directly asked if the first female president could be her, to which she responded, “Possibly.” “I am not done,” she continued. “I have lived my entire career as a life of service, and it’s in my bones.” Harris went on to note that she has not yet decided whether to run in the 2028 elections, while dismissing polling data that reveals she is not the frontrunner among the crowded list of potential Democratic candidates. “If I listened to polls, I would have not run for my first office, or my second office and I certainly wouldn’t be sitting here,” she stated. Additionally, Harris slammed President Donald Trump, stating that he rules like a “tyrant.” “He said he would weaponize the Department of Justice and he has done exactly that,” she stated. “There are many who have capitulated since day one,” Harris added. “They want to be next to power, to have a merger approved, or to avoid an investigation.” Meanwhile, the White House responded, mocking Harris for her “landslide” loss in the 2024 presidential election in which she was not able to secure a single swing state. “When Kamala Harris lost the election in a landslide, she should’ve taken the hint,” stated White House spokeswoman Abigail Jackson. “The American people don’t care about her absurd lies. Or maybe she did take the hint, and that’s why she’s continuing to air her grievances to foreign publications.” Harris first ran for president in 2019 while serving as a California senator, ultimately deciding to drop out of the race just two months before voting and caucusing began. A critical blow to Harris’s campaign came during a famous 2019 debate moment against then Democrat Rep. Tulsi Gabbard in a Democrat presidential primary debate. During the debate, Gabbard fiercely challenged Harris’s record as a California prosecutor, setting off roaring applause from the audience. “Senator Harris says she’s proud of her record as a prosecutor and that she’ll be a prosecutor president. But I’m deeply concerned about this record. There are too many examples to cite, but she put over 1, 500 people in jail for marijuana violations and then laughed about it when she was asked if she ever smoked marijuana,” Gabbard stated, leaving Harris stunned. Harris’s 2024 race was born out of the obvious mental decline of then-President Joe Biden, who dropped out after his disastrous debate performance against then-presidential candidate Donald Trump in June of 2024. Immediately after the debate, Biden refused to drop his reelection campaign despite public dissent from party leaders, including former U. S. House Speaker Nancy Pelosi (D-Calif.), before succumbing to party pressure. When asked whether Harris believes she would have won if Biden had dropped out of the race, she stated, “It’s unknowable.” It is currently unclear whether Harris will run for president in 2028, although she will have to overcome a crowded list of candidates to win the nomination, whereas in 2024, she was given the nomination by party leaders without winning any primaries. Stay informed! Receive breaking news alerts directly to your inbox for free. Subscribe here. What do YOU think? Click here to jump to the comments! Sponsored Content Below Share this post!.",
            "media_url": "https://www.oann.com/wp-content/uploads/2025/10/GettyImages-2238217249.webp",
            "media_type": "image/webp",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.048,
                "neg": 0.074,
                "neu": 0.878
            },
            "source": {
                "id": "one-america-news-network",
                "country": "US",
                "political_leaning": "far_right",
                "reliability_score": 4.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "27730baa-99de-4e74-a1bd-ca77559c4ae9",
            "title": "Start-ups warn Reeves over Budget tax bombshell",
            "source_title": "Sky News",
            "source_link": "https://news.sky.com",
            "article_link": "https://news.sky.com/story/start-ups-warn-reeves-over-budget-tax-bombshell-13458237",
            "keywords": [
                "rachel reeves",
                "sky news",
                "decision-makers",
                "public-interest",
                "contributions",
                "national insurance contributions",
                "intervention risks embarrassing",
                "launches commercially unviable"
            ],
            "topics": [
                "economy",
                "business",
                "finance"
            ],
            "description": "A lobbying group representing UK start-ups will this week warn Rachel Reeves against a tax raid on limited liability partnerships (LLPs), arguing that it would hit the backers of Britain's most innovative companies.",
            "pub_date": "2025-10-26T16:32:00",
            "creator": "Sky News",
            "content": "A lobbying group representing UK start-ups will this week warn Rachel Reeves against a tax raid on limited liability partnerships (LLPs), arguing that it would hit the backers of Britain's most innovative companies. Venture capital firms, along with private equity firms, law firms and accountants were alarmed last week by speculation that Ms Reeves was planning to raise close to £2bn by taxing LLPs in this way. Treasury officials are said to be in talks about the move ahead of next month's crucial Budget statement. \"Combined with last year's carried interest reforms, this is the second Budget where VC risks collateral damage from policies not designed for it and the combination of these changes could raise VCs' overall tax burden by around 30%,\" Dom Hallas, executive director of the Startup Coalition, will say in the letter. \"Any additional tax on partnership profits directly reduces the working capital available to investment teams. \"For more established funds, they would accelerate an existing trend: partners and decision-makers relocating to other jurisdictions. \"Fewer UK partners mean fewer meetings with British founders, fewer term sheets signed here, and less capital flowing into high-growth British companies.\" Read more: Cutting cash ISA allowance could backfire, MPs warn Be bold with tax hikes or risk 'groundhog day', chancellor told The group's intervention risks embarrassing the chancellor, given her pledge on Friday to \"supercharge innovation\" with a new unit aimed at so-called scale-up companies. Mr Hallas's letter will call on the chancellor to protect venture capital fund structures from new taxes \"while allowing the government to make changes to the wider LLP regime or similar areas\". He will also urge her to \"differentiate [venture capital] from private equity in the tax system, aligning treatment with its public-interest role in innovation\".",
            "media_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves-birmingham_7057202.jpg?20251021112203",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves-birmingham_7057202.jpg?20251021112203",
            "language": "en",
            "sentiment": {
                "pos": 0.05,
                "neg": 0.09,
                "neu": 0.861
            },
            "source": {
                "id": "sky-news",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "6e9b7518-af89-489d-897e-55153d494f0f",
            "title": "Carney claims feds have ‘sole responsibility’ for U.S. talks",
            "source_title": "Global News",
            "source_link": "https://globalnews.ca",
            "article_link": "https://globalnews.ca/news/11495433/mark-carney-trump-tariffs-ontario-ad/",
            "keywords": [
                "donald trump",
                "mark carney",
                "responsibility",
                "protectionism",
                "misrepresents",
                "outrageous pitching performance",
                "reagan presidential foundation",
                "government remained committed"
            ],
            "topics": [
                "government",
                "economy"
            ],
            "description": "U. S. President Donald Trump has threatened a new tariff against Canada, as Prime Minister Mark Carney says his country \"respects trade agreements.\".",
            "pub_date": "2025-10-26T16:30:09",
            "creator": "Sean Previl",
            "content": "As U. S. President Donald Trump threatens an increase in tariffs on Canada, Prime Minister Mark Carney says the federal government has “sole responsibility” for the country’s ongoing trade talks with its southern neighbour. “It is the sole responsibility of the government of Canada to have those discussions with the United States, and it’s the best way forward,” he told reporters Sunday. Carney was in Malaysia for the Association of Southeast Asian Nations leaders summit. His comments came hours after Trump threatened a 10 per cent tariff on top of what was already in place on Canada in response to an ad campaign launched by Ontario, which aired on American television. In a post on his Truth Social platform on Saturday evening, Eastern time, Trump once again criticized Canada for the airing of an ad that features clips of former president Ronald Reagan. “Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD,” Trump said. It’s not immediately clear yet how or when the new tariff would be implemented or to what products. The ad was run by the Ontario government on American television networks in the past week and features images of Americans from all walks of life going about their days over swelling music, with clips from Reagan’s 1987 radio address playing. That speech saw Reagan speak about “Free and fair trade,” and about how he views the risks of tariffs and protectionism against tariffs the U. S. was imposing at the time on Japanese goods. The speech itself was five minutes long, while the Ontario ad featuring Reagan’s remarks lasted about one minute. On Thursday night, the Ronald Reagan Presidential Foundation and Institute posted on X that the ad “misrepresents the ‘Presidential Radio Address to the Nation on Free and Fair Trade’ dated April 25, 1987.” It added Ontario did not receive foundation permission to “use and edit the remarks.” Ontario’s ad led to Trump announcing he was cutting off all trade talks with Canada. Trending Now OPINION: Outrageous pitching performance by Dodgers ace leaves Jays bats speechless Trump announces 10 per cent tariff increase on Canadian goods The Prime Minister’s Office confirmed on Friday that Carney and Trump have not spoken since the president cut off talks. While he did not specifically touch on the tariffs on Sunday in Malaysia, the prime minister did touch on his own country’s work on trade with other nations. “We respect trade agreements and the rule of law,” Carney told the leaders’ summit. “We value the exchange of goods, capital and ideas.” Despite this, Carney told reporters later on Sunday that the federal government remained committed to finding a trade deal with the U. S.. “The government of Canada stands ready to build on the progress that we had been making in our negotiations, our discussions with our American counterparts,” Carney said. Both Carney and Trump will be in close proximity this week, with the leaders set to attend the Asia Pacific Economic Cooperation forum in South Korea. During his speech to leaders on Sunday, Carney also reiterated his previous comments about needing reliable partners, noting “transactional bilateral trade,” and what he considered a new era of great power rivalry that is challenging global institutions countries like Canada and Southeast Asian countries have relied on. He also highlighted his government’s plan to double non-U. S. exports in the next decade and quadruple defence spending in the next four years. Carney also noted the recent trade agreement with Indonesia, the first with an ASEAN member, and pledged to move quickly on bilateral deals with other countries. The prime minister’s office also said Carney and Philippines President Ferdinand Marcos Jr. agreed to try and finalize a bilateral agreement in 2026.",
            "media_url": "https://globalnews.ca/wp-content/uploads/2025/10/mark-carney-asean.jpg?quality=65&strip=all",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://globalnews.ca/wp-content/uploads/2025/10/mark-carney-asean.jpg?quality=65&strip=all",
            "language": "en",
            "sentiment": {
                "pos": 0.086,
                "neg": 0.04,
                "neu": 0.875
            },
            "source": {
                "id": "global-news",
                "country": "CA",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "365d8192-c8e4-4679-9ae8-99b2196b0e4d",
            "title": "Novartis is in talks to buy U.S. biotech firm Avidity Biosciences for more than $70 a share, Bloomberg News reports",
            "source_title": "CNBC",
            "source_link": "https://cnbc.com",
            "article_link": "https://www.cnbc.com/2025/10/26/novartis-avidity-biosciences-talks.html",
            "keywords": [
                "novartis",
                "avidity",
                "oligonucleotide",
                "pharmaceutical",
                "infrastructure",
                "antibody oligonucleotide conjugates",
                "called antibody oligonucleotide",
                "manufacturing of cardiovascular"
            ],
            "topics": [
                "business",
                "finance",
                "technology"
            ],
            "description": "Swiss pharmaceutical giant Novartis is nearing a deal to buy biotechnology company Avidity Biosciences for more than $70 a share, Bloomberg News reported.",
            "pub_date": "2025-10-26T16:26:53",
            "creator": "CNBC",
            "content": "Swiss pharmaceutical giant Novartis is nearing a deal to buy biotechnology company Avidity Biosciences for more than $70 a share, Bloomberg News reported, citing a person familiar with the matter. A deal could be announced as early as Sunday, the report said. Novartis and Avidity didn't immediately respond to CNBC's requests for comment. Avidity specializes in developing an innovative class of ribonucleic acid (RNA) therapeutics called antibody oligonucleotide conjugates. RNA-based therapeutics are a relatively new class of medications that work by altering how genes are expressed to treat or prevent diseases. The reported discussions come as Novartis ramps up its research and development division. The company earlier this year pledged to invest $23 billion to build out its U. S.-based infrastructure, which includes plans to construct a second R&D hub in San Diego. The company has also struck two key deals with Anthos Therapeutics and Regulus Therapeutics this year to boost its development and manufacturing of cardiovascular and kidney disease drugs. Avidity shares closed at $49. 15 on Friday. The stock, which has a market capitalization of roughly $7. 2 billion, is up nearly 70% since the beginning of the year. Novartis shares closed at $130. 36 on Friday.",
            "media_url": "https://image.cnbcfm.com/api/v1/image/107404912-1713856534591-gettyimages-1913585778-SWITZERLAND_NOVARTIS.jpeg?v=1761491245&w=1920&h=1080",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.088,
                "neg": 0.01,
                "neu": 0.902
            },
            "source": {
                "id": "cnbc",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "a1cf53eb-7370-4484-ba93-ebe3bc80aa03",
            "title": "US and China reach ‘final deal’ on TikTok sale, treasury secretary says",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/technology/2025/oct/26/us-china-tiktok-deal-scott-bessent",
            "keywords": [
                "scott bessent",
                "margaret brennan",
                "administration",
                "international",
                "transferring",
                "investors include conservative",
                "successfully accomplished that",
                "expected face-to-face meeting"
            ],
            "topics": [
                "economy",
                "business",
                "government",
                "international"
            ],
            "description": "Scott Bessent said plan was part of framework for trade deal but did not share details on transferring app’s ownershipMurdoch, Ellison and China: what we know about the US’s TikTok dealUS treasury secretary Scott Bessent claimed on Sunday that the US and China have finalized the details of a deal transferring TikTok’s US version to new owners.“We reached a final deal on TikTok,” Bessent said on Sunday on CBS’s Face the Nation with Margaret Brennan. Alluding to Donald Trump and his Chinese counterpart, Xi Jinping, Bessent continued: “We reached [a deal] in Madrid, and I believe that as of today, all the details are ironed out, and that will be for the two leaders to consummate that transaction” during a meeting scheduled for Thursday in Korea.",
            "pub_date": "2025-10-26T16:25:00",
            "creator": "Michael Sainato",
            "content": "US treasury secretary Scott Bessent claimed on Sunday that the US and China have finalized the details of a deal transferring TikTok’s US version to new owners. “We reached a final deal on TikTok,” Bessent said on Sunday on CBS’s Face the Nation with Margaret Brennan. Alluding to Donald Trump and his Chinese counterpart, Xi Jinping, Bessent continued: “We reached [a deal] in Madrid, and I believe that as of today, all the details are ironed out, and that will be for the two leaders to consummate that transaction” during a meeting scheduled for Thursday in Korea. Bessent did not disclose any details of the deal. But he did say it was a part of a broader framework agreed to by both the US and China of a potential trade deal to be discussed when Trump and Xi meet in the coming days. The comments from Bessent came after Trump signed an executive order on 25 September paving the way for a deal for new ownership based in the US, with a majority of American investors. “I’m not part of the commercial side of the transaction,” Bessent added. “My remit was to get the Chinese to agree to approve the transaction, and I believe we successfully accomplished that over the past two days.” Trump’s 19-year-old son, Barron Trump, has been floated by the president’s former social media producer Jack Advent as a potential board member. Trump has indicated new US investors include conservative media owners Rupert Murdoch and Larry Ellison. In 2020, during his first presidency, Trump threatened to ban TikTok in 2020 in retaliation for China’s handling of Covid-19. Congress passed a ban of the app before it was signed into law in April 2024 by Joe Biden when he was president in between Trump’s two terms. It was set to go into effect on 20 January 2025 but was extended four times by Trump while his administration worked to develop a deal to transfer ownership. The deal is estimated to be valued at $14bn. The majority of US and international investors will own about 65% of the company, with ByteDance and Chinese investors owning less than a 20% stake. Trump’s executive order hands oversight of the app’s algorithm to the new investors, including six out of seven seats on the board of directors. Trump arrived in Malaysia on Sunday for a summit of the Association of Southeast Asian Nations, as part of a five-day tour of the continent, with an expected face-to-face meeting between Trump and Xi on Thursday.",
            "media_url": "https://i.guim.co.uk/img/media/73e7a1c06c3fcf1be9ffe64573ffedb27d6f88a7/0_0_5033_4024/master/5033.jpg?width=140&quality=85&auto=format&fit=max&s=13f2cc573730cb0058f6b8ac506b439e",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Samuel Boivin/NurPhoto/Shutterstock",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.051,
                "neg": 0.032,
                "neu": 0.917
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "71797db8-0bcc-4b82-ae9f-fa3e3835193c",
            "title": "South Metro Fire District warns of possible delays if tax measure fails",
            "source_title": "ABC7 Denver",
            "source_link": "https://www.denver7.com",
            "article_link": "https://www.denver7.com/news/politics/south-metro-fire-district-warns-of-possible-delays-if-tax-measure-fails",
            "keywords": [
                "election",
                "arapahoe",
                "contributing",
                "dramatically",
                "consequences",
                "legislation reducing property",
                "facing significant challenges",
                "about potential consequences"
            ],
            "topics": [
                "economy",
                "politics",
                "government",
                "local"
            ],
            "description": "Voters in Arapahoe, Douglas, and Jefferson counties are weighing Ballot Measure 7A, which proposes a property tax increase to address a budget shortfall in the South Metro Fire District.",
            "pub_date": "2025-10-26T16:24:46",
            "creator": "Claire Lavezzorio",
            "content": "CENTENNIAL, Colo. With Election Day just 10 days away, Arapahoe, Douglas, and Jefferson county voters must decide how to fund their fire district's future. Ballot Measure 7A asks voters to approve a property tax increase for the South Metro Fire District, which faces a significant annual budget shortfall. The fire district serves around 600, 000 people and is facing significant challenges. \"In the last five years, the total call volume has gone up 24%,\" said board chair Jim Albee. Albee explained that increased emergency calls are just one factor contributing to the financial strain. Recent state legislation reducing property taxes has also cut district revenue, including for South Metro. \"We are 81% funded by property tax, so the effect of that legislation had a significant impact on our resources, and what we believe are our resources to serve the community going forward,\" said Albee. The cost of serving the community has also risen dramatically. Everything from firefighter gear to emergency vehicles has become more expensive, putting additional pressure on the district's budget. \"Our message is that we want to continue doing that, and it's going to take a little bit more than what they've been paying,\" he said. Over the last several months, South Metro surveyed voters in the district. According to officials, most respondents preferred a sales tax increase over a property tax increase, though Measure 7A proposes the latter. If the mill levy passes, a homeowner with a $750,000 house the district's average will pay about $140 more per year. On Saturday, Denver7 met voter Mary Alice Mehaffy, who was dropping off her ballot in Centennial. Mehaffy said she would have preferred a sales tax increase and believes areas of growth like Sterling Ranch should bear a greater share of the costs. \"If there is a shortfall, it should go where the new growth is, and the new growth should be picking up the tab for that shortfall,\" said Mehaffy. On the other hand, voter Sandy Britton said personal experience with the department's services convinced her to vote \"yes\" on the property tax increase. \"My husband had MS for years and was in a wheelchair,\" she said. \"He fell quite a few times. I'd call them. They'd come to the house, pick them up, help me. So, yeah, I'm standing behind them.\" South Metro officials warned about potential consequences if the measure fails to pass. \"We will still come. We will still serve as well as we can. It may take us longer to get there. There may be fewer people who arrive initially when we show up on scene,\" said Albee. With the choice now in voters' hands, Mehaffy emphasized the importance of casting your ballot. \"Your voice does matter, and I just want everyone to know that,\" she said.",
            "media_url": "https://ewscripps.brightspotcdn.com/dims4/default/9204970/2147483647/strip/true/crop/2534x1330+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Ff8%2F56%2F0e8609eb4e7dade03780b8ab591b%2F7a.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.111,
                "neg": 0.049,
                "neu": 0.839
            },
            "source": {
                "id": "abc7-denver",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "af27f913-d12b-46b2-8e53-166b029252b5",
            "title": "Transcript: Sen. Lindsey Graham on \"Face the Nation with Margaret Brennan,\" Oct. 26, 2025",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/news/lindsey-graham-south-carolina-republican-face-the-nation-transcript-10-26-2025/",
            "keywords": [
                "lindsey graham",
                "margaret brennan",
                "narco-terrorists",
                "congressional",
                "declaration",
                "military operations potentially",
                "potential military operations",
                "operations against venezuela"
            ],
            "topics": [
                "politics",
                "government",
                "media"
            ],
            "description": "The following is the transcript of the interview with Sen. Lindsey Graham, Republican of South Carolina, that aired on \"Face the Nation with Margaret Brennan\" on Oct. 26, 2025.",
            "pub_date": "2025-10-26T16:24:39",
            "creator": "CBS News",
            "content": "The following is the transcript of the interview with Sen. Lindsey Graham, Republican of South Carolina, that aired on \"Face the Nation with Margaret Brennan\" on Oct. 26, 2025. MARGARET BRENNAN: We turn now to Republican Senator Lindsey Graham. He joins us from Seneca, South Carolina. Welcome back to Face The Nation. Senator-- SENATOR LINDSEY GRAHAM: Good morning. MARGARET BRENNAN: On Friday, Defense Secretary Hegseth ordered the deployment of the Navy's most advanced aircraft carrier, the Gerald Ford, to Latin America. President Trump was asked if he planned to ask Congress for a declaration of war. Take a listen. [SOUND ON TAPE BEGINS] PRESIDENT DONALD TRUMP: I don't think we're going to necessarily ask for a declaration of war. I think we're just going to kill people that are bringing drugs into our country, OK. We're going to kill them. You know, they're going to be, like, dead. [SOUNDS OF TAPE ENDS] MARGARET BRENNAN: You don't need an aircraft carrier to hit drug boats are land strikes planned? SEN. GRAHAM: Yeah, I think that's a real possibility. I think President Trump's made a decision that Maduro, the leader of Venezuela, is an indicted drug, drug trafficker, that it's time for him to go, that Venezuela and Colombia have been safe havens for narco-terrorists for too long, and President Trump told me yesterday that he plans to brief members of Congress when he gets back from Asia about future potential military operations against Venezuela and Colombia. So there will be a congressional briefing about a potential expanding from the sea to the land. I support that idea, but I think he has all the authority he needs. Senator Gallego, on another network, accused President Trump and our military of committing murder by attacking these drug boats. To our men and women in uniform, you're not murdering anybody. You're making America safer by going after a narco-terrorist. You're following lawful orders. When President Bush, 41, took Ortega out in Panama, Reagan went into Grenada to deal with the Cuban influence from Grenada in our backyard, he has all the authority in the world. This is not murder. This is protecting America from being poisoned by narco-terrorists coming from Venezuela and Colombia. MARGARET BRENNAN: Well, a lot there. But just to clarify the examples you're citing, also involved ground troops. You said time for Maduro to go. That sounds a lot like regime change. Are you talking about troops on the ground? SEN. GRAHAM: I'll let the President speak to that. I'm talking about a briefing that would expand military operations potentially from the sea to the land. It is time for Maduro to go. It was time for Ortega to go. You know, the Monroe Doctrine has been robustly applied by President Trump. So these military assets are moving forward to deal with a country that's got blood on its hands when it comes to Americans by flooding our country with drugs from Venezuela and Colombia. So I hope Maduro would leave peacefully, but I don't think he's going to stay around much longer. I think President Trump is tired of Venezuela being used as a staging platform to poison America? MARGARET BRENNAN Well, there's a lot there, sir, but you cited a Democratic senator's criticism. He's not the only one. Some of your Republican colleagues have been uncomfortable with what little information has been shared with Congress. Take a listen: [SOUND ON TAPE BEGINS] SEN. RAND PAUL: If they want all out war where we kill anybody and everybody that is in the country of Venezuela or coming out that has to have a declaration of war. It's something that is not pretty, very expensive, and I'm not in favor of declaring war on Venezuela, but the Congress should vote. And the President shouldn't do this by himself. SEN. TODD YOUNG: If this was happening with this level of insight under the Biden administration, I'd be apoplectic. [SOUND ON TAPE ENDS] MARGARET BRENNAN: Todd Young also criticized this, what exactly is the end game? Because you're talking about regime change in Venezuela, the President says this is about drug boats. SEN. GRAHAM: Yeah. Well, I think the end game is to make sure that Venezuela and Colombia cannot be used to poison America, that the narco-terrorist dictator Maduro no longer be able to threaten our country and to send in drugs to kill Americans. As to Rand Paul, I just disagree fundamental with his approach. We didn't have a declaration to go into Panama. Bush 41 went into Panama to replace the leadership there, because the Panama leadership, Panamanian leadership, were working with drug cartels to threaten our country. Reagan didn't have a declaration of war congressional authorization to deal with Cuban influence. So this idea- Rand Paul, I just fundamentally disagree with. To the other senators, you deserve more information, and you're going to get more information, but there is no requirement for Congress to declare war before the commander-in-chief can use force. Panama and Grenada are two examples in our backyard, where Republican presidents chose to go after countries and leaders that were threatening our people. MARGARET BRENNAN: But there seemed to be a number of issues wound up in here. I know you personally used to serve as a judge advocate in the Air Force. We looked at the JAG manual: preventative self defense employed to counter non imminent threats is illegal under international law. So if we are not at war and these suspected criminals pose no threat of imminent violence, isn't this potentially a war crime to be killing the people on these boats and then to be taking out a leader? SEN. GRAHAM: No, not at all. I don't know what man you're referring to, but I know what President Bush, 41 did. He took down Ortega [sic], the leader of Panama, because he was involved in drug trafficking threatening our country. Venezuela is now partnering with Hezbollah. Hezbollah is running out of money because Iran is weak. MARGARET BRENNAN: That's not new. SEN. GRAHAM: Partnering with drug cartels in Venezuela. No, it should have stopped. Here's what, here's what's new. You got a commander-in-chief's not going to put up with this crap. We're not going to sit on the sidelines and watch boats full of drugs come to our country. We're going to blow them up and kill the people that want to poison America, and we're now going to expand operations, I think, to the land. So please be clear about what I'm saying today. President Donald Trump sees Venezuela and Colombia as direct threats to our country, because they house Narco terrorist organizations. The leader of Venezuela is an indicted drug dealer in American courts. So yeah, the game is changing when it comes to drug traffickers and drug cartels. We're going to use military force like we have in the past to protect our country. That's the new game we're playing, and I'm glad we're playing that game, and if I were Maduro, I'd find a way to leave before heat goes down. MARGARET BRENNAN: But is trafficking cocaine an armed attack on the United States? That's what you're equating it to? SEN. GRAHAM: I am saying that there's plenty of law under article, Article Two powers of the President are designed to protect our countries from threats foreign and domestic. Was it illegal for Bush to take Ortega out in Panama? Was it illegal for Reagan to go into Grenada to stop Cuban influence building this big, long runway? There's plenty of precedent here to do what he's doing. But the game has changed. The game has changed when it comes to narco trafficking, drug organizations. We're going to take you out. MARGARET BRENNAN: Well, you referenced something earlier. Sorry. I want to come back to you said to the men and women of the military that they are carrying out lawful orders. Secretary Hegseth removed the top uniformed lawyers in the Air Force, you know this, the Navy and the Army, because he called them roadblocks to orders that are given by a commander-in-chief. There have been other departures as well. This raises concern that commanders are not being given adequate legal counsel. That is why you just said that sentence, to assure them. SEN. GRAHAM: That's that's garbage, that's absolute garbage- (Crosstalk) MARGARET BRENNAN: Which that Hegseth said that? SEN. GRAHAM: No, no. I'm saying that- the theory that President Trump's doing something here illegally, dealing with a country that's run by an indicted drug dealer. It's the same as Panama. There's a better case to go into Venezuela than there was Panama. There's a better case to deal with Colombia than there was Grenada. Yeah, I've been doing this all of my adult life. I have all the confidence in the world that President Trump has the legal authority, but more importantly, he's doing the right thing. More Americans have died from cocaine and fentanyl poisoning than any terrorist group in the world. I am very pleased that we now have a president who's going to use the full force of, of the American people, the might of America, to protect us from narco terrorist states and drug organizations. Keep it up, Mr. President, we're not committing murder. We're protecting our nation from people who want to poison us. MARGARET BRENNAN: Well, there's obviously buyers on the other end of it, which is why the cartels are selling, right? SEN. GRAHAM: Well yeah, we'll deal with both. We'll deal with both. MARGARET BRENNAN: Well I want to come back to- when we talk about lawful orders here, I myself spoke to a former senior commander who said he'd want that in writing because of concern that, that this is going to be down the line questionable. SEN. GRAHAM: What in writing? MARGARET BRENNAN: You've already heard the orders to carry out operations. You've already heard Democratic lawmakers, including on this program, say that they have concerns about future prosecutions of officers. SEN. GRAHAM: Well act on your concerns. Why don't you- Why don't you- Okay, if you've got concerns, here's what we can do as members of Congress. We can cut off funding for military operations we don't like. So if you're concerned as a Democrat or Republican, why don't you introduce legislation to cut off all funding to the military when it comes to attacking drug votes and going after narco terrorist states through the military. You can do that. Go ahead and do it. I'll vote no. I think it has all the authority in the world under Article Two and international law to make sure that countries like Venezuela can't be staging areas to infiltrate drugs into our country. It's not a, I think it has all the legal authority in the world. I'm just really glad he's doing this and Mr. President, keep it up. MARGARET BRENNAN: Well, we look forward to hearing those justifications when they are shared with Congress. You made some news there, Senator. Thank you for your time today. We'll be back in a moment.",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/042a0e35-1cf6-4705-b51b-223fe23dded8/thumbnail/1200x630/8efde0393c437c5ebfde795a4f031a5b/1761495726600.png",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.091,
                "neg": 0.075,
                "neu": 0.834
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "c22e4baf-f11b-4ae7-b95c-773cba700628",
            "title": "YouTuber Mr Crafty Pants arrested for alleged possession of sexual images of children",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/news/world/americas/crime/youtube-mr-crafty-pants-arrest-child-porn-b2852499.html",
            "keywords": [
                "michael david booth",
                "kik",
                "gut-wrenching",
                "distributing",
                "additionally",
                "influencer allegedly possessed",
                "distributing matter portraying",
                "portraying sexual performance"
            ],
            "topics": [
                "crime",
                "internet",
                "media",
                "child",
                "abuse"
            ],
            "description": "Police said the IP address connected to the social media account was the same as Michael David Booth’s home address.",
            "pub_date": "2025-10-26T16:23:05",
            "creator": "Isabel Keane",
            "content": "A popular YouTuber known as “Mr. Crafty Pants” was arrested for allegedly possessing and distributing sexual images of children on social media. Michael David Booth, who gained over half a million YouTube subscribers and hundreds of thousands of followers on Facebook and Instagram for his DIY craft tutorials, was arrested Wednesday in Kentucky after police say he shared the disturbing images on the social media app, Kik, WAVE News reported. The 39-year-old social media influencer allegedly possessed six explicit photos, three of which showed children under the age of 12 and three that depicted teenagers. The images of the children under 12 were shared at least 12 times, whereas those of the teens were distributed at least 15 times, according to an arrest report obtained by the outlet. The files containing illicit material involving children were allegedly sent from Booth’s Kik account between August 5 and August 7, according to Fox 56. A search warrant on Booth’s Kik reportedly unveiled two “selfie-type” photos of Booth, allegedly confirming he was behind the account, according to the outlet. Additionally, a subpoena for the IP address used to distribute the disturbing material returned as Booth’s home address in Prospect, a rural suburb of Louisville, according to WAVE News. His arrest left the typically quiet neighborhood shaken. “So we walked out our front door on Wednesday to a very heavy police presence,” Laura Nash, who lives across the street from Booth, told WDRB. “My heart dropped. Felt sick to my stomach. It was gut-wrenching and eye-opening.” Another neighbor, Lindsay Smart, noted a Halloween sign in Booth’s front yard reading, “I smell children,” showed that appearances could be deceiving. “You feel like you know your neighbors, but what goes on behind closed doors. I guess we never know,” Smart said. “It’s sickening, it’s disgusting, and I’m so glad he got caught.” Booth was charged with at least 20 counts of distributing matter portraying sexual performance by a minor. Booth appeared in Jefferson County District Court Thursday morning, where a judge set his bond at $100,000 full cash and ordered that he have no contact with minors, and no Internet or social media access. Booth entered a plea of not guilty on all charges.",
            "media_url": "https://static.independent.co.uk/2025/10/26/15/09/Mr--Crafty-Pants-YouTuber-arrested-for-alleged-possession-of-child-sexual-images.png?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/png",
            "media_description": null,
            "media_credit": "Mr. Crafty Pants/ Facebook",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.065,
                "neg": 0.093,
                "neu": 0.842
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "5cebfcc2-133e-4c78-8aa8-5091ee3ad64e",
            "title": "Lyle Foster nets dramatic late winner as Burnley edge sorry Wolves",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/wolves-sam-johnstone-premier-league-vitor-pereira-leicester-b2852509.html",
            "keywords": [
                "lyle",
                "foster",
                "stoppage-time",
                "dispossessed",
                "quilindschy",
                "diverted jean-ricner bellegarde",
                "of second-half stoppage-time",
                "dramatic last-minute winner"
            ],
            "topics": [
                "sports",
                "football"
            ],
            "description": "Lyle Foster nets dramatic late winner as Burnley edge sorry Wolves",
            "pub_date": "2025-10-26T16:22:26",
            "creator": "Sunny Badwal",
            "content": "Lyle Foster came off the bench and scored a dramatic last-minute winner as Burnley snatched a 3-2 Premier League victory away to bottom side Wolves. It marked six months to the day since the hosts last won in the league a 3-0 win over Leicester and their wait for a first this campaign continued as they let in a late goal for the fourth game in a row. The game had a feel of an early season ‘six-pointer’ for this campaign’s relegation battle and Burnley sensed the tension in the air at Wolves early on. They pounced into a deserved two-goal lead courtesy of Zian Flemming’s first pair of Premier League goals, both assisted by Quilindschy Hartman. The Clarets looked comfortable but the hosts made it a level game out of nowhere thanks to Jorgen Strand Larsen’s penalty and Marshall Munetsi’s first of the campaign. Scott Parker’s side initially surrendered a two-goal lead, which looked like it would deny them a first victory on the road until Foster struck in the fifth and final minute of second-half stoppage-time. Strand Larsen and Wolves boss Vitor Pereira went over to the fans following the final whistle and chants of “you’re not fit to wear the shirt” and “sacked in the morning” belted down from the stands, directed at the players and Pereira. Wolves goalkeeper Sam Johnstone was brought into action early on and he produced a diving save to bat Josh Cullen’s goal-bound volley away. Axel Tuanzebe’s sloppiness on the ball almost gave the home side a lead at the other end as he was dispossessed by Jhon Arias, who ran through on goal but sent his end product straight at Martin Dubravka. Burnley drew first blood with the simplest of goals. Hartman sent a routine long ball over the top which was perfectly read by Flemming and he watched the ball come over his shoulder before connecting with a smart volley into the bottom corner. Loud boos rang around Molineux as Burnley doubled their advantage on the half-hour mark. Another long ball over the top proved to be Wolves’ downfall as Hartman latched onto Cullen’s high pass on the byline and he sent a low cross across the face of goal to Flemming, who was waiting to tap in his second of the afternoon. Wolves were clearly second best throughout the first period but were offered an olive branch by their opponents for a way back into the contest when Cullen brought down Santiago Bueno inside the box. Referee Tony Harrington pointed to the penalty spot and Strand Larsen was the coolest man inside Molineux as he sent Dubravka the wrong way to halve the deficit with his first for the season. The fighting spirit had not gone and Wolves fought back and to score a leveller on the stroke of half-time. Ladislav Krejci diverted Jean-Ricner Bellegarde’s cross into the path of Munetsi and he was able to nod the ball beyond Dubravka. The woodwork stopped Wolves from taking the lead as Arias saw his free-kick beat the diving Dubravka but crashing off the upright and away from danger. Wolves pushed Burnley deeper in search of the winner Dubravka was forced in a couple of saves to deny Strand Larsen’s header and Bellegarde’s thumping strike. The visitors snatched all three points at the death as Hannibal Mejbri slipped through to Foster and he guided his finish beyond the onrushing Johnstone as boos rang round Molineux.",
            "media_url": "https://static.independent.co.uk/2025/10/26/16/c2e83a63277672c84579051d65958f06Y29udGVudHNlYXJjaGFwaSwxNzYxNTgxMTMy-2.82162687.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.091,
                "neg": 0.082,
                "neu": 0.828
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "d3d211ea-8217-46e2-b8b1-30165f1a3fb2",
            "title": "Former NFL center Nick Mangold dies shortly after sharing he needed kidney transplant",
            "source_title": "NEWS10 ABC",
            "source_link": "https://news10.com",
            "article_link": "https://www.news10.com/news/former-nfl-center-nick-mangold-dies-shortly-after-sharing-he-needed-kidney-transplant/",
            "keywords": [
                "nick mangold",
                "kidney disease",
                "transplant",
                "nfl",
                "all-pro"
            ],
            "topics": [
                "health",
                "medicine",
                "sports"
            ],
            "description": "His death comes less than two weeks after the two-time All-Pro selection announced on social media that he had kidney disease and needed a transplant.",
            "pub_date": "2025-10-26T16:22:00",
            "creator": "The Associated Press",
            "content": null,
            "media_url": "https://www.news10.com/wp-content/uploads/sites/64/2025/10/AP25287760066656-e1761495594674.jpg?w=800",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "news10-abc",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "d26d6256-0f0c-4a8c-bb75-3d78de1ee4c8",
            "title": "Bournemouth up to second as Sean Dyche suffers opening league defeat",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/bournemouth-sean-dyche-nottingham-forest-europa-league-premier-league-b2852503.html",
            "keywords": [
                "dyche",
                "europa league",
                "milosavljevic",
                "confrontation",
                "second-minute",
                "gibbs-white forced petrovic",
                "replace oleksandr zinchenko",
                "kroupi doubled bournemouth"
            ],
            "topics": [
                "sports",
                "football",
                "economy"
            ],
            "description": "Bournemouth 2-0 Nottingham Forest: Goals from Marcus Tavernier and Junior Kroupi spoiled the Forest manager’s first domestic match in charge.",
            "pub_date": "2025-10-26T16:21:45",
            "creator": "Rachel Steinberg",
            "content": "Sean Dyche’s first Premier League match in charge of Nottingham Forest ended in defeat as Bournemouth climbed to second place in the table with a 2-0 victory at the Vitality Stadium. Forest were hoping to build on momentum from Thursday night’s 2-0 Europa League win over Porto their first victory across all competitions since August. Instead, they fell behind when Marcus Tavernier opened the scoring directly from a 25th-minute corner. Junior Kroupi doubled Bournemouth’s advantage before the break, the fourth goal in the 19-year-old’s last three Cherries appearances. Both bosses made a single change to their line-ups, Iraola bringing in Veljko Milosavljevic for Bafode Diakite while Dyche was forced to replace Oleksandr Zinchenko with Nicolo Savona as a result of the former picking up an injury in the European win. Marcus Tavernier tested Matz Sels early on, forcing the Forest keeper into a low, second-minute save. Sels then denied Antoine Semenyo as the Cherries remained on the front foot through the first 15 minutes. The visitors had barely ventured into Bournemouth’s half when Douglas Luiz and Justin Kluivert got into a heated, physical confrontation in midfield, sparking members of both sides to rush in and calm the situation. Both players were issued 18th-minute yellow cards, and a second pause was required moments later as referee Sam Barrott once again called for cooler heads. Forest had registered just one shot by Neco Williams, and well off target by the time Tavernier opened the scoring in the 25th minute, whipping his corner beyond the leaping Sels. The visitors protested, believing it was Tavernier who had last touched the ball before the corner was awarded and that Tyler Adams had fouled Sels in the air, but the officials disagreed and the contest carried on. Djordje Petrovic was finally called into action from Williams’ effort before Kroupi doubled the Cherries’ advantage, latching onto a loose ball in midfield before beating Sels from 25 yards out and inspiring a chorus of “you’re getting sacked in the morning” directed at the new Forest boss. Dyche made a triple change, bringing on Taiwo Awoniyi, Omari Hutchinson and Ryan Yates for Igor Jesus, Callum Hudson-Odoi and Luiz as the second half got out to a more even start. But chances remained scarce until Morgan Gibbs-White forced Petrovic into a diving stop with just over 13 minutes remaining.",
            "media_url": "https://static.independent.co.uk/2025/10/26/16/0bad10eb3d9f083ecf4b5255d7e8e752Y29udGVudHNlYXJjaGFwaSwxNzYxNTgxNTYy-2.82161257.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.066,
                "neg": 0.071,
                "neu": 0.863
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "e10e07bb-203d-4355-9518-20510bc1ce7a",
            "title": "Bournemouth’s brilliance brings Sean Dyche’s Forest back down to earth",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/football/2025/oct/26/bournemouth-nottingham-forest-premier-league-match-report",
            "keywords": [
                "nottingham forest",
                "andoni iraola",
                "distinguished",
                "milosavljevic",
                "withstanding",
                "outstanding veljko milosavljevic",
                "truss-length managerial reigns",
                "bournemouth is withstanding"
            ],
            "topics": [
                "sports"
            ],
            "description": "For a club where time is forever in short supply, Nottingham Forest’s reversion to a no-nonsense manager may take a while yet to pay off. Still, not every opposing team will play like Bournemouth, where Forest lost 5-0 last season, and have not won since 2014. Andoni Iraola’s team climbed to second, delivering portions of the football from the gods that makes their manager one of the hottest properties in the game. After scoring directly from a corner through Marcus Tavernier set pieces continued to haunt Forest there was further evidence of Bournemouth’s ability to find top talent when their second came from Eli Junior Kroupi. The teenager from the Cherries sister club, Lorient, followed up last week’s double at Crystal Palace with a lashing finish.",
            "pub_date": "2025-10-26T16:20:48",
            "creator": "John Brewin at the Vitality Stadium",
            "content": "For a club where time is forever in short supply, Nottingham Forest’s reversion to a no-nonsense manager may take a while yet to pay off. Still, not every opposing team will play like Bournemouth, where Forest lost 5-0 last season, and have not won since 2014. Andoni Iraola’s team climbed to second, delivering portions of the football from the gods that makes their manager one of the hottest properties in the game. After scoring directly from a corner through Marcus Tavernier set pieces continued to haunt Forest there was further evidence of Bournemouth’s ability to find top talent when their second came from Eli Junior Kroupi. The teenager from the Cherries sister club, Lorient, followed up last week’s double at Crystal Palace with a lashing finish. The was a familiar feeling for Sean Dyche at the scene of his final match in charge of Everton, January’s 1-0 defeat. While beating Porto Unlike Postecoglou, Dyche has Forest heritage. To set aside Nigel Clough at Mansfield, the last of Brian Clough’s former players in the management game is accompanied by two far more distinguished wearers of the Garibaldi red in Ian Woan and Steve Stone, 90s playing legends at his side again. How long can that protect him? A manager whose reputation lies in survival suits Forest’s current plight they remain in the bottom three while the club president is a man of far loftier ambitions. If Iraola is not a confirmed devotee of the vogue for set pieces, the selection of the outstanding Veljko Milosavljevic, showed the Basque is fully aware of their importance; his team are no slouches at that discipline, either. Bournemouth’s other teenager added necessary height to central defence despite Forest being without Chris Wood. In the New Zealander’s place, Igor Jesus is yet to repeat his Europa League form in the Premier League and did not last beyond half-time. In midfield, Morgan Gibbs-White, who had Forest’s best effort of the first half, and Elliot Anderson, two England regulars, found space squeezed to a premium. The first task when facing Bournemouth is withstanding the blizzard of attacking play they habitually begin matches with. Forest defenders threw in multiple blocks; Dyche’s Burnley and Everton teams were statistical outliers in that area. As his team endured, heavy pressure came the familiar boom of Dyche’s voice; should Forest not work out, a career as a black metal vocalist could beckon. Forest’s frustrations were borne out in a flashpoint between Douglas Luiz and Justin Kluivert that resulted in both being booked. If that failed to halt Bournemouth’s momentum so did Forest’s go-slow, as prescribed by their bellowing tracksuit manager. Neither skinny jeans nor flares for a manager dressed for business. Dyche could only shake his head as Matz Sels flapped at Tavernier’s corner, the confused goalkeeper forlornly swinging off the bar after what South Americans call a “gol Olimpico”. “Sacked in the morning” came the waggish chant from the home fans. Kroupi, seizing on the ball after the excellent Tyler Adams had robbed Anderson, doubled the lead. Half-time brought three Forest changes with Taiwo Awoniyi, Omari Hutchinson and Ryan Yates introduced. Improvement in the shape of solidity resulted, Bournemouth not quite as comfortable, the flow of chances stemmed by added muscle, Yates making himself busy in haring after everything that moved. There was still an absence of the creativity lacking since Nuno Espírito Santo’s later days in charge, though Gibbs-White, in linking with Hutchinson, did force a fine save from Dorde Petrovic. A better chance fell to David Brooks, whose goal in January was the final blow for Dyche at Everton. The Welshman’s shot skidded wide, the chance created by Forest dithering in defence because Bournemouth were continuing to suffocate space. Brooks and fellow sub Ryan Christie might well have finished the job, only for their flicks and tricks to over elaborate. Entertaining football is part of the package for a team going places. For Forest fans, staring at the abyss, their latest manager unapologetic over his methods, a grind awaits.",
            "media_url": "https://i.guim.co.uk/img/media/3a053b6642563c6b6fd54878209ceb2c0c7b71b3/220_0_3750_3000/master/3750.jpg?width=140&quality=85&auto=format&fit=max&s=fcfddfc43eeb2f7b9ac9b34c24413f1f",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Robin Jones/AFC Bournemouth/Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.072,
                "neg": 0.073,
                "neu": 0.855
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "1cf3475d-32ae-4da2-835b-54a367e54c6a",
            "title": "TikTok deal to be finalized Thursday, Treasury Secretary Scott Bessent says",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/tiktok-deal-to-be-finalized-thursday-treasury-secretary-scott-bessent-says/",
            "keywords": [
                "trump",
                "scott bessent",
                "effectively",
                "additional",
                "secretary",
                "treasury secretary scott",
                "secretary scott bessent",
                "and treasury secretary"
            ],
            "topics": [
                "economy",
                "politics"
            ],
            "description": "With President Trump and Treasury Secretary Scott Bessent on a trip to Asia, Bessent told \"Face the Nation with Margaret Brennan\" that the TikTok deal will be finalized by Thursday. Bessent also said additional 100% tariffs with China are \"effectively off the table\" after the two-day meeting.",
            "pub_date": "2025-10-26T16:19:00",
            "creator": "CBS News",
            "content": "With President Trump and Treasury Secretary Scott Bessent on a trip to Asia, Bessent told \"Face the Nation with Margaret Brennan\" that the TikTok deal will be finalized by Thursday. Bessent also said additional 100% tariffs with China are \"effectively off the table\" after the two-day meeting.",
            "media_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/10/26/bb172999-8d2e-464d-ab24-0320907923e5/thumbnail/1200x630/d188500138ac3d346993bdc696df8e53/102625-ftn-bessent.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.097,
                "neg": 0.0,
                "neu": 0.903
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "cdac742c-9e2c-460f-b9d4-5853f47492b2",
            "title": "House Minority Leader Hakeem Jeffries says healthcare premiums are \"not locked in\"",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/house-minority-leader-hakeem-jeffries-says-healthcare-premiums-are-not-locked-in/",
            "keywords": [
                "hakeem jeffries",
                "margaret brennan",
                "enrollment",
                "healthcare",
                "government",
                "congress could intervene",
                "the healthcare premiums",
                "healthcare premiums are"
            ],
            "topics": [
                "government",
                "health",
                "economy"
            ],
            "description": "As the government shutdown has stretched on with Democrats refusing to back any funding bill unless it extends ACA subsidies, open enrollment is set to begin on Nov. 1. But House Minority Leader Hakeem Jeffries told \"Face the Nation with Margaret Brennan\" that the healthcare premiums are \"not locked in,\" suggesting that open enrollment could be extended or Congress could intervene.",
            "pub_date": "2025-10-26T16:19:00",
            "creator": "CBS News",
            "content": "As the government shutdown has stretched on with Democrats refusing to back any funding bill unless it extends ACA subsidies, open enrollment is set to begin on Nov. 1. But House Minority Leader Hakeem Jeffries told \"Face the Nation with Margaret Brennan\" that the healthcare premiums are \"not locked in,\" suggesting that open enrollment could be extended or Congress could intervene.",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/086e418a-f3be-4765-be0b-fc3a09460e93/thumbnail/1200x630/269d7f323b17ef0842e879d32609e903/102625-ftn-jeffries.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.02,
                "neg": 0.03,
                "neu": 0.95
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "93fc29f5-3f2f-462c-b943-44d6b71f7d61",
            "title": "New video shows moments before LAPD officers open fire on suspect armed with replica handgun",
            "source_title": "ABC7",
            "source_link": "https://abc7.com",
            "article_link": "https://abc7.com/post/new-video-shows-moments-before-lapd-officers-open-fire-suspect-armed-replica-handgun/18073790/",
            "keywords": [
                "ramirez",
                "officer-involved",
                "investigation",
                "50-year-old",
                "an officer-involved shooting",
                "50-year-old gustavo ramirez",
                "remains under investigation"
            ],
            "topics": [
                "police",
                "shooting",
                "crime"
            ],
            "description": "New video details the moments before Los Angeles police officers opened fire on a man who was armed with a replica handgun in North Hills.",
            "pub_date": "2025-10-26T16:18:15",
            "creator": "KABC",
            "content": "NORTH HILLS, LOS ANGELES (KABC) -- New video details the moments before Los Angeles police officers opened fire on a man who was armed with a replica handgun in North Hills. The incident happened on September 10 when officers were responding to a call about a man armed with a weapon. According to the Los Angeles Police Department, the caller said that the man later identified as 50-year-old Gustavo Ramirez was armed with a glass bottle and a firearm. Police found the suspect near the area of Orion Avenue and Parthenia Street. \"Upon contact, the officers attempted to gain Ramirez's compliance by issuing verbal commands,\" said LAPD in a statement about the incident. \"Ramirez failed to comply, pointed a handgun at the officers and an Officer-Involved Shooting (OIS) occurred.\" Ramirez was sent to the hospital where he later died. The handgun used by Ramirez was later determined to be a black plastic replica handgun, which was recovered at the scene and booked as evidence. Several days after the shooting, LAPD identified the officer involved in the shooting as Miguel Suarez. The shooting remains under investigation.",
            "media_url": "https://vcl.abcotv.net/video/kabc/102525-kabc-11pm-north-hills-police-shooting-vid.mp4",
            "media_type": "video/mp4",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://cdn.abcotvs.com/dip/images/18073833_102525-kabc-11pm-north-hills-police-shooting-vid.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.031,
                "neg": 0.073,
                "neu": 0.896
            },
            "source": {
                "id": "abc7",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "0f9b0926-6924-48db-a04f-5c9dcdf0ebaf",
            "title": "Cyclone Montha: 'Red alert' issued for Andhra Pradesh, Odisha govt puts officials on standby",
            "source_title": "India TV",
            "source_link": "https://www.indiatvnews.com",
            "article_link": "https://www.indiatvnews.com/news/india/cyclone-montha-brewing-in-bay-of-bengal-imd-red-alert-for-andhra-pradesh-odisha-cancels-officials-leaves-govt-on-standby-weather-updates-live-2025-10-26-1014490",
            "keywords": [
                "cyclone montha",
                "andhra pradesh",
                "odisha",
                "severe cyclonic storm"
            ],
            "topics": [
                "weather",
                "cyclone",
                "government"
            ],
            "description": "The India Meteorological Department (IMD) has issued a red alert for several coastal districts of Andhra Pradesh as a severe cyclonic storm, named Montha, intensifies over the Bay of Bengal. The storm is expected to...",
            "pub_date": "2025-10-26T16:18:14",
            "creator": "India TV News Desk",
            "content": null,
            "media_url": "",
            "media_type": "",
            "media_description": "The India Meteorological Department (IMD) has issued a red alert for several coastal districts of Andhra Pradesh as a severe cyclonic storm, named Montha, intensifies over the Bay of Bengal. The storm is expected to...",
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "india-tv-latest-news",
                "country": "IN",
                "political_leaning": "center",
                "reliability_score": 7.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "34b16b78-b7c1-43f7-8cd2-197a9443c025",
            "title": "New York Jets legend Nick Mangold dies aged 41 while seeking kidney transplant",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/sport/2025/oct/26/new-york-jets-legend-nick-mangold-dies-aged-41-while-seeking-kidney-transplant",
            "keywords": [
                "nick mangold",
                "mangold",
                "unfortunately",
                "weightlifting",
                "championship",
                "teammate whose leadership",
                "olympics in weightlifting",
                "offensive line alongside"
            ],
            "topics": [
                "sports",
                "death",
                "illness",
                "transplant"
            ],
            "description": "Center was hugely popular among Jets fanbaseMangold was suffering from rare genetic conditionNick Mangold, a hugely popular player during his 11-season career with the New York Jets, has died at the age of 41. Earlier this month, Mangold said he had been undergoing dialysis and needed a kidney transplant. He sought help from fans of the Jets and Ohio State, where he was a star in college.",
            "pub_date": "2025-10-26T16:18:11",
            "creator": "Tom Lutz in New York",
            "content": "Nick Mangold, a hugely popular player during his 11-season career with the New York Jets, has died at the age of 41. Earlier this month, Mangold said he had been undergoing dialysis and needed a kidney transplant. He sought help from fans of the Jets and Ohio State, where he was a star in college. “In 2006, I was diagnosed with a genetic defect that has led to chronic kidney disease. After a rough summer, I’m undergoing dialysis as we look for a kidney transplant,” he wrote at the time. “I always knew this day would come, but I thought I would have had more time. “Unfortunately, I do not have any family able to donate at this time, so this is why I’m reaching out to you, our NY Jets and Ohio State communities. I am in need of a kidney donor with type O blood.” Mangold was a first-round pick out of Ohio State for the Jets in 2006. He spent his entire NFL career with team, earning seven trips to the Pro Bowl and was an All-Pro twice before he retired in 2016. During that time, the center anchored an offensive line alongside D’Brickashaw Ferguson that helped the Jets reach two AFC championship games. He is currently a nominee for the Pro Football Hall of Fame. Mangold’s toughness was widely admired and he missed only four games in his first 10 seasons in the NFL. “Nick was more than a legendary center,” Jets owner Woody Johnson said in a statement. “He was the heartbeat of our offensive line for a decade and a beloved teammate whose leadership and toughness defined an era of Jets football. Off the field, Nick’s wit, warmth, and unwavering loyalty made him a cherished member of our extended Jets family.” Mangold was a huge favorite with fans, known for his long hair, beard and outgoing personality. He was active on social media and was rarely seen without his backwards baseball cap. He was a regular visitor to Jets game after his retirement he chugged a beer while being inducted into the team’s Ring of Honor in 2022 and stayed in the area when his playing days were over, becoming an assistant coach for Delbarton High School in Morristown, New Jersey. He was married to his childhood sweetheart, Jenny, with whom he had four children, Matthew, Eloise, Thomas, and Charlotte. His sister, Holley, represented USA at the 2012 Olympics in weightlifting. When he announced his illness he paid tribute to his family, saying they had “been my rock every step of the way. This situation has reminded me how lucky I am to have such an amazing family, friends, and community behind me.”.",
            "media_url": "https://i.guim.co.uk/img/media/d21c3182dee647b276977fe954fe1feeadf2114e/341_121_2349_1879/master/2349.jpg?width=140&quality=85&auto=format&fit=max&s=fe716391f051e3529f2793ac0863f402",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Al Pereira/Getty Images",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.154,
                "neg": 0.043,
                "neu": 0.804
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "97ddb8d9-79bf-43fe-b3db-68525678287e",
            "title": "Pratika Rawal suffers ugly injury during Bangladesh clash ahead of World Cup semis, BCCI shares update",
            "source_title": "India TV",
            "source_link": "https://www.indiatvnews.com",
            "article_link": "https://www.indiatvnews.com/sports/cricket/pratika-rawal-suffers-ugly-injury-during-bangladesh-clash-ahead-of-world-cup-semis-bcci-shares-update-2025-10-26-1014491",
            "keywords": [
                "pratika rawal",
                "bangladesh",
                "bcci",
                "india",
                "injury"
            ],
            "topics": [
                "sports"
            ],
            "description": "India opener Pratika Rawal suffered an ugly injury during India's clash against Bangladesh in the Women's ODI World Cup 2025 on Sunday, October 26. Pratika, who recently equaled the world record for fastest to 1000...",
            "pub_date": "2025-10-26T16:17:21",
            "creator": "India TV News Desk",
            "content": null,
            "media_url": "",
            "media_type": "",
            "media_description": "India opener Pratika Rawal suffered an ugly injury during India's clash against Bangladesh in the Women's ODI World Cup 2025 on Sunday, October 26. Pratika, who recently equaled the world record for fastest to 1000...",
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.0,
                "neu": 1.0
            },
            "source": {
                "id": "india-tv-latest-news",
                "country": "IN",
                "political_leaning": "center",
                "reliability_score": 7.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "7e6b2f55-0807-4e7d-ad20-f1fd5213a864",
            "title": "Open: This is \"Face the Nation with Margaret Brennan,\" Oct. 26, 2025",
            "source_title": "CBS News",
            "source_link": "https://www.cbsnews.com",
            "article_link": "https://www.cbsnews.com/video/open-this-is-face-the-nation-with-margaret-brennan-oct-26-2025/",
            "keywords": [
                "margaret brennan",
                "trump",
                "government",
                "president",
                "secretary",
                "treasury secretary scott",
                "secretary scott bessent",
                "the government shutdown"
            ],
            "topics": [
                "government",
                "economy",
                "politics"
            ],
            "description": "This week on \"Face the Nation with Margaret Brennan,\" amid President Trump and Treasury Secretary Scott Bessent's trip to Asia, Bessent joins to discuss the Chinese tariffs, the TikTok deal and the government shutdown at home. Plus. House Minority Leader Hakeem Jeffries joins to discuss the government shutdown.",
            "pub_date": "2025-10-26T16:17:00",
            "creator": "CBS News",
            "content": "This week on \"Face the Nation with Margaret Brennan,\" amid President Trump and Treasury Secretary Scott Bessent's trip to Asia, Bessent joins to discuss the Chinese tariffs, the TikTok deal and the government shutdown at home. Plus. House Minority Leader Hakeem Jeffries joins to discuss the government shutdown.",
            "media_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/10/26/12e19bf8-4bd0-44ee-b435-fa0e200e0968/thumbnail/1200x630/a91d06203e81e4b656c6d6feed60b3f8/102625-ftn-coldopen.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.037,
                "neg": 0.0,
                "neu": 0.963
            },
            "source": {
                "id": "cbs-news",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "bb78ed97-1d42-4087-9850-c17871ea0c07",
            "title": "NCAA ordered to pay $18M to former football player and wife in concussion lawsuit",
            "source_title": "WPTV NewsChannel 5",
            "source_link": "https://www.wptv.com",
            "article_link": "https://www.wptv.com/sports/ncaa-ordered-to-pay-18m-to-former-football-player-and-wife-in-concussion-lawsuit",
            "keywords": [
                "orangeburg county",
                "robert geathers",
                "representatives",
                "encephalopathy",
                "dementia-like",
                "chronic traumatic encephalopathy",
                "influence dementia-like symptoms",
                "that influence dementia-like"
            ],
            "topics": [
                "lawsuit",
                "concussion",
                "sports"
            ],
            "description": "The NCAA owes an ex-college football player and his wife $18 million after a jury found college sports’ major governing body failed to warn the player about the long-term effects of concussions.",
            "pub_date": "2025-10-26T16:16:05",
            "creator": "AP via Scripps News Group",
            "content": "The NCAA owes a former college football player and his wife $18 million, a South Carolina jury decided while finding college sports’ major governing body negligent in failing to warn the player about the long-term effects of concussions. Following a civil trial that wrapped up late last week, Orangeburg County jurors awarded $10 million to 68-year-old Robert Geathers, who played at South Carolina State University from 1977 to 1980 as a defensive end. His wife, Debra, was awarded $8 million, according to a court document. A physician diagnosed Robert Geathers with dementia several years ago, The Times and Democrat newspaper in Orangeburg reported. Now he has trouble with day-to-day tasks such as dressing himself and helping making meals. FROM THE ARCHIVES | Harnessing Your Health: How to manage concussions as an adult Other physicians who testified at the trial said Geathers displays symptoms of chronic traumatic encephalopathy, a degenerative brain disease found in former football players who received repeated blows to their heads while playing. CTE can be diagnosed only posthumously. The couple’s attorneys argued to jurors that blows Geathers took during practices and games for the historically Black school in Orangeburg caused trauma that didn’t show up until decades later, the newspaper reported. Geathers attorney Bakari Sellers alleged the NCAA knew about concussion risks since the 1930s and when Robert Geathers’ college career ended but didn’t tell coaches or players about those risks until later. “All of the information they knew, they withheld,” Sellers told jurors, adding that “their job was to keep the boys safe.\" The verdict can be appealed. NCAA spokesperson Greg Johnson said Saturday in an email that the organization disagreed with the verdict and that it “was prepared to pursue our rights on post-trial motions and on appeal, if necessary.” Johnson said the “NCAA has prevailed in every other jury trial around the country on these issues” and that the South Carolina State team standards “followed the knowledge that existed at the time, and college football did not cause Mr. Geathers’ lifelong health problems.” IN CASE YOU MISSED IT | Michigan QB Jack Tuttle retires from football citing concussion history NCAA trial attorney Andy Fletcher said at the trial that Robert Geathers has several health conditions that influence dementia-like symptoms, and that the NCAA’s football rules committee is composed of representatives of member schools that could propose rules. “There’s going to be head-hits. That’s inherent to the game. You can’t take head-hits out of football,” Fletcher said in closing arguments. According to the newspaper, the jury determined the NCAA “unreasonably increased the risk of harm of head impacts to Robert Geathers over and above the risks inherent to playing football.” And it also determined the NCAA “voluntarily assumed duties to protect the health and safety of Robert Geathers” and that the NCAA “negligently breached their duties” to him. After the trial, Sellers said the result provided justice: “I felt good to hug Debra Geathers. She gets to go home and tell her husband some good news.”.",
            "media_url": "https://ewscripps.brightspotcdn.com/dims4/default/c4c54e3/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=https%3A%2F%2Fewscripps.brightspotcdn.com%2F46%2F44%2Ffe62e129451a905bf45af90b9140%2Fap25015780882760.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.068,
                "neg": 0.072,
                "neu": 0.861
            },
            "source": {
                "id": "wptv-west-palm-beach",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "463dc7bf-f98f-4e07-a971-0571287b1f6c",
            "title": "Scott Bessent says he's 'felt this pain' from China because 'I'm actually a soybean farmer'",
            "source_title": "CNBC",
            "source_link": "https://cnbc.com",
            "article_link": "https://www.cnbc.com/2025/10/26/trump-treasury-bessent-trade-tariffs-china-soybean-farm.html",
            "keywords": [
                "treasury",
                "scott bessett",
                "negotiations",
                "announcement",
                "substantial",
                "government financial disclosure",
                "alleviate american soybean",
                "financial disclosure shows"
            ],
            "topics": [
                "economy",
                "agriculture",
                "politics"
            ],
            "description": "Treasury Secretary Scott Bessent's estimated hundreds and millions of dollars in wealth includes soybean and corn farmland in North Dakota.",
            "pub_date": "2025-10-26T16:15:46",
            "creator": "CNBC",
            "content": "Treasury Secretary Scott Bessett said Sunday he, too, has \"felt pain\" from China refusing to buy U. S.-grown soybeans during a trade conflict with President Donald Trump because \"I'm actually a soybean farmer. Trump is set to meet later this week with Chinese President Xi Jinping in South Korea. Bessent, a former hedge fund executive whose net worth is estimated by Forbes to be around $600 million, was asked about the soybean boycotts on \"This Week\" host Martha Raddatz, who noted that \"American farmers have really suffered.\" China in 2023 and 2024 bought more than half of the soybeans grown in the U. S., accounting for nearly $12. 8 billion in 2024. But after Trump ignited a trade war with Beijing earlier this year, China stopped buying soybeans. \"Do you see a real light at the end of the tunnel there, they may allow soybeans again?\" Raddetz asked. Bessent replied, \"Martha, in case you don't know it, I'm actually a soybean farmer, so I have felt this pain, too.\" Bessent's government financial disclosure shows that he owns soybean and corn farmland in North Dakota that has an estimated worth of between $5 million and $25 million. On that disclosure, Bessent said the farmland generates between $100,000 and $1 million in rental income for him annually. The Treasury secretary told Raddatz on Sunday, \"I think think we have addressed the farmer's concerns, and I'm not going to get ahead of the president, but I believe when the announcement of the deal with China is made public, that our soybean farmers will feel very good about what's going on both for this season and the coming seasons for several years.\".",
            "media_url": "https://image.cnbcfm.com/api/v1/image/108198733-1758026740974-108198733-17579397502025-09-15t072513z_39246082_rc27sgan0zbp_rtrmadp_0_usa-trump-tariffs-china.jpg?v=1758026748&w=1920&h=1080",
            "media_type": null,
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.047,
                "neg": 0.064,
                "neu": 0.889
            },
            "source": {
                "id": "cnbc",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "9a5cb319-16e4-45fb-a7b7-9872c46f3b52",
            "title": "‘All INdiana Politics’ | Oct. 26, 2025",
            "source_title": "WISH-TV",
            "source_link": "https://wishtv.com",
            "article_link": "https://www.wishtv.com/news/allindianapolitics/all-indiana-politics-oct-26-2025/",
            "keywords": [
                "redistricting",
                "congressional",
                "indianapolis",
                "spokesperson",
                "congressional delegation told",
                "drug trafficking continues",
                "s congressional delegation",
                "republican indiana senate"
            ],
            "topics": [
                "politics",
                "government"
            ],
            "description": "INDIANAPOLIS (WISH) On Sunday's edition of \"All INdiana Politics,\" Two members of Indiana’s congressional delegation told News 8 illegal drug trafficking continues to pose a major national security threat. A spokesperson for the Republican Indiana Senate president pro tempore said Wednesday that there is not enough support for redistricting the state. Two members of [.].",
            "pub_date": "2025-10-26T16:15:00",
            "creator": "Jay Adkins",
            "content": "INDIANAPOLIS (WISH) On Sunday’s edition of “All INdiana Politics,” Two members of Indiana’s congressional delegation told News 8 illegal drug trafficking continues to pose a major national security threat. A spokesperson for the Republican Indiana Senate president pro tempore said Wednesday that there is not enough support for redistricting the state. Two members of Indiana’s best political team on Friday said this week’s developments in the redistricting fight are not the last word on the matter. “All INdiana Politics” airs at 9: 30 a. m. Sundays on WISH-TV.",
            "media_url": "https://fuel-streaming-prod01.fuelmedia.io/v1/sem/58165265-734d-4d4d-a23b-1aa5acb8715e.m3u8?swc=ceff7d7a-b1f6-43ca-bf74-a13502d5877f",
            "media_type": "application/x-mpegurl",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://www.wishtv.com/wp-content/uploads/2024/01/03/all-indiana-politics-01032024.png?resize",
            "language": "en",
            "sentiment": {
                "pos": 0.081,
                "neg": 0.124,
                "neu": 0.795
            },
            "source": {
                "id": "wish-tv",
                "country": "US",
                "political_leaning": "nonpartisan",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "9aa69bdf-864e-4ccc-a043-7650c3773b78",
            "title": "Nuggets Nation celebrates a win at home against the Phoenix Suns",
            "source_title": "ABC7 Denver",
            "source_link": "https://www.denver7.com",
            "article_link": "https://www.denver7.com/news/local-news/nuggets-nation-celebrates-a-win-at-home-against-the-phoenix-suns",
            "keywords": [
                "nuggets nation",
                "ball arena",
                "championship",
                "timberwolves",
                "excitement",
                "nuggets redeemed themselves",
                "the minnesota timberwolves",
                "including cameron johnson"
            ],
            "topics": [
                "sports"
            ],
            "description": "Denver7 spoke with Nuggets fans about their predictions going into the season and to hear why they are proud to be part of Nuggets Nation.",
            "pub_date": "2025-10-26T16:12:09",
            "creator": "Maggy Wolanske",
            "content": "DENVER It was the return of the good luck hats, jerseys, and bling as Nuggets Nation filled Ball Arena for the home opener game against the Phoenix Suns. After coming off a loss, the Nuggets redeemed themselves at home, beating the Suns 133 to 111. “We have the best player in the world, so every year is a championship run. At the end of the day, you got Jamal Murray coming back and Jamal Murray is going to give you a solid 20 points a game,” Jose Silva said. Building on the excitement, fans were eager to see new talent on the hardwood, including Cameron Johnson and Bruce Brown, whom the Nuggets picked up in the offseason. “I like all the changes that they made,” said Jen McSween. “I like Cam Johnson, him coming, I think it's going to be really good. Love MPJ, but he had to go, it was time, so I think it’s going to be good.” “I think trading MPJ, being able to pick up four players for his contract, I think, is going to make a huge difference. I think our biggest weakness last year was no depth on the bench,” Justin Sturgill said. While fans were confident going into the game against the Suns, they also agreed that this year their team would win the championship. “I think they have a really good shot. I think that they've made the right changes. I don't think they made the right changes two years ago. I think they made the right changes this offseason to really support Jokic. He needs it. He needs that support,” McSween said. Before tipoff, Nuggets Nation filled Union Station with excitement as fans prepared for the game and bonded over the start of this new season. “Well, I think Denver is just a really good fan city. We got Rockies, we got Broncos, we got Nuggets, and everybody always shows up and shows out for our teams, so you gotta love it. If there's anything going on for the Nuggets, everybody is going to be here, you can count on it.\" David Valdez said. Up next, the Nuggets will play the Minnesota Timberwolves on October 27 at 7: 30 p. m.",
            "media_url": "https://ewscripps.brightspotcdn.com/dims4/default/650ab39/2147483647/strip/true/crop/1280x672+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F38%2F1f%2Fb8d35bfa44a48e73e8116504a32a%2Foutside-union-station.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.184,
                "neg": 0.025,
                "neu": 0.791
            },
            "source": {
                "id": "abc7-denver",
                "country": "US",
                "political_leaning": "center",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "93b41ee7-21f4-4d5a-be64-45c72fda0917",
            "title": "Teyrnged i fam 'gariadus' ar ôl canfod ei chorff yn Sir Ddinbych",
            "source_title": "BBC News",
            "source_link": "https://www.bbc.co.uk",
            "article_link": "https://www.bbc.com/cymrufyw/erthyglau/cvgm64l81gpo?at_medium=RSS&at_campaign=rss",
            "keywords": [
                "mae",
                "heddlu",
                "lofruddiaeth",
                "preifatrwydd",
                "ychwanegodd",
                "bydd swyddogion ychwanegol",
                "dywedodd y prif arolygydd",
                "swyddogion ychwanegol yn"
            ],
            "topics": [
                "crime",
                "law",
                "government"
            ],
            "description": "Teyrnged i fam 'gariadus' ar ôl canfod ei chorff yn Sir Ddinbych",
            "pub_date": "2025-10-26T16:10:09",
            "creator": "BBC News",
            "content": "Mae Heddlu'r Gogledd wedi cadarnhau enw menyw a fu farw ym Mhrestatyn ddydd Gwener. Fe wnaeth yr heddlu gadarnhau ddydd Sul mai menyw leol o'r enw Angela Shellis, 45, oedd yr unigolyn. Cafodd swyddogion eu galw i ardal Morfa, Prestatyn tua 08: 40 ddydd Gwener ar ôl i aelod o'r cyhoedd ddod o hyd i gorff yn ardal Morfa, ger Dawson Drive. Fe gafodd dyn lleol 18 oed ei arestio brynhawn Gwener, ar amheuaeth o lofruddiaeth yn ardal Coniston Drive ym Mhrestatyn ac mae'n parhau yn y ddalfa. Dywedodd llefarydd ar ran y teulu fod Angela \"yn ferch, chwaer, mam ac yn fodryb gariadus a bydd pawb yn ei cholli'n fawr\". Mae'r llu wedi dweud fod y teulu yn derbyn cymorth gan arbenigwyr a gofynnodd i bobl barchu eu preifatrwydd. Dywedodd Y Prif Arolygydd Andy Gibson: \"Dwi'n apelio ar unrhyw un oedd o amgylch ardal Morfa yn agos i'r caeau pêl-droed rhwng 03: 00 a 08: 39 ddydd Gwener. \"Os oeddech yn yr ardal yn ystod yr amseroedd yma, plîs cysylltwch â Heddlu Gogledd Cymru,\" ychwanegodd. Ychwanegodd y llu y bydd swyddogion ychwanegol yn yr ardal yn ystod y penwythnos i roi sicrwydd i'r gymuned.",
            "media_url": "https://ichef.bbci.co.uk/ace/branded_cymrufyw/1200/cpsprodpb/1563/live/0adc9940-b281-11f0-a8ca-6b16930d41ff.jpg",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": null,
            "media_thumbnail": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1563/live/0adc9940-b281-11f0-a8ca-6b16930d41ff.jpg",
            "language": "en",
            "sentiment": {
                "pos": 0.0,
                "neg": 0.027,
                "neu": 0.973
            },
            "source": {
                "id": "bbc",
                "country": "GB",
                "political_leaning": "center",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "05717ab1-1c34-473b-b26d-c9c95915ac77",
            "title": "Trump told Pence ‘you’ll go down as a wimp’ in January 6 phone call, book says",
            "source_title": "The Guardian",
            "source_link": "https://www.theguardian.com/us",
            "article_link": "https://www.theguardian.com/us-news/2025/oct/26/trump-pence-call-january-6-book",
            "keywords": [
                "donald trump",
                "mike pence",
                "unsuccessfully",
                "vice-president",
                "correspondent",
                "congressional session certifying",
                "political correspondent jonathan",
                "unsuccessfully demanding pence"
            ],
            "topics": [
                "politics"
            ],
            "description": "Book cites Pence’s notes from call with Trump, who called vice-president a ‘wimp’ if he certified Biden’s 2020 victoryOn the day that his supporters attacked the US Capitol because his 2020 re-election run ended in defeat, Donald Trump called his vice-president at the time, Mike Pence, and told him he would go down in history as a “wimp” if he certified the election result, a new book says. Those details were revealed The book, titled Retribution, cites Pence’s notes from the 6 January 2021 phone call with Trump, who was purportedly trying to shame his vice-president into refusing to certify Joe Biden’s victory weeks earlier in the White House.",
            "pub_date": "2025-10-26T16:09:21",
            "creator": "Ramon Antonio Vargas",
            "content": "On the day that his supporters attacked the US Capitol because his 2020 re-election run ended in defeat, Donald Trump called his vice-president at the time, Mike Pence, and told him he would go down in history as a “wimp” if he certified the election result, a new book says. Those details were revealed The book, titled Retribution, cites Pence’s notes from the 6 January 2021 phone call with Trump, who was purportedly trying to shame his vice-president into refusing to certify Joe Biden’s victory weeks earlier in the White House. “If you do that, I made a big mistake five years ago,” Trump is said to have told Pence, who was his running mate when he won his first presidency in 2016. “You’ll go down as a wimp.” According to Retribution, before he ultimately fulfilled his duty of certifying Biden’s victory, Pence’s notes maintain that he told Trump both had taken “an oath to support + defend the constitution”. “It doesn’t take courage to break the law,” Pence’s notes portray him as saying to Trump. “It takes courage to uphold the law.” The notes cited in Retribution say Trump also reportedly told Pence, “You listen to the wrong people.” Pence has publicly said that he certified Biden’s victory, despite Trump’s wishes, because he knew he had no legal right to overturn Trump’s electoral defeat at the hands of Biden. That stand came as Trump and his allies brazenly pushed lies that electoral fraudsters had rigged the 2020 election in Biden’s favor, leading to his victory. A mob of Trump supporters eventually stormed the US Capitol, unsuccessfully demanding Pence’s hanging and delaying the joint congressional session certifying Biden’s victory by several hours. Federal authorities never charged Trump in the attack. Yet, as Retribution pointed out, prosecutors reviewed Pence’s notes as evidence of the hours before the attack. Prosecutors did convict or at least criminally charge more than 1, 500 other people who were attributed roles in the January 6 attack, which a bipartisan US Senate committee linked to several deaths, including the suicides of law enforcement officers who defended the Capitol that day. Then in January, in one of Trump’s first acts back in the Oval Office after he defeated Kamala Harris Biden’s vice-president in the 2024 presidential election, Trump pardoned or commuted the sentences of all linked to the Capitol attack. JD Vance was Trump’s running mate when the latter man won his second presidency and summarily ignited warnings about the US’s “trajectory” toward authoritarian rule, according to an assessment from former intelligence and national security officials. Pence did not pursue public office during that election cycle. The Retribution excerpt arrived days after Steve Bannon, who was chief White House strategist during Trump’s first presidency, said in an interview with the Economist that he predicted Trump would get “a third term” in 2028 despite being barred by the US constitution. “People ought to just get accommodated with that,” said Bannon, who touted a “plan” purportedly to be laid out later that would circumvent the constitutional amendment limiting US presidents to two terms.",
            "media_url": "https://i.guim.co.uk/img/media/69406ca203ad6b600612b86274e0dc9c7e27fd24/425_0_4739_3792/master/4739.jpg?width=140&quality=85&auto=format&fit=max&s=b72542e25e9ff71145eebf4204e83f31",
            "media_type": null,
            "media_description": null,
            "media_credit": "Photograph: Faith Ninivaggi/Reuters",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.074,
                "neg": 0.103,
                "neu": 0.823
            },
            "source": {
                "id": "the-guardian",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 9.0,
                "type": "mainstream_news"
            }
        },
        {
            "id": "195e3c56-1d0a-4b9c-8325-4c1ec4b66587",
            "title": "Aston Villa beat Manchester City to maintain winning Premier League run",
            "source_title": "The Independent",
            "source_link": "https://independent.co.uk",
            "article_link": "https://www.independent.co.uk/sport/football/matty-cash-aston-villa-manchester-city-premier-league-villa-b2852500.html",
            "keywords": [
                "matty",
                "cash",
                "uncharacteristic",
                "competitions",
                "transforming",
                "produced an uncharacteristic",
                "transforming their fortunes",
                "on-loan manchester united"
            ],
            "topics": [
                "sports",
                "football",
                "business"
            ],
            "description": "Aston Villa beat Manchester City to maintain winning Premier League run",
            "pub_date": "2025-10-26T16:07:28",
            "creator": "Jonathan Veal",
            "content": "Matty Cash’s first-half fizzer earned Aston Villa an excellent 1-0 win over Manchester City, whose Premier League title hopes took an early blow. Cash fired home from the edge of the area in the 19th minute and that proved enough for a fourth league win in a row for Villa, who celebrated Unai Emery’s third anniversary in charge in style. It was a third successive home victory over Pep Guardiola’s side, who fell six points behind leaders Arsenal and face the prospect of another hunt of Mikel Arteta’s side after Christmas. City were stifled excellently by a perfect Villa gameplan and Erling Haaland was stopped from scoring for just the second time this season in all competitions, ending a 12-game spree. Such a run of results against Guardiola’s side would not have seemed possible before Emery arrived at Villa Park in October 2022, transforming their fortunes. And after a slow start to the campaign, they again look like challenging at the top end of the Premier League. City’s best period of the game came in the opening 10 minutes and they were close to an opener in the sixth minute when Tijjani Reijnders flashed an effort just over from the edge of the area. But Villa began to take control and the decisive moment of the game arrived in the 19th minute as they went ahead from a set-piece. They took a short corner to Emiliano Buendia and he crossed the ball to the edge of the area, where Cash collected it before unleashing a low shot across his body that curled into the bottom corner. City could have been level three minutes later as Haaland produced an uncharacteristic miss. Bernardo Silva beat the offside trap and slipped in the Norwegian but his shot was too close to Emiliano Martinez. That was as good as it got, though, as Villa pushed for a second. John McGinn might have expected to score when he had time and space on the edge of the box but his shot deflected off John Stones and just wide. From the resulting corner Ollie Watkins saw a free header blocked. McGinn came close early in the second half when he met a corner with a sweet strike but it was blocked. City upped the ante in search of the equaliser and were denied by some heroic defending on the hour as Ezri Konsa blocked Savinho’s fierce shot and then Pau Torres was in position on the goalline to turn over the Brazilian’s second effort. Jadon Sancho, on as an early sub for the injured Buendia, had a quiet game but could have doubled the lead in the 69th minute when he had two chances from a narrow angle but both were saved by Gianluigi Donnarumma. The on-loan Manchester United man was himself subbed soon after as the hosts continued to probe, with the excellent Watkins inches away from being able to get on the end of Ross Barkley’s through-ball.",
            "media_url": "https://static.independent.co.uk/2025/10/26/16/3ad0d2b39624df0c1beec71b14b4cd97Y29udGVudHNlYXJjaGFwaSwxNzYxNTgwMzE0-2.82161394.jpg?width=1200&auto=webp&crop=3%3A2",
            "media_type": "image/jpeg",
            "media_description": null,
            "media_credit": "PA Wire",
            "media_thumbnail": null,
            "language": "en",
            "sentiment": {
                "pos": 0.114,
                "neg": 0.056,
                "neu": 0.83
            },
            "source": {
                "id": "the-independent",
                "country": "GB",
                "political_leaning": "center_left",
                "reliability_score": 8.0,
                "type": "mainstream_news"
            }
        }
    ]
}